[
    {
        "name": "Fiesta Winery",
        "id": 252,
        "open_for_business": 1,
        "tags": [
            "Wine Bars",
            "Wine Tasting Room"
        ],
        "website": "https://www.fiestawinery.com/marble-falls",
        "longitude": -98.276736,
        "latitude": 30.572343,
        "address": "309 Main StSte 9",
        "postal_code": "78654",
        "city": "Marble Falls",
        "state": "TX",
        "telephone": "(830) 637-7702",
        "price": "",
        "hours": {
            "Mon": "11:00 AM - 6:00 PM",
            "Tue": "11:00 AM - 6:00 PM",
            "Wed": "11:00 AM - 6:00 PM",
            "Thu": "11:00 AM - 6:00 PM",
            "Fri": "11:00 AM - 6:00 PM",
            "Sat": "11:00 AM - 6:00 PM",
            "Sun": "12:00 PM - 5:00 PM"
        },
        "accommodations": [
            "Street Parking"
        ],
        "unaccommodations": [],
        "rating_value": "4.5",
        "review_count": "16",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/ef73d3Fv4RJlVfdzUNNquA/l.jpg",
        "reviews": [
            {
                "author": "Kristen W.",
                "datePublished": "2022-03-18",
                "reviewRating": "5",
                "description": "So, I am not a wine drinker, but came with a group of girlfriends who were and we came into this place. My bestie knows me well and Gay Nell was amazing to help determine which wines would be the best to try that would give me an opportunity to find something that may work for me.  I ended up buying my first bottle of wine - Sandia... and walked away having a few that were pretty good. I am learning more about what wines might be more my style. However, truth be told.. still love my margaritas and rum (Sailor Jerry) and diet, hands down.  Thank you Gay Nell, well done and a super fab lady!"
            },
            {
                "author": "Julia K.",
                "datePublished": "2022-02-26",
                "reviewRating": "5",
                "description": "Tastings were fun.  The service was fantastic.  Left with 3 bottles of wine.  Try the Texas Well Water, my husband who does not like or drink wine even said he would be helping me with the 3 bottles."
            },
            {
                "author": "Michaela M.",
                "datePublished": "2021-09-14",
                "reviewRating": "5",
                "description": "My friends and I were visiting Fredericksburg for a quick \"stay-cay\" and picked this spot because of the cute outdoor area.   The wines were amazing and the service was excellent. We ended up purchasing enough wine to cover our wine tastings and went home happy with plenty of wine to enjoy!"
            },
            {
                "author": "Kim T.",
                "datePublished": "2021-12-27",
                "reviewRating": "5",
                "description": "First time visiting this winery and it is amazing. The customer service is outstanding and I felt really taken care of. You can also enjoy your wine and walk around the shops here as it is legal in marble falls :) 10/10"
            },
            {
                "author": "Heather G.",
                "datePublished": "2021-07-08",
                "reviewRating": "5",
                "description": "Love love love this place. My first Fiesta experience was in Fredericksburg so I had to check out the one in Marble Falls. Staff is always super kind and helpful and I've never had a bad wine at Fiesta. I'll be back soon!!"
            },
            {
                "author": "Mariah F.",
                "datePublished": "2020-07-23",
                "reviewRating": "5",
                "description": "Atmosphere: really cute place in this little plaza where yo can get your wine and go outside and sit at the tables. The lady working at the front was really kind, offered some great suggestions given our usual taste in wine is not on the sweet side but on the dry side.  Wine. To continue, I'm not actually sure if they have anything besides sweet wines since we parted ways from our syrahs and cabs to opt for a white peach sangria slushy and a chilled sweet red blend on this very hot day. The slushy was sweet and easy to drink (maybe a little too fast) and the red was good too. Next time I'll definitely have to drink the red first then the slushy to have it make more sense to my taste buds, they got confused. I'd get both again.   Price: pretty normal prices so I don't really have much to say here. Next time I'd like to come back and get some of the cans of wine and take them with me!"
            },
            {
                "author": "Rachel T.",
                "datePublished": "2021-01-11",
                "reviewRating": "5",
                "description": "First time we went to Fiesta Winery we signed up to be members because the wine is so good and a great deal! The staff is wonderful. We live about 30 minutes away and enjoy going. You can have a to go cup of wine and walk the Main Street to look at the shops. There are tons of options. They also have cheese plates. Five star!"
            },
            {
                "author": "Ashley L.",
                "datePublished": "2019-12-01",
                "reviewRating": "5",
                "description": "Really glad Marble Falls continues to grow and now has a couple of breweries and wineries. Fiesta is a great stop especially for those visiting or shopping because it's located on Main Street by all the shops. My parents who live in Marble Falls love this place and are members here. Stop by and check them out!"
            },
            {
                "author": "Rebecca S.",
                "datePublished": "2020-06-01",
                "reviewRating": "5",
                "description": "Because of COVID I couldn't do a tasting but I got great service and left with 2 bottles and a 4 pack of the Lime in the Coconut"
            },
            {
                "author": "Stephanie B.",
                "datePublished": "2021-02-05",
                "reviewRating": "2",
                "description": "Why would you close at 6 on a Friday!? All the breweries were open until 10 but I can't have gluten so my first night in town started off poorly. Plus the guy working didn't even greet us."
            },
            {
                "author": "Sissy H.",
                "datePublished": "2021-07-30",
                "reviewRating": "5",
                "description": "We took a girls day trip to Marble Falls and I put this on my list of places to try. One of my friends had never done a wine tasting and had never really drank wine so I wanted her to have a great first time. Well Laurie made this AWESOME! She took the time with each of us to go over what flavors we liked and made suggestions. She was spot on. Very knowledgeable, warm, friendly and entertaining.  She also shared a map of wineries and distilleries in the area.  We loved the cool, open store/tasting bar. We all walked out with bottles that I know we are going to enjoy.  Great stop on a hot Texas day!"
            },
            {
                "author": "Deepak B.",
                "datePublished": "2020-09-03",
                "reviewRating": "1",
                "description": "I'm glad they're open during covid but they're  cheese plate was packaged cream cheese, nothing special about the crackers, definitely not worth $10 not even worth $5 highly do not recommend spend your money somewhere else"
            },
            {
                "author": "Rosi C.",
                "datePublished": "2020-02-21",
                "reviewRating": "5",
                "description": "I love this location. Patrice and Elvira are so much fun and they gave us so many tips for our girls Fredericksburg weekend!"
            },
            {
                "author": "Jessica J.",
                "datePublished": "2019-11-21",
                "reviewRating": "5",
                "description": "Me and my fiance came here and did the wine tasting and it was all very delicious!! We ended up taking home the Texas Well Water which is a must try. Not to mention the hospitality was amazing!! Next time we are in town we are definitely coming back!!"
            },
            {
                "author": "Jan M.",
                "datePublished": "2019-08-29",
                "reviewRating": "5",
                "description": "Great tasting room in downtown Marble Falls!  The staff is very friendly and knowledgeable and is willing to give small samples so that you can get a great bottle or glass of wine if you don't want to have a tasting. Rachel, Page, Rhonda and the manager, Patrice go above and beyond to make guests feel very welcome.  Their food is excellent, too!  We were also able to meet the owner during their Grand Opening and learned about the very interesting history of the winery."
            },
            {
                "author": "Jon-Erik J.",
                "datePublished": "2019-07-06",
                "reviewRating": "5",
                "description": "Great new spot in town. My wife and I went for a tasting and it was fantastic.  Great service and nice wine. The Sangiovese is a real winner.  We will be back!  Check it out."
            }
        ]
    },
    {
        "name": "Perissos Vineyard and Winery",
        "id": 527,
        "open_for_business": 1,
        "tags": [
            "Wineries"
        ],
        "website": "http://perissosvineyards.com/",
        "longitude": -98.381065,
        "latitude": 30.711163,
        "address": "7214 Park Road 4 W",
        "postal_code": "78611",
        "city": "Burnet",
        "state": "TX",
        "telephone": "(512) 820-2950",
        "price": "Moderate",
        "hours": {
            "Mon": "12:00 PM - 5:00 PM",
            "Tue": "12:00 PM - 5:00 PM",
            "Wed": "12:00 PM - 5:00 PM",
            "Thu": "12:00 PM - 5:00 PM",
            "Fri": "11:00 AM - 6:00 PM",
            "Sat": "11:00 AM - 6:00 PM",
            "Sun": "12:00 PM - 5:00 PM"
        },
        "accommodations": [
            "Offers Takeout",
            "Masks required",
            "Staff wears masks",
            "Many Vegetarian Options",
            "Accepts Credit Cards",
            "Good For Kids",
            "Private Lot Parking",
            "Bike Parking",
            "Dogs Allowed",
            "Wheelchair Accessible",
            "Women-owned",
            "Offers Military Discount",
            "Open to All"
        ],
        "unaccommodations": [
            "No Delivery",
            "Accepts Android Pay",
            "Accepts Apple Pay",
            "Accepts Cryptocurrency",
            "Offers Catering",
            "No Wi-Fi"
        ],
        "rating_value": "4.5",
        "review_count": "117",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/r2-5wxQHST1HJQyOML6zHw/l.jpg",
        "reviews": [
            {
                "author": "Jim H.",
                "datePublished": "2021-11-27",
                "reviewRating": "5",
                "description": "If you love wine and you're visiting Austin, you should visit Perissos Vineyard.  They have both indoor and outdoor seating that overlook the vineyard.  The grapes used for their wines are locally grown and processed.    Also, if you have a couple hours to spare, then take their Winemaker's Tour and Tasting.  Our tour guide, Greg, is very knowledgeable and he will keep you entertained throughout the entire tour.  My current favorite is their 2018 Racker's Blend which is a mix of all their leftover reds of that season and a close second would be their Malbec.  All their wines are great though!  Overall, a beautiful vineyard with amazing atmosphere and people!  A must go if you're in the area."
            },
            {
                "author": "Monica Q.",
                "datePublished": "2022-04-02",
                "reviewRating": "4",
                "description": "Worth the trip. We are on the wine trail and made a stop here. Very welcoming environment. Everyone was so nice. The view was beautiful. The wine was so yummy. We started with a semi sweet white that I could drink all day and night. They had live music and additional canopies set up for additional shade. It was a beautiful day and had we not been on the wine trail I could hang out here all day."
            },
            {
                "author": "Chanele R.",
                "datePublished": "2021-12-31",
                "reviewRating": "5",
                "description": "Perissos is in a beautiful location in the Texas Hill Country, and it is a good place to get delicious wine and kind, friendly service. I went with my family the week before Christmas, and as the only one doing a tasting (the only drinker), I was able to enjoy wine while they set up a picnic outside in the beautiful setting. The winery has a lot of picnic tables to sit and enjoy among the scenery, which includes a lot of labeled vines. The inside is spacious and tastefully-decorated, and the staff is so nicel I especially loved talking with the blonde from Kentucky - I wish I had gotten her name! My favorite wine was the rosé for sure. I liked it so much that I paused my tasting to enjoy a glass with my lunch, then resumed with the others. I find different places suit my preferences differently, and Perissos is filed in my mind for their rosé. But don't get me wrong - all of their wines are quality, and this place should definitely be on your Hill Country tour!"
            },
            {
                "author": "Shashikala P.",
                "datePublished": "2020-12-31",
                "reviewRating": "5",
                "description": "Such a wonderful place, awesome service and luxurious wine! We did a wine tasting, lady who poured us was knowledgeable, friendly, welcoming. I told her I like semi-sweet, there were no semisweet wines on there tasting menu but still she poured one instead of wherever there was on a menu and I absolutely loved it, it's like she read my taste:) All the wines on the tasting menu was good, they taste like they describe it. They have few tables outside with shade, it's so calm, peaceful and nice place to enjoy the wine. Will be back soon, Definitely visit this place!"
            },
            {
                "author": "Dustin T.",
                "datePublished": "2021-05-10",
                "reviewRating": "5",
                "description": "Visited this winery and it was a pretty great experience. We briefly sampled a couple of wines before buying a bottle (and then another!). The property and the facility are really top notch.  The atmosphere was great. There was seating inside but it was a nice day so we sat in the shade under an oak tree.  Dalton helped us mostly and he steered us in the right direction. Everything we tasted was good. We preferred some wines over others but really didn't have anything bad.  We're looking forward to a return visit!"
            },
            {
                "author": "Brendan E.",
                "datePublished": "2022-02-10",
                "reviewRating": "5",
                "description": "We had a wonderful time. We've been before and the wine and atmosphere brought us back. Carrie is an absolute treasure and treated us like royalty, giving us a personalized tasting and great recommendations once we moved to glasses. Our experience without Carrie would have been much different. Thankful for her and the excellent service she provided. Definitely make time to stop here!"
            },
            {
                "author": "Cynthia V.",
                "datePublished": "2021-03-26",
                "reviewRating": "4",
                "description": "This is a beautiful winery located near Inks Lake State Park. In fact, we came here to unwind after a morning of hiking the state park and it was a lovely place to do a tasting and enjoy the sunny weather. Friendly service, excellent patio/outdoor seating, and a gorgeous interior building. Definitely recommend!"
            },
            {
                "author": "John S.",
                "datePublished": "2021-09-30",
                "reviewRating": "5",
                "description": "OMG !!! Be there or be square. If you like wine; If you like to drink wine; If you want to drink wine in an absolutely gorgeous setting, plan a day to come to Perissos vinyard. We have had the pleasure of visiting vinyards in Tuscany, Italy and this rekindles those memories. It is an easy ride. You enter through the vinyard and arrive at the beautiful tasting building and picnic table area under the live oaks. This has become a family destination for special celebrations, usually birthdays. We usually bring our snacks, sandwiches etc. The tasting room is beautiful. Their wines are world class. We usually purchase bottles of Montepulciano and Temperillo but have sampled others and they are all exceptional. Our usual mode of transportation is our personal vehicles but on one occasion, we rented a limo (Good idea). The place is pooch and kid friendly as well. You will never be disappointed."
            },
            {
                "author": "Jamie P.",
                "datePublished": "2021-02-06",
                "reviewRating": "4",
                "description": "We ended up accidentally visiting the same Saturday of their membership wine pickup, so it was really busy! We were lucky that visitors had the option of wine tasting booths outside or buying a glass/bottle inside. Considering it was so busy, their lines moved fairly quickly. Having not been before, we opted to purchase a bottle and relax on the grounds since it was a beautiful day. The bottle was $50 and it was a mediocre wine. Not the best, but not the worst. They might have better options than the one we chose. The setting was beautiful and the guitarist they had playing outside was fantastic. Worth a day trip!"
            },
            {
                "author": "Ross M.",
                "datePublished": "2022-03-05",
                "reviewRating": "5",
                "description": "Of all the vineyards in the Hill Country theses folks are the most informative and knowledgeable of any we have been. Granted it is located other than 290 but find it. It is well worth the trip!  Just an excellent experience."
            },
            {
                "author": "Bryan D.",
                "datePublished": "2021-06-01",
                "reviewRating": "5",
                "description": "Excellent experience here yesterday. The wine tasting was very well organized and the wines were very delicious. The Malbec was one of the best Texas Malbecs I have ever tasted. I bought a bottle to bring home.  The charcuterie board was delicious.  Beautiful setting too, got a glass and went outside to enjoy scenery and view.  Great experience and very friendly staff. Highly recommend this winery. I'll be back for sure."
            },
            {
                "author": "Belinda M.",
                "datePublished": "2021-08-26",
                "reviewRating": "5",
                "description": "Amazing experience! Stephanie was an awesome host. Very knowledgeable about their wine/wine. Definitely the best Texas wines we have tasted. A wonderful visit."
            },
            {
                "author": "Angie C.",
                "datePublished": "2021-11-27",
                "reviewRating": "4",
                "description": "I wanted to love the wine based on reviews but unfortunately I did not. Great effort but the prices do not reflect the quality. A good one time visit and purchased a bottle to support small local business. The grounds are lovely and peaceful."
            },
            {
                "author": "Melanie B.",
                "datePublished": "2019-12-04",
                "reviewRating": "3",
                "description": "I have never not loved a winery and the tasting experience... until now. I went with a few girlfriends for a birthday party. We ended up having to wait on another party for almost two hours. They were running late, then had wrong directions... it was a family birthday outing for them as well so we were trying to be gracious but dang... it was over two hours and we only got an ounce of complimentary wine to hold us over. The location is lovely and the live music was great. The winery was packed full of couples, dogs here and there and locals. There was a fun bachelorette group there as well. We finally got started on the pairings and I must say that I literally thought it was a joke. Dorito dust on a piece of shaving of a commercial block of cheese, a tough stale piece of beef jerky that I stuck in my purse and brought home to my dog who had been at home waiting on me for hours and he doesn't turn down anything edible or non edible for that matter but he wanted nothing to do with the pairing jerky. The wine pours were the weakest I've ever tasted. Jeremy was nice but he just didn't bring it. We all left starving and thirsty. We all four agreed that it was a long drawn out one hitter quitter.  The customer service and personable attention just was not there. We finished with a half a mini s'more and were so ready to get back to our weekend lake house and enjoy our own wines and snacks.  I would definitely revamp the tasting menu and be a little bit more generous with the pours, especially if you make a pre paid group of ladies celebrating a birthday wait to get started at 5:30 when we rushed to all get there by 2:45 to start at 3.."
            },
            {
                "author": "Steve H.",
                "datePublished": "2021-02-27",
                "reviewRating": "5",
                "description": "We were RVing at Lake Bucannon and did a day trip to Perissos Vineyard. This is an exceptional winery! The two gentleman waiting on us outside and were very professional and knowledgeable in explaining about the various wines they had to offer. We ended up spending two hours enjoying the view of the vineyard and several wines. Definitely must go to if you are close to the vineyard."
            },
            {
                "author": "Bonnie R.",
                "datePublished": "2020-09-09",
                "reviewRating": "5",
                "description": "My son surprised his girlfriend this past weekend by proposing at this beautiful winery. The staff were so accommodating on helping us pull off this surprise! My son and future daughter-in-law raved about the staff, the beauty of the winery and the wonderful wine.  Thank you again Perissos!"
            },
            {
                "author": "Nancy C.",
                "datePublished": "2020-08-29",
                "reviewRating": "5",
                "description": "Great wine and great place for COVID-19 .. our wine was 30dlls pricey but Wth is our anniversary  nice view and great atmosphere!!!!"
            },
            {
                "author": "Tiffany C.",
                "datePublished": "2018-04-22",
                "reviewRating": "5",
                "description": "Perissos exceeded my expectations!! Its my new favorite vineyard in Texas. Out of all Hill Country wineries I've visited, this is most reminiscent of Napa. From literally first moment you drive in, you're surrounded by unending acres of vines. As you venture in, you'll see vineyards galoreandits breathtakingly beautiful. Great photo-op!  LOCATION/ATMOSPHERE: About an hour out from Austin, its close enough for day trip. Its also right by Inks Lake, so take a detour if you want nature too. Tasting room itself is nice- very clean, modern, and country-like with stone walls, wood tablesandindustrial steel chairs. Outside are many picnic tables on a shaded porch or under big trees, so enjoy sipping your wine while looking out at the gorgeous view...nothing like Hill Country! Very laid back.  WINE: Tasting menu is preset ($15 for 6), but offers well-balanced variety. I'm generally not a fan of pre-set menus because there's typically at least a few I will not like. But I loved Perissos' menu and found it to be a strong pre-set (preface: I love wine, specifically dry wine, so my opinion may vary from your palette). All 6 are exceptionally smoothandeasy to drink. Whether light, medium, or full-bodied, my friends and I were thoroughly impressed with each. Each wine is substantial, boasting many wonderful notes. My favorite was the 2015 Racker's Blend. It is made with 8 different redsandpacked with flavor, yet so easy to drink and delightfully smooth with silky long finish. Pours are decent size. All wines 100% Texas grown. Great value tasting!   SERVICE: Excellent! We were immediately greeted by the sweetest lady upon entry. Our server was attentive and came back often to check on us. She was great at not rushing the tasting, letting us enjoy our wine. She also gave detailed descriptions/history of wine before each pour, which I definitely appreciated.  Overall, I absolutely loved Perissos! It is so adorable and perfect escape from the city. I could easily spend the whole afternoon here on a beautiful Texas day...oh wait, I did! Come here for a day-trip getaway and gorgeous views, chill vibes, good wine!"
            },
            {
                "author": "Michael B.",
                "datePublished": "2018-04-06",
                "reviewRating": "3",
                "description": "A good family-owned vineyard, with some fine wines.  All in all a pleasant stop if you're on the Texas wine hunt!  Perissos is located somewhat off the usual 'Texas Wine Trail' along the 290, as it's in Burnet County and relatively isolated from fellow wineries.  Either coming south off 29 or west off 281, the route Park Road 4 is one of the prettiest in Hill Country.   The location is more functional than luxurious, as the tastings take place in a sort of upscale barn-style facility.  However the views off the deck are quite nice and one can see the horses that the family keeps on-site.  Flights cost $15 for six wines on a single pre-selected list.  The selections vary in flavor, and of course YMMV with any recommendation.  But of special mention is their 2015 Fiore Secco, which is a variant of Muscat with notes of ginger and honey.  Also recommended is their cheese plate, which nicely complements their wine.  While I'd have liked some more flexibility in what one could try with a flight, this is a definite recommend so far as a place to try local Texas wine product!"
            },
            {
                "author": "Johna R.",
                "datePublished": "2019-07-07",
                "reviewRating": "5",
                "description": "We're wine drinkers (not habitual winery occupants) and loved the Perissos tasting experience.  We walked in on a Sunday afternoon for the $15 tasting and found the grounds beautiful, all the occupants friendly and knowledgeable, and the wine definitely up to our standards.  The tasting included 6 wines (ranging from sweeter white to dry reds) made from Texas-sourced grapes and rather than having you stand at a bar they have table service. The bottles themselves are reasonably priced and the wine club would be a definite investment if we lived a few hours closer."
            }
        ]
    },
    {
        "name": "Spicewood Vineyards",
        "id": 598,
        "open_for_business": 1,
        "tags": [
            "Wineries"
        ],
        "website": "http://www.spicewoodvineyards.com",
        "longitude": -98.19016,
        "latitude": 30.458613,
        "address": "1419 County Rd 409",
        "postal_code": "78669",
        "city": "Spicewood",
        "state": "TX",
        "telephone": "(830) 693-5328",
        "price": "Moderate",
        "hours": {
            "Mon": "11:00 AM - 6:00 PM",
            "Tue": "11:00 AM - 6:00 PM",
            "Wed": "11:00 AM - 6:00 PM",
            "Thu": "11:00 AM - 6:00 PM",
            "Fri": "11:00 AM - 6:00 PM",
            "Sat": "11:00 AM - 6:00 PM",
            "Sun": "11:00 AM - 6:00 PM"
        },
        "accommodations": [
            "Offers Delivery",
            "Accepts Credit Cards",
            "Private Lot Parking",
            "Bike Parking",
            "Dogs Allowed",
            "Wheelchair Accessible"
        ],
        "unaccommodations": [
            "No Takeout",
            "Accepts Apple Pay",
            "Offers Catering",
            "Not Good For Kids",
            "No Happy Hour"
        ],
        "rating_value": "4.5",
        "review_count": "112",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/n5TGV8GyrLJzhHmsUiNDpw/l.jpg",
        "reviews": [
            {
                "author": "L.R. L.",
                "datePublished": "2022-03-18",
                "reviewRating": "5",
                "description": "Ok, after the COVID pandemic, Trump's departure and the Russian invasion of Ukraine, brothers and sisters, you and me, need a break.  This is THE place.  Great refreshment, great ambiance.    You and I owe having a this vineyard   Live is short, do not wait, go to this fine establishment NOW."
            },
            {
                "author": "Suley Z.",
                "datePublished": "2022-03-27",
                "reviewRating": "5",
                "description": "Such a beautiful place! So peaceful and beautiful oak. They have cute dogs here which is a plus. Their wine selection was great. Our host was just great, got 6 tastings for 6. Good wines. Enjoyed every moment of it."
            },
            {
                "author": "Priya K.",
                "datePublished": "2021-09-12",
                "reviewRating": "5",
                "description": "So glad we stumbled upon this beautiful winery while we were visiting the horseshoe Bay Area. Walked in on Sunday afternoon, they took us without reservations. Beautiful outdoor patio seating or you can sit inside. They have 2 tasting menus to choose from for $15 each. Hubby went for the bold reds. They don't have all white tasting but our amazing server let me taste all the sparkling wines which was so fun! The sparkling Chardonnay was my favorite. Hubby's favorite was independence and tandem.  They have charcuterie boards ($25)  or you can bring your own food. We got the charcuterie board and had a great selection of cheese."
            },
            {
                "author": "Chanele R.",
                "datePublished": "2021-12-31",
                "reviewRating": "4",
                "description": "I am working on a plan to visit all of the Hill Country wineries at some point. I purchased the Christmas Wine Passport to help me with this in December, and Spicewood was one of the vineyards I passed through. The experience was good. The facilities were beautiful, and it was a peaceful place to chill and relax. I got there shortly after opening, and there was only one other couple there, so I was able to get my tastings quickly and easily. The wines were good, especially their dry sparkling, but I was not moved to come home with anything. The selection I was offered was more heavy on bolder reds, and as a matter of preference I would rather have a good mixutre of reds and whites. Nevertheless, this wouldn't be a place I'd cross off my list. Their tempranillos were quite tasty, and I did like their dry sparkling wine."
            },
            {
                "author": "Joshua H.",
                "datePublished": "2021-08-17",
                "reviewRating": "5",
                "description": "GF and I both came in at 1pm on a Saturday afternoon via a prior RSVP to meet Ron Yates himself and do a full tasting experience with him as our server. This experience was amazing!  The indoor tasting room is large and open, welcoming and chill. Adorned with many award-winning wines of theirs that number beyond what I could count.   We got front-of-house seats together and begin our tasting journey through several whites and reds and sparkling wines. After what had to be 10-12 wines, we honed our picks down to the 'cabernet claret' for my GF and the 'tandem' red for me. However, not one of the wines we tried did we both truly feel we hated or disliked. Normally 1-2 are an easy pass but frankly, every wine we had was very good. My GF prefers sweeter wines across the board so the fact that nearly every wine she had still pleased her was saying something.  Ron was a top-notch host and server for us. His passion and love for wine is all but very clear in his conviction to his craft, knowledge of wine science and methodology, history of the business origins, name creations and labels to the wine bottles... all of it is an adventure with him as the animated storyteller of his wines and how the grapy goodness in the bottle got there and what you can expect to experience when it hits your lips.  I have to mention that they host an annual chili cook-off event every last Saturday of Feb with live music, 15+ chili contenders, and wine tasting all day long. It's their most successful event to date each year. When he spoke of that I made plans to be there for that for sure!  Ron and the team have a solid handle on this wine thing that is for darn sure! We only barely looked over the vineyard grounds so next time we come back, its gonna be charcuterie board, wine and time out in the vines for sure!"
            },
            {
                "author": "Jeff S.",
                "datePublished": "2021-06-21",
                "reviewRating": "5",
                "description": "Upon arrival at this gem a couple years ago, we had our doubts. The few Texas wines we had tried were subpar in our view. Spicewood's offerings opened a whole new chapter in our wine lifestyle upon completing that first visit.  When we first entered their tasting room, we noticed a plethora of wine award medallions on display. Being a volunteer on the Houston Rodeo, I was especially pleased to see many Rodeo Houston awards. But that wasn't all - Spicewood has awards from wine contests all around the country! Hmmmmm...  As we proceeded through our tasting, we were immediately impressed. Texas wine? This good? Yes, indeed! So good, in fact, that I joined their wine club without hesitation and remain a member to this day.   We visited again yesterday and enjoyed complimentary tastings of six nice wines and picked up our wine club orders from the past couple of quarters. We sat on their patio overlooking the vineyard and remarked how we are so happy to have found this spot. Oh, and the people working here are gracious and genuinely friendly.  Spicewood is a tad off the beaten path, but definitely worth the trek."
            },
            {
                "author": "Mop P.",
                "datePublished": "2021-09-05",
                "reviewRating": "5",
                "description": "Out of the way a bit but worth it. Staff treats each guest like their experience is important. We came out on a Sunday morning got a couple of tables for our family and did the $15 tasting--6 pours but all around 14% Alcohol. Most are only sold on site from what I heard.  Great for families. Nice slow pace; bring whatever food you want they welcome it."
            },
            {
                "author": "Tiffany C.",
                "datePublished": "2020-12-31",
                "reviewRating": "2",
                "description": "I've visited many Texas Hill Country vineyards and this place was just okay. Sure, the tasting is cheap but the wine was nothing to leave me desiring more. Atmosphere and scenery itself was also nothing to boast about. Sorry, not for me. Pass."
            },
            {
                "author": "A E.",
                "datePublished": "2020-08-30",
                "reviewRating": "5",
                "description": "As long time Spicewood Vineyard members we always enjoy our trips to the vineyard On this visit we brought our two sons and his family for a picnic at the vineyard. Of course things were a little different with Covid going on but everything was spaced out and carefully planned out for everyone's safety. When we arrived Ron was in the porch helping the guests with their wine selections. He is always very nice and makes everyone feel at home. It's always nice when the owner with everything he has to do remembers your names. After our picnic we got to sit in the Wine Cellar which was awesome. Highly recommend visiting, enjoying the scenery and trying out all the great tasting wines.   Hats off to Ron and Crew!   Adrian and Cyndi"
            },
            {
                "author": "Jim F.",
                "datePublished": "2021-09-26",
                "reviewRating": "5",
                "description": "This premier Texas Vineyard has been around for 20 years now. Their customer service is excellent and their wines are some of the best in Texas."
            },
            {
                "author": "Michae A.",
                "datePublished": "2019-09-01",
                "reviewRating": "2",
                "description": "This review is based on their $15 tasting menu which is a great deal for 7 wines.   We love wine and enjoy going to new areas to try tastings so was really excited to try this place based on their reviews but my husband and I were sadly disappointed.   I will say however that they do have an option for an estate tasting that goes for $30 which could be amazing but we decided to pass on it."
            },
            {
                "author": "Layle M.",
                "datePublished": "2020-09-20",
                "reviewRating": "1",
                "description": "Hmm...it has taken me over a week because I hate to say something bad about someone's business. Last Monday we stopped here after a fantastic visit to Marble Falls. We felt...tolerated...at best. We were met by 3 huge dogs who barked incessantly upon our arrival and throughout the visit. When the host finally came out he didn't offer up options for the tastings like we've experienced at other wineries. I'm pretty clear on what I like and had some ideas of wines I'd like to try with the intent of buying enough bottles to make a case of assorted bottles upon departing. The owner, who has great reviews on Yelp, either wasn't there or was busy. We didn't see this person. But we pushed through the tasting, cut it a bit short, and left much, much sooner than we'd ever imagined we would. My intuition upon arrival was to just leave. We should have done that.  This is our experience. And it just wasn't pleasant. We were the only guests yet felt we were in the way.  Hopefully, for others, their visits will be more aligned with this place's other more positive reviews."
            },
            {
                "author": "Mindy H.",
                "datePublished": "2018-01-15",
                "reviewRating": "4",
                "description": "I was pleasantly surprised by Spicewood Vineyards.  Spicewood was originally founded by the Manigolds.  Their vision was to make wine only from estate grown grapes. They were smart when they planted their vineyard.  They analyzed the soil and only planted grape varieties that would thrive in their soil.  Nine of the original 17 acres planted by the Manigolds are still producing fruit. For Texas that means something. That means wine sourced from grapes growing on vines that are now 24 plus years old.  Ron Yates took over from the Manigolds and is now the owner of Spicewood, and with wine maker Todd Crowell is making some good Texas sourced wines.  They now have thirty two acres planted on site, and partner with other Texas grape growers.    I like that the tasting room is a bit off the common path. That means it is away from the hustle and bustle of other Hill Country wineries.  The tasting room is spacious.  It has a homey lodge like feeling that is very inviting. They also have a beautiful tree shaded outdoor space.    The staff here are like family. They are knowledgeable and friendly.  I tasted through a selection of their vast options available. I found them to be well balanced.  Surprisingly I liked their Sauvignon blanc along with other of their wines."
            },
            {
                "author": "Anthony M.",
                "datePublished": "2020-05-12",
                "reviewRating": "5",
                "description": "We love this place. Wine and service is always good. Pretty awesome place to hang out for an afternoon. They have live music sometimes also"
            },
            {
                "author": "Lance M.",
                "datePublished": "2019-05-26",
                "reviewRating": "1",
                "description": "My experience was a 4-5 like many of those you will see here. However, our lovely day was ruined when one of the resident dogs or a customer's dog charged us aggressively while I was walking with my 10 month old baby in my arms. I cannot be sure if it was a resident dog or a guest's dog, but it was one of the gray colored Blue Lacey's).  Regardless, the dog was unprovoked by us. I had to hand my baby to my wife while I tried to protect them from this aggressive dog, hair bristled up and darting in at me aggressively as if to bite. Luckily it didn't bite us. The dogs owner chastised me for reacting strongly in defense of my wife and baby, which really frustrated me. We immediately left and I will not be returning. I wanted to post this in case a child is attacked by a dog on their premises in the future. It is documented and the owners have been informed that their aggressive dog or lack of leash laws are creating a liability and awful experience."
            },
            {
                "author": "Michael B.",
                "datePublished": "2016-05-12",
                "reviewRating": "5",
                "description": "I'm badly remiss in not posting a positive review for almost a year; what's more this is one of my personal favorite wineries in Texas Hill Country.  It's time I corrected this.   Spicewood has one of my personal favorite tasting rooms; while on the inside it's nothing special, the outside grounds and seating mimic an upscale, modern country house that I could see myself living in (*cough cough* once I win the lottery *cough cough*).  There's also a cool little stream they have running through the place so you can hear the sound of running or falling water when you sit to have a sip.  Nice touch.  Spicewood's won a bunch of awards for various wines but the two standouts IMO are their 2013 Syrah and their Riesling, which has a fruity taste and a magnificent green-apple crisp bouquet.  Note: As of May 2016, their site does not show the Riesling for sale, so I'd call ahead if you want to taste it.  As an added bonus, it's only 10 minutes away from It's All Good and Opie's, both of whom have some of my favorite BBQ outside the Austin area."
            },
            {
                "author": "Sherry W.",
                "datePublished": "2018-04-21",
                "reviewRating": "5",
                "description": "This is better wine and value compared to Stone house winery.  It is $10 for seven tastings and only one wine was not from Texas. They have indoor and outdoor seating. There is no view at this vineyard. Staff is friendly. There was a friendly house dog wandering around.  They have t shirts for sale."
            },
            {
                "author": "Jenn M.",
                "datePublished": "2020-05-30",
                "reviewRating": "1",
                "description": "I only put a one because it isn't there anymore. We drove 20 minutes to it and it was closed, I'm assuming. Darn."
            },
            {
                "author": "Angela P.",
                "datePublished": "2018-03-11",
                "reviewRating": "5",
                "description": "The Good Guy. Wow. It's an excellent red wine. It's smooth and tasty. It's not cheap. It's $42. I couldn't care less. I'll pay for wine as long as it's delicious and this one is fabulous. I like the patio outside. You can bring your dog and  kids if you'd like. The ambience inside and out is relaxing and fun. It's an excellent place to chill out with loved ones. I'll be back."
            },
            {
                "author": "Scott G.",
                "datePublished": "2019-10-03",
                "reviewRating": "5",
                "description": "This vineyard has a broad range of varietals for producing their many wines.  Some are very surprising like their Tempranillo Rose, Mourvedra, Cab, and Pinot.   Since they seemed to blend grapes from outside of Texas with estate, gives their wines a different character than most I've tasted from Calif and Washington for the same grape varietal.    For non-wine items to consider, the staff is super friendly and knowledgeable, dog friendly, indoor and outdoor seating with a nice babbling brook adjacent.   They do have an event facility and would make a nice venue for any type of occasion.  They have a hearty cheese plate that won't disappoint.  I would not use the spicy cheese however."
            }
        ]
    },
    {
        "name": "Flat Creek Enoteca",
        "id": 9,
        "open_for_business": 1,
        "tags": [
            "Wineries",
            "Italian"
        ],
        "website": "http://www.flatcreekenoteca.com",
        "longitude": -98.276502,
        "latitude": 30.569471,
        "address": "112 US Hwy 281",
        "postal_code": "78654",
        "city": "Marble Falls",
        "state": "TX",
        "telephone": "(830) 637-7123",
        "price": "$11-30",
        "hours": {
            "Mon": "Closed",
            "Tue": "2:00 PM - 9:00 PM",
            "Wed": "2:00 PM - 9:00 PM",
            "Thu": "2:00 PM - 9:00 PM",
            "Fri": "2:00 PM - 9:00 PM",
            "Sat": "2:00 PM - 9:00 PM",
            "Sun": "Closed"
        },
        "accommodations": [
            "Takes Reservations",
            "Offers Delivery",
            "Offers Takeout",
            "Masks required",
            "Accepts Credit Cards",
            "Outdoor Seating",
            "Casual, Classy",
            "Moderate Noise",
            "Casual Dress",
            "Good for Groups",
            "Good for Dinner",
            "Private Lot Parking",
            "Waiter Service",
            "Beer & Wine Only",
            "Wheelchair Accessible",
            "TV"
        ],
        "unaccommodations": [
            "Accepts Android Pay",
            "Offers Catering",
            "Not Good For Kids",
            "No Bike Parking",
            "No Wi-Fi",
            "Dogs Not Allowed"
        ],
        "rating_value": "4",
        "review_count": "161",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/72NPHsGOe-V1kzRbAclfew/l.jpg",
        "reviews": [
            {
                "author": "Joan M.",
                "datePublished": "2022-02-05",
                "reviewRating": "5",
                "description": "Hidden gem for brick oven pizza Italian style. Quiet, great place for a girls luncheon."
            },
            {
                "author": "Danny G.",
                "datePublished": "2022-02-11",
                "reviewRating": "1",
                "description": "Horrible Loud Angry service! Too much employee hostility  Danny and Kathryn Glenn   Northlake, TX"
            },
            {
                "author": "Jacob T.",
                "datePublished": "2022-02-07",
                "reviewRating": "4",
                "description": "Our waitress was really outstanding, and the ambiance is very nice - great decor and a quiet atmosphere.  We ordered the ciabatta appetizer and it was really great, especially the vinegar they offered to dip it in.  It's just regular balsamic vinegar but however they make it, it's really great (they have bottles for sale you can take with you).  We also sampled a few of their wines and they were all excellent.  My wife and I split a caesar salad and the Enoteca pizza.  There was nothing particularly outstanding about the salad - it was exactly what you'd expect.  The pizza was a huge letdown.  It had lots of ingredients on it but still somehow didn't have a lot of flavors.  The crust was very thin and crunchy, which we loved, but overall we were very let down.  We took a bottle of the vinegar and an extra bottle of wine home with us, because they were so good, and we still spent under $100 on the whole meal.  I think we'll probably give this place another try in the future but we'll be avoiding the pizza."
            },
            {
                "author": "Michelle G.",
                "datePublished": "2022-03-13",
                "reviewRating": "5",
                "description": "When we made the reservation they warned us they were short staffed and there would be a wait.  Well they did a phenomenal job with their short staff!  Service and food were outstanding!  We all loved our dish and our waitress was very attentive!  I only had a chance to take a picture of my food which was the Chilean Sea-bass, highly recommend!"
            },
            {
                "author": "Brenda R.",
                "datePublished": "2022-01-26",
                "reviewRating": "5",
                "description": "We chose the Truffle Parmesan Avacado, it was delicious and the avocados..so fresh.  We had never had this or heard of it and it was delicious. We also had a very nice waiter...shout out to Noe so pleasant and always smiling."
            },
            {
                "author": "Amy M.",
                "datePublished": "2021-11-02",
                "reviewRating": "5",
                "description": "Love this place! Amazing food and wine and a lovely dog-friendly outdoor patio. The wood fired pizzas are delicious, especially the L'Enoteca."
            },
            {
                "author": "Angela P.",
                "datePublished": "2021-06-12",
                "reviewRating": "1",
                "description": "The food was anything but good .... We left there feeling like they don't care because they don't count on you returning.  So we won't. The flat bread had no rise to it but it was covered with so much cornmeal. The pizza was the same dough was  too much cheese along we other Japanese mushroom. The cheese is not fresh mozzarella... And canned olives.   No drinks one pizza one simple green salad  Plain flat bread to start one dessert 50.00. Oh by the way bring cash they don't allow to tip on the card..."
            },
            {
                "author": "Joanie A.",
                "datePublished": "2021-06-17",
                "reviewRating": "5",
                "description": "WONDERFUL! The most sophisticated food in Marble Falls! Our service was impeccable- a very nice waitress who was attentive throughout the meal from the beginning to the end. Avocado wrapped with cheese was great, as well as as a shrimp lemon pasta dish. Everything except the bacon wrapped dates. I think the bacon wrapped dates would have been enjoyed if we expected date paste, rather than whole stuffed dates as we are accustom to being served as an appetizer.   Our wine was $49 a bottle.  Unfortunately, it had much too much sentiment and was not the best wine.  I am not familiar with the pricing of Texas wines, but basically for fine restaurant, it was not as nice as the decor, service or food. Yes we plan on going back!"
            },
            {
                "author": "Ms C.",
                "datePublished": "2021-10-16",
                "reviewRating": "5",
                "description": "We've had a lakehouse in Marble Falls for over 35 years. I'm not sure how long Flat Creek has been here, but it is by far my favorite restaurant. The wines have begun to sing...they are really coming into their own. The Syrah is one of my favorites. The menu changes frequently and I like that. I'm usually tempted by one of the entrees, but I typically end up with one of the pizzas. They are always delicious. Piping hot out of the pizza oven with a crispy crust. My boyfriend had the sea bass and he said it was delicious. We had another great night and look forward to our next visit."
            },
            {
                "author": "Ben L.",
                "datePublished": "2021-04-11",
                "reviewRating": "5",
                "description": "We visited the Enoteca (what?) not really knowing what we were in for, and we are glad we did.  The wood-fired margarita pizza was fresh and delicious, accompanied by a baked Brie with fruit and marmalade which was fantastic.  But the real surprise was the Flat Creek Cabernet Sauvignon, a Texas wine that really delivers.  Final word?  We came back the next night for the filet mignonette and salmon.  My wife loved the salmon and the filet was cooked to perfection, one of the best, most tender I've ever enjoyed.  Noah did a great job taking care of us and the proprietor, Rick, was a pleasure to meet and chat with.  Highly recommend!"
            },
            {
                "author": "John W.",
                "datePublished": "2021-11-06",
                "reviewRating": "5",
                "description": "Great pizza and house salad. Pizza crust was light and flaky. Toppings were fresh and service was fast. Lovely atmosphere and spacious. House salad was fresh with house made dressing. Nothing out of the bottle.  Our favorite place for date night."
            },
            {
                "author": "Natasha M.",
                "datePublished": "2021-11-04",
                "reviewRating": "5",
                "description": "All the food was yummy and the service was great. Wish it were a sunny day - would have taken our pup on the patio."
            },
            {
                "author": "Everett T.",
                "datePublished": "2020-03-02",
                "reviewRating": "4",
                "description": "Hey, you know how the line at Bluebonnet Cafe sucks? Walk 20 feet over to this hidden gem instead!  Flat Creek is a strangely fascinating find. The exterior looks like a 1970's strip mall. The parking lot is cracked and disjointed, with room for perhaps 10 cars. To call it unassuming would be an understatement. Hell, even the website bills it as \"an urban wine bar.\"  And yet, the food here is incredible. Flat Creek is actually an extension of their winery, located North of Lake Travis, just off 1431. Is the wine good? Hell if I know. It looks fancy. They have a private tasting room and a really high tech looking chiller thing. What I can say, definitively, is that they're serious about both their wine and their food.   We started with the blue fig flatbread, which was well balanced and fairly large for an appetizer. So much so, that between a party of three, we couldn't finish it off.  For the table, we then ordered crab cakes, the sausage and mushroom pizza, and an avocado truffle salad. The pizza was the clear winner here, crispy crust, not-too-salty toppings, and a strangely addictive sauce. My wife gave the crab cakes a big \"meh\" and proceeded to help herself to more pizza. The avocado salad was really fresh avocado slices wrapped in crispy Parmesan cheese. Delicious, but very, very rich, and the side salad was necessary just to balance the dish. We finished the meal with a lovely light pear dessert.  Downsides? The service was friendly, but glacial. When we entered we were 1 of 2 tables in the entire place, and when we left we were 1 of 2 tables in the entire place. In between there were quite a few \"haha, okay, but really, where is our server?\" moments. If you don't favor wine, you're not going to find much else to imbibe. I get it, it's a wine bar, just be forewarned.   Seriously though, next time you're stuck in line at Bluebonnet, send a wayward glance across the street to Flat Creek Enoteca, you'll be pleasantly surprised."
            },
            {
                "author": "Penny M.",
                "datePublished": "2021-11-27",
                "reviewRating": "4",
                "description": "The L 'Enoteca pizza was delicious!  Glad we went with our waiter's recommendation.  Caprese Salad was good too."
            },
            {
                "author": "Lindsay T.",
                "datePublished": "2021-02-10",
                "reviewRating": "5",
                "description": "Visiting the area and hadn't been overly impressed w the restaurants in the area. Found Flat Creek Enoteca and really enjoyed it! The filet and pasta were great and so was the service! Also we enjoyed the Reserve Super Texan wine which is local to the area. I'd def recommend!"
            },
            {
                "author": "Hailey D.",
                "datePublished": "2019-08-29",
                "reviewRating": "1",
                "description": "Wow. This was incredibly disappointing. This is supposed to be a tasting room and restaurant for the Flat Creek Winery. We went there to - hopefully - do a tasting, buy a few bottles of wine to take back with us, and have dinner.  This is kind of one of our things ... we enjoy visiting vineyards or sampling rooms and tasting and buying nice wines.  To start out, the parking out front isn't the greatest. For some reason several people had parked over the lines taking up two spots, which made it even more difficult to park.   We ordered a flight of reds. The Super Texan was flat. We thought that the bottle they served us from had been open and sitting around for too long. It was definitely showing signs oxidation as colour was shifting to brownish from red. (Why did a tasting room serve a flat glass of wine?)   The next wine in the flight was Montepulciano.  Eh. It tasted slightly flat and had a funky smell - sort of wet dogish.   The final glass was Barbera. Actually this was crisp and tasted good, so we ordered a full glass to enjoy.  We ordered a gluten-free cheese board with our flights. Warning: if you are gluten-free, dine here at your own peril. (We believe if you offer gluten-free, know what is and how to do it.)  The kitchen is open to the tasting room and dining room. We saw the male chef remove wheat-based crackers off our cheese board and put supposedly gluten-free flatbread triangles onto that same plate and send it out to us. When we pointed out that the entire board was now contaminated and we couldn't eat this due to cross-contamination, he seemed perturbed with us.  They offered to remake the cheese board. It took forever. We had finished our flights and had ordered a glass of the Barbera. The male chef (?) put the \"new\" order of flat bread into the pizza oven with the wheat-based items. (Thank goodness my spouse was watching and caught this.) He seemed to not understand that you cannot put gluten-free items in the same oven with wheat based items. IDK why, but it was a fiasco. ‍  The young boy that sat us was very shy and seemed not to understand us; we originally asked for a table, but he asked if we had reservations. No. Did we need reservations? No. (There were empty tables and this week is apparently slow for the resorts and restaurants.) Well, we'd like to have dinner. (Looking at empty dinner tables.) Can we have a table in the dining area? Do you want to sit at the high-top or a regular table? We'd prefer a regular table. Do you want to sit at a high-top or a regular table? The third time we answered that we guessed we'll sit at the high top. And that's where we were seated. Mhmmm   Our server, Anna, was good. She was trying to get the cheese board delivered properly; she knew enough to suggest that the Superbly Italian flight wines would be less dry than the Fireside Reds flight.  Our impression was that the staff here are not pros trained and experienced in hospitality. Disappointing. We decided that the getting seated and the corked and flat wine combined with the cheese board \"not gluten-free\" experience was enough and left to find a better dining experience elsewhere.   For my spouse and I the bill came to $72.  We each had one flight of 3 wines, shared a cheese board, and had a single glass of the Barbera each.  Pricing is typical for this combination of items at a dating rooms, but the wines were not. Disappointing."
            },
            {
                "author": "Kelsey K.",
                "datePublished": "2021-05-20",
                "reviewRating": "5",
                "description": "Looked for a nice Italian wine place in Marble Falls. This place did not disappoint! The wine was great but the food was wonderful. Came out fast and so hot that it took a minute to eat. Very good, very fresh."
            },
            {
                "author": "Doug G.",
                "datePublished": "2019-08-25",
                "reviewRating": "4",
                "description": "Very good dinner. We had a bottle of Syrah from Flat Creek.  We decided to mix it up and so ordered two different flat breads, one cheesy and one creek.  We also had the lemon cauliflower and Brussels sprouts.  My wife ordered a terimisu to go.  Wine and food were both good."
            },
            {
                "author": "Julie A.",
                "datePublished": "2021-06-13",
                "reviewRating": "5",
                "description": "Excellent wines and very good food.  Really enjoyed the wood-grilled salmon. We'll be back!"
            },
            {
                "author": "Matt C.",
                "datePublished": "2021-09-02",
                "reviewRating": "3",
                "description": "Not sure what happened when we went, took my wife here for her birthday thinking wine and dinner at a local place. I think perhaps they are struggling with employees, as everyone is, so extra stars for that. For us the pizza was a 2 a s filet mignon was a 3. I think there were maybe 10 to 15 people seated and it was stressful."
            }
        ]
    },
    {
        "name": "Iron Wolf Ranch and Distillery",
        "id": 73,
        "open_for_business": 1,
        "tags": [
            "Distilleries"
        ],
        "website": "http://ironwolfranch.com",
        "longitude": -98.169038,
        "latitude": 30.453874,
        "address": "101 County Rd 409",
        "postal_code": "78669",
        "city": "Spicewood",
        "state": "TX",
        "telephone": "(512) 970-3203",
        "price": "Moderate",
        "hours": {
            "Mon": "Closed",
            "Tue": "Closed",
            "Wed": "Closed",
            "Thu": "Closed",
            "Fri": "4:00 PM - 7:00 PM",
            "Sat": "12:00 PM - 8:00 PM",
            "Sun": "12:00 PM - 6:00 PM"
        },
        "accommodations": [
            "Offers Takeout",
            "Accepts Credit Cards",
            "Offers Catering",
            "Good For Kids",
            "Private Lot Parking",
            "Bike Parking",
            "Wheelchair Accessible",
            "Gender-neutral restrooms",
            "Heated outdoor seating",
            "Covered outdoor seating"
        ],
        "unaccommodations": [
            "No Delivery",
            "Accepts Apple Pay"
        ],
        "rating_value": "4.5",
        "review_count": "58",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/6VpHBhTodrA4W3w7yQJFFw/l.jpg",
        "reviews": [
            {
                "author": "Ruthie W.",
                "datePublished": "2021-07-25",
                "reviewRating": "5",
                "description": "Yesterday, I decided to do a day trip to Spicewood today. It was first to Krause Springs then found out Iron Wolf would be open lunch time. After a refreshing morning at Krause Springs, we headed to Iron Wolf Ranch and Distillery for lunch and drinks.   They have a wide variety of spirits with several award winning ones. Tiann was great in making our drinks! I had the New Fashion made with Hotscotch (a little sweet and spicy). My husband had the Luna-tic made with vodka and several fruit juices. We enjoyed the drinks while we waited for our lunch from Craigo's. We ordered the specialty pizza (sausage, pepperoni, green peppers, mushrooms and onions) and barbecue wings. Truly phenomenal pizza and wings! We also had the Giddy Up Mary with horseradish-infused vodka and Wild and Tea, an Arnold Palmer with bourbon.   We'll have to come back another time for the tasting and meet Luna, a wolf adopted by the family (she's usually there on Fridays). Most Saturdays they have live music. Definitely check their calendar online."
            },
            {
                "author": "Monica Q.",
                "datePublished": "2022-04-02",
                "reviewRating": "4",
                "description": "We just did a tasting and I was not expecting that . It was so yummy. Very friendly people. Nice at home atmosphere. We really enjoyed the group tasting. It was fun hanging with everyone and hear what people like and have trouble drinking . We had vodka, gen, bourbon, scotch, etc. and we ended up leaving with a bottle of Hot iron. Can't wait to get home and have a glass of this in ice."
            },
            {
                "author": "Michaela P.",
                "datePublished": "2021-05-10",
                "reviewRating": "4",
                "description": "Made the trek for a friend's Bday get together. A little off the beaten path but worth the drive.   Beautiful venue. Plenty of seating under the oaks. Playground. Disc golf. Cornhole. Food truck (Craig O's). We had a great time.   Specialty cocktails are a little off (and a little weak). Order your preferred cocktail and you'll be fine.   Didn't do the tour or tasting. Maybe next time."
            },
            {
                "author": "Rosalind C.",
                "datePublished": "2021-02-28",
                "reviewRating": "4",
                "description": "I mean what's really hard? It's liquor and a open space. That's all you really need to have a perfect distillery. The service was great and the staff were nice. I would recommend the bourbon and the gin because they were both smooth and delicious. This is definitely a chill and relaxing place to visit"
            },
            {
                "author": "Amy G.",
                "datePublished": "2021-05-30",
                "reviewRating": "3",
                "description": "This place is not set up to be a serious event venue. They have ONE indoor bathroom and a lousy pizza truck. They might be an ok distillery, but I don't know, that's not what I was there for."
            },
            {
                "author": "Stephanie M.",
                "datePublished": "2021-05-23",
                "reviewRating": "5",
                "description": "I almost don't wana leave such a positive review because then more and more people will find out about this AMAZING spot and I want it all for myself!! Hahaha kidding but really this place was awesome, even though it was a day with drizzle still enjoyed it! First off the staff is beyond sweet, so warm and welcoming! The drinks were great and good price! Such a fun vibe with good music. Very mellow way to spend a Sunday afternoon. So happy they had a kids area because both my 8 year old and 2 year old had a blast and stayed busy so I could enjoy a delicious Bloody Mary. They have awesome lawn games to keep busy and a delicious pizza food truck parked on site. We will for sure be back!! Do yourself a favor and pay it a visit it was a lot better than most of the distilleries I've visited."
            },
            {
                "author": "Ken G.",
                "datePublished": "2020-11-22",
                "reviewRating": "5",
                "description": "Stopped by here with some local friends, and it definitely was the best spot we went to of the whole night. The bourbon was awesome!!! They had a little fair going on, and that made the whole experience even better. Live music as well! If they had rooms we would have stayed. Haha. Definitely recommend stopping by this spot. You won't be disappointed."
            },
            {
                "author": "Sepid M.",
                "datePublished": "2021-05-29",
                "reviewRating": "5",
                "description": "We got stock there during a storm and they were the best! People are so nice and the drinks are awesome!"
            },
            {
                "author": "Jennifer D.",
                "datePublished": "2019-12-05",
                "reviewRating": "5",
                "description": "Great distillery! I'm actually not typically a whiskey fan but I like theirs! Love both the Hotscotch and Iron Hot.  Plentiful parking. Big outdoor deck seating. Live music stage. Food truck on site. Awesome Hill Country views.  Family-friendly events. Highly recommend Iron Wolf!"
            },
            {
                "author": "Rick B.",
                "datePublished": "2018-07-29",
                "reviewRating": "5",
                "description": "This is the fanciest metal building distillery I have ever seen!  Very shiny stainless steel still, immaculate polished concrete floors, easily the fanciest metL building I have seen!    And they have good liquor!  The tasting is informative and interesting, even if all of the idetails on the fancy bottles is a bit overwhelming.  But the real wolf is interesting.   Try it al!!  The Giddy'Up (horseradish) vodka is better than it sounds - and it makes a fantastic Bloody Mary!  Several things were good, but you must BUY this - it is excellent!"
            },
            {
                "author": "N S.",
                "datePublished": "2021-08-15",
                "reviewRating": "3",
                "description": "We were excited to go here. That quickly faded. There is almost no shade. I'm sorry but this is Texas. It's hot. You need to put in adequate shade. It has one indoor bathroom and one little pizza truck -which the pizza was Okay- the kids play area is huge tires with again NO shade. Please don't even say you have a play area when the only thing they could climb on are tires that would give them second degree burns. The solo artist singing was probably the only good thing as we also got 3 different drinks and didn't even finish half of it because it was gross."
            },
            {
                "author": "Christina D.",
                "datePublished": "2021-01-25",
                "reviewRating": "5",
                "description": "We stopped by here as one of our stops during a brewery/wine tour. It became our last stop, the owners were super friendly and attentive to us the whole time. We started out with a tasting and even though the weather was not in our favor we still enjoyed our time around the fire enjoying their great drink options. It's a pet friendly family atmosphere and we will definitely be returning!"
            },
            {
                "author": "Molly F.",
                "datePublished": "2021-04-02",
                "reviewRating": "5",
                "description": "I have visited Iron Wolf many times and never had a bad experience! Staff is very friendly and hospitable. Great environment and drinks! Must try the Hotscotch liquor!"
            },
            {
                "author": "Alyse H.",
                "datePublished": "2018-08-26",
                "reviewRating": "5",
                "description": "We stumbled upon this sprawling alcohol paradise on our drive back to Austin from San Angelo.  We originally stopped because the BBQ food truck they have on the premises is rated very high, but the liquor turned out to be the real star. Hubby partook in a liquor tasting that cost $10 for multiple samples.  They have some very unique flavors that I've never heard of anyone incorporating in a liquor before.  I ordered a bourbon and lemonade drink that hit the spot in the Texas heat.  This was a Mecca for bachelorette parties and large groups of friends.  There is plenty of room on the property to spread out and enjoy the weather.  They also host concerts on their stage next to the tasting room.  They are planning to expand their offerings here, so stay tuned as to what they build!"
            },
            {
                "author": "Laura V.",
                "datePublished": "2019-10-26",
                "reviewRating": "5",
                "description": "This is by far my favorite place to visit in the Hill Country. It is a party place. Large group specialty. Large area. Room to spread. Dog friendly. Great patios and food trucks. We had the Ginirita and Cucumber Cooler. We Tasted the butterscotch Vodka and bourbon and the rum. Everything was superb. My Fav Place."
            },
            {
                "author": "Brian A.",
                "datePublished": "2019-09-08",
                "reviewRating": "5",
                "description": "Amazing place and people, family friendly even your Pup can come out and enjoy!  Recommend this place!"
            },
            {
                "author": "Missy L.",
                "datePublished": "2020-09-19",
                "reviewRating": "5",
                "description": "This is an amazing venue!  The family is so kind and attentive to all of their patrons.  We have been coming here since they've opened, and enjoy every single minute!  It's a must try!!"
            },
            {
                "author": "Prince H.",
                "datePublished": "2018-04-22",
                "reviewRating": "5",
                "description": "I'm rounding up to 5 stars because it is a family run business working hard to make a go of it. Small but nice distillery has tours and tastings with a large outdoor area for hanging out and a stage for occasional music acts. I didn't play but the frisbee golf looked great.  Rum, gin, fireball, and few other mixed spirits to sample.  I personally liked and purchased the gin. Low juniper the way I like it.  Odd wild eye logo is off putting but very friendly staff."
            },
            {
                "author": "Jani C.",
                "datePublished": "2018-09-25",
                "reviewRating": "5",
                "description": "Great place - live music   Nice outdoor area with games and food trucks. The owners are very nice . Be sure and do the tasting so you can see how good the bourbon- vodka- gin - etc is"
            },
            {
                "author": "Mindy H.",
                "datePublished": "2018-01-15",
                "reviewRating": "5",
                "description": "Iron Wolf Ranch and Distillery is a welcome new addition to the ever quickly expanding distillery scene in the Texas Hill Country.  The owners are a wonderful husband and wife team that we had the pleasure to chat with for awhile during our visit.  We visited soon after their opened, and I have been trying to find a chance to get back ever since.  When you drive up to the tasting room and production site you immediately know this is a special spot.  Their 15 acre property has been planned and well thought out.  The current building, known as the \"Still House\", is just one of several future buildings that they have envisioned to have onsite.  The \"Still House\" provides space for onsite production and a tasting room. They also have expansive space surrounding the building for the whole family to come out and enjoy.  They have huge oaks shading the property.  Elevated decks with cozy seating and beautiful 360 views. A fire pit, bocci ball green, human size beer pong, washers, horse shoes, and a 9 disc golf course.  Did I also mention the amazing sand box for the kids!  You could easily pack a picnic and make a day of it here.    For a nominal fee you can taste a selection of their spirits, or just purchase a crafted cocktail.  Their spirit options are Gin, Rum, Vodka, and Horseradish infused Vodka.  They also have two flavored Whiskeys - Iron Hot, which is a Whiskey with all natural cinnamon and sweeteners blended with Texas peppers. I saved the best for last. Their Hotscotch, which is Whiskey blended with natural butterscotch flavors and Texas Peppers.  It is sweet meets spicy.  All the spirits were well done. But Hotscotch was my favorite. Something unique.  I have enjoyed it in my apple cider!    A fantastic space, with great drinks, and awesome people. It doesn't get much better than this.  It will be great too see how this place grows and expands in the future."
            }
        ]
    },
    {
        "name": "Heart of Texas Wine Tours",
        "id": 154,
        "open_for_business": 1,
        "tags": [
            "Wine Tours"
        ],
        "website": "https://heartoftexaswinetours.com",
        "longitude": -98.104477,
        "latitude": 30.546296,
        "address": "",
        "postal_code": "78654",
        "city": "Marble Falls",
        "state": "TX",
        "telephone": "(512) 755-0937",
        "price": "",
        "hours": {
            "Mon": "9:00 AM - 5:00 PM",
            "Tue": "9:00 AM - 5:00 PM",
            "Wed": "9:00 AM - 5:00 PM",
            "Thu": "9:00 AM - 5:00 PM",
            "Fri": "9:00 AM - 5:00 PM",
            "Sat": "9:00 AM - 5:00 PM",
            "Sun": "9:00 AM - 5:00 PM"
        },
        "accommodations": [],
        "unaccommodations": [],
        "rating_value": "4",
        "review_count": "32",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/SHnBzF4GYBcsosm00ivUSw/l.jpg",
        "reviews": [
            {
                "author": "Debbi R.",
                "datePublished": "2017-09-12",
                "reviewRating": "5",
                "description": "A Full and Wonderful Day   Our tour with Dale was fabulous. I wasn't sure what to expect, but it didn't take long to realize that not only is Dale a great tour guide, he's also a very personable and knowledgable man who makes you feel like an old friend.   The points of interest were superb and the last stop we made provided one of the best meals I've had in my life and most likely the best ribeye ever.   The day lasted longer than expected, but it was a wonderful day and ended up being just perfect. We are planning to use his rental venue for a retreat in the coming months and looking forward to it. I highly recommend his services."
            },
            {
                "author": "Jaylan B.",
                "datePublished": "2020-06-07",
                "reviewRating": "1",
                "description": "First I would like to start with the facts.  1. We booked this tour months ago but unfortunately had to reschedule to a later date. (due to Covid19) This was not an issue for anyone attending the tour and the company got all $2800 paid for in full. 2. Yes $2800. We had 28 people in our group, It required two buses that were at their max capacity.  3. I would give a HUGE ZERO if I could.   The buses arrived at the pick up location 25 minutes early and expected us (all 28) to load up. Not all 28 people were even there yet. The male driver already seemed annoyed at this point.  We ended up pulling out at the agreed on time. When trying to leave the 2nd winery we couldn't. The drivers HAD LEFT and weren't there to pick us up. We waited outside in the sun outside for 30 minutes before they even got back.  But that unfortunately is not why I am writing this review   As we were loading the bus to go home the male driver said that would be charging us for a cleaning fee ($300) because someone spilt something on the floorboard. Pretty steep for a small spill that could be wiped up with a Clorox wipe but she agreed to pay it she sat down. Comments started to be exchanged about the steep fee and how the day had been complete chaos up until this point. The man began to get pretty heated and slammed the door. When he opened the door to his seat he said \"who the f**k spilt something in my seat.\" Nobody had spilled something on his seat. Upon looking at the \"spill\" it appeared to be sweat from Him. He continued to cuss and yell and eventually told us to \"get off his bus.\" We all piled off and the other bus also unloaded.  Now it is important to note the other driver said we didn't do anything wrong and that she didn't agree with how he was handling things. He told her he was in charge and that he would make the call. She became quiet after that. They ultimately left us there to find our own rides.  The male driver was rude and didn't speak unless spoken to the entire day. A beautiful day with amazing company was RUINED by this company and I will not recommend them to anyone!"
            },
            {
                "author": "Stacy L.",
                "datePublished": "2021-09-15",
                "reviewRating": "1",
                "description": "I booked a birthday trip for 6 people, hoping to add 2 more. Dale told me I could book the trip for 6 and then add the 2. When I called to add the 2 he told me he would have to see if that was even possible. I didn't understand why after he assured me it would be fine and a sprinter van hold more than that. He had given the sprinter van to a larger crowd and downgraded us to an SUV without asking me (same price). I asked him when I would hear back and he said whenever he located another vehicle. I made some calls and found a better business who really wanted to host me and our guests. I called again to cancel with Dale and was told I am not the type of customer he would want. I guess a customer who wants to pay more money to add more people isn't good... very strange. Talking to a woman like that is not ok. I hope that he was having a bad few days and that he doesn't always behave like this, but I was really shocked how rude and unprofessional he was. Pros: I got my money back."
            },
            {
                "author": "Blair B.",
                "datePublished": "2020-06-08",
                "reviewRating": "1",
                "description": "The owner/driver we had was terribly rude and very unprofessional. He only spoke when spoken to and when he did talk he seemed annoyed.  Do not waste your money on this company! I've had Uber drivers converse more than this \"tour guide.\"  Worst experience ever by far!"
            },
            {
                "author": "Susan G.",
                "datePublished": "2019-01-21",
                "reviewRating": "5",
                "description": "Rick was AMAZING! He is the guide with the mostest - a gentleman with a servant's heart, excellent taste in wineries, and a plethora of knowledge about this  beautiful TX region. He is truly one-of-a-kind and I'm so glad we took this tour with him. Thanks, Rick - see you again soon!"
            },
            {
                "author": "Marcia H.",
                "datePublished": "2020-10-19",
                "reviewRating": "5",
                "description": "We were celebrating our wedding anniversary. The tour was nice. The driver was great! We visited some interesting wineries. Seeing the Texas wine country off the beaten path was well worth it. We would use this company again."
            },
            {
                "author": "Doug E.",
                "datePublished": "2020-10-10",
                "reviewRating": "5",
                "description": "We had a great time.  Well worth the money our driver Laura was great.  She was helpful and was happy to be there.  When I do this again I won't change anything.  I would use the same driver and tour service."
            },
            {
                "author": "Amanda G J.",
                "datePublished": "2020-06-08",
                "reviewRating": "1",
                "description": "One of the WORST experiences I have ever had with a \"wine tour\" company. I have been on many wine tours in my days, across different parts of Texas, and their unprofessionalism and lack of customer service and just blatant disrespect was appalling.   This \"wine tour\" had a total of two buses and a party consisting of 28 people. A group of people that I have known for years that have the utmost of respect and common courtesy for any company that they hire or work with.   From the start of our experience, both drivers were incredibly rude and unfriendly. The bus lacked any amenities one would think this \"Premier Hill Country Wine Tasting Experience\" would consist of.  The first winery.  * We arrived at the first winery at 10:48am to learn that the winery doesn't even open until 11:00am and that they WEREN'T expecting us at all... * Not the wineries fault. They were fantastic.  The second winery.  * Again, wasn't expecting us, causing us to have to sit at a tent down a road from the winery. Again, not the wineries fault, they handled it incredibly.  * When trying to leave the second winery, we couldn't. The drivers HAD LEFT and weren't there to pick us up. We waited outside in the sun outside for 30 minutes before they even got back.  The third winery.  * As we were loading the bus to go home, the male driver said that they would be charging us for a cleaning fee ($300) because someone spilled something on the floorboard. Pretty steep for a small spill that could be wiped up with a Clorox wipe, but she agreed to pay it. (*To clarify, open containers were allowed as stated on their website: \"Consumption of alcohol on the bus is allowed unless there are minors present.\") Minor spills like this are inevitable when providing a service as they do. Comments started to be exchanged about the steep fee and how the day had been complete chaos up until this point. The man began to get pretty heated and slammed the door. When he opened the door to his seat he said \"who the f**k spilt something in my seat.\" Nobody had spilled something on his seat. Upon looking at the \"spill\" it appeared to be sweat from him. He continued to cuss and yell and eventually told us to \"get off his bus.\" We all piled off, and the other bus also unloaded.  I know these times are hard, especially for small and locally owned businesses, and by no means and am I trying to make it harder for them; in fact, I am going above and beyond to support them. After yesterday, I do think that they need to take a step back and re-evaluate their actions and really think long and hard about what they do and why they do it. In the end, when providing a service, the client always comes first."
            },
            {
                "author": "Tiffany H.",
                "datePublished": "2019-11-12",
                "reviewRating": "5",
                "description": "This could not have been a better day! We highly recommend touring with Heart of Texas Wine Tours. We were so lucky to have found Dale Fortenberry. He is so knowledgeable about the area, the history and the vineyards. Dale went out of this way to accommodate the entire group of women with different tastes in wine. We all know that is not an easy feat, but he did it! Our next trip to the hill country will find us taking another exciting tour with Dale.  -Tiffany Raye"
            },
            {
                "author": "Christi C.",
                "datePublished": "2019-09-29",
                "reviewRating": "5",
                "description": "Absolutely best experience from beginning to end!   From ease of scheduling, picking us up on door step, and bringing us back, worry free.    Our driver Rick was great!  Shared info and answered all of our questions about the area.   He escorted us in to reserved tables at each location, pampered us all day!    Already planning our next trip with www.HeartOfTexasWineTours.com!  Thank you, Christi"
            },
            {
                "author": "Matthew V.",
                "datePublished": "2016-01-21",
                "reviewRating": "5",
                "description": "My girlfriend and I had a fantastic time on this tour. To be honest, the cost seemed a bit high at first but having never been on a wine tour before and I really had no idea. Afterward I realize it was worth every bit of it. Dale picked us up at our BnB along with everyone else on the tour that day and we were off to the first tasting.  He seem to know everyone along the tour and at each place they were very welcoming and grateful to have our group. It really was a fun time and we had the chance to try many different wines that we would not have normally picked.  Lucky for us it was a beautiful day and everything was just perfect. I would definitely recommend this tour to anyone interested in checking out some Texas wines, for a nice weekend getaway, or just to try something different.  It definitely helped that we had a good group of people who were also on the tour that day as well. It was a blast...I just wish we had taken more pictures."
            },
            {
                "author": "Amy W.",
                "datePublished": "2018-07-22",
                "reviewRating": "1",
                "description": "Heads up - I'm only giving this one star so I can write a review. It would get a huge ZERO if I could rate it that way. First off, Dale is a pretentious, \"underpaid monkey\" as he likes to be called. He is rude, unprofessional, and has the audacity to 'hate mail' potential clients and I know I'm not the first one because I've seen the reviews! I don't have much else to say but be careful and do your research before spending any money on this place! The owner seems to not have a care in the world if it's not benefitting him. Also, be ready for rude phone calls and emails from Dale if he doesn't get his way. He was hard to get ahold of from the jump, not to mention I live out of town and couldn't wait for days in between responses. After not being able to make it to my appointment because he had failed to get back to me promptly, I proceeded on with my day. The next morning I wake up to the most rude, despicable email I've ever received. Just be careful and read reviews because from what I've read, if you want a beautiful wedding with NICE, FRIENDLY people, this isn't the place. I'll attach one of many emails. STAY AWAY FROM THE HEART OF TEXAS RANCH ALL TOGETHER!!!"
            },
            {
                "author": "Melody G.",
                "datePublished": "2016-09-25",
                "reviewRating": "5",
                "description": "Amazing time with a group of 7 of us girls. Our guide was Christy and she was outgoing and made us all feel like nothing was a bother for her. Picked us up at our hotel in Fredericksburg, went to pick up lunch, and then on to first of 4 wineries. She took care of everything. Even loaded up our bottles/goodies in the back of the bus and kept the AC on to keep it all cool.  Christy went above and beyond to keep everything organized, she set up our lunch, picked up our trash, offered to take us anywhere we wanted to go, and she kept us on time to all of our tastings. We bought a bottle of wine at the 3rd winery and drank in the bus on the way to the 4th. Lunch was a boxed lunch bought at local deli (very good). Everything was included. Everything was professional. The bus was large and comfy. Highly recommend this tour company!"
            },
            {
                "author": "Valarie M.",
                "datePublished": "2018-04-25",
                "reviewRating": "4",
                "description": "Dale was great getting everything organized and keeping us on track - and then also helping us change the schedule when we needed to.  very accommodating.  thanks Dale! you were a great host!"
            },
            {
                "author": "Erin K.",
                "datePublished": "2018-05-07",
                "reviewRating": "5",
                "description": "We had a great time on this wine tour celebrating my sister's bachelorette party. Dale was very prompt and polite returning my phone calls. He was also very accommodating as the number of girls going on the tour changed at the last minute. We went to Fat Ass, Six Shooter and Fiesta Vineyards which were a blast and everyone enjoyed the tastings. Our driver Rick was funny and a true gentleman. It was raining that day and he had an umbrella to escort everyone in and out of the tasting rooms so no one got soaked. One of the girls left their phone on the tour bus and Rick came back later that evening to return the phone even after we offered to meet him half way. We had a great time and would recommend this tour to anyone!"
            },
            {
                "author": "Tory H.",
                "datePublished": "2018-06-14",
                "reviewRating": "5",
                "description": "What a fun and relaxing time! The tour bus was very spacious and clean and the driver was very accommodating. The tour was carefully selected for us with every winery being better than the last! I cant wait to take another tour."
            },
            {
                "author": "Keith R.",
                "datePublished": "2015-02-14",
                "reviewRating": "1",
                "description": "We paid nearly four hundred dollars and it was a joke. What was supposed to be a winery tour was a tour of places that sold wine. We went to a store in downtown marble falls, an art studio, a grocery store and at the very end an actual winery. This constituted our day.   This is NOT a day of going to wineries in the hill country. Everyone was disappointed on Valentine's day.   The guy who led the tour was nice but they clearly got kickbacks where we went.   When we went to lunch no one got their order and right when we were leaving this sandwich shop the tour guide asked, \"everyone went to the tasting room, right?\" We're talking about a sandwich place being a stop on the wine tour people.   Horribly disappointed. Considering tastings were at most $10 for each of the four \"wineries\" we went to, it was a rip off in value.  The company clearly avoided going to respectable wineries and instead went to dead end places where they could maximize their profit margin.   Avoid at all costs!!"
            },
            {
                "author": "Kat S.",
                "datePublished": "2018-01-01",
                "reviewRating": "5",
                "description": "We had a great time on this wine tour. I booked it only two days in advance and they took great care of us. I told Dale our tastes in wine and he sent us to three great wineries. We had the bus all to ourselves too! I would definitely use them again and recommend this company for all your wine touring needs!"
            },
            {
                "author": "Monica P.",
                "datePublished": "2014-09-20",
                "reviewRating": "5",
                "description": "Dale is great!! He helped us find some Texas wines that we actually like! We went to a few places I never would have thought to stop by and helped us pick out some good wines to try. He kept the ride fun even though we were with 2 other groups of people we didn't know. The van was comfy and well air conditioned and stocked with bottled water. Would definitely recommend!"
            },
            {
                "author": "Dawn N.",
                "datePublished": "2017-09-11",
                "reviewRating": "5",
                "description": "Even a rainy day couldn't dampen the amazing experience the Heart of Texas Wine Tours provided.  We visited four wineries and were treated like VIPs due to Dale's wonderful rapport with vineyard owners and staff.  Dale's knowledge of wine and  the specialities and uniqueness of each winery made the tour interesting and fun.  By the end of the day, I had not only made new memories, but new friends too!"
            }
        ]
    },
    {
        "name": "Horseshoe Bay Resort",
        "id": 362,
        "open_for_business": 1,
        "tags": [
            "Venues & Event Spaces"
        ],
        "website": "https://www.hsbresort.com/meetings",
        "longitude": -98.360018,
        "latitude": 30.547014,
        "address": "200 Hi Cir N",
        "postal_code": "78657",
        "city": "Horseshoe Bay",
        "state": "TX",
        "telephone": "(877) 611-0112",
        "price": "",
        "hours": {
            "Mon": "12:00 AM - 11:59 PM",
            "Tue": "12:00 AM - 11:59 PM",
            "Wed": "12:00 AM - 11:59 PM",
            "Thu": "12:00 AM - 11:59 PM",
            "Fri": "12:00 AM - 11:59 PM",
            "Sat": "12:00 AM - 11:59 PM",
            "Sun": "12:00 AM - 11:59 PM"
        },
        "accommodations": [
            "Accepts Credit Cards",
            "Free Wi-Fi"
        ],
        "unaccommodations": [
            "Accepts Android Pay",
            "Accepts Apple Pay"
        ],
        "rating_value": "3",
        "review_count": "277",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/p_HhRTQKuaFSWoLkTfcToQ/l.jpg",
        "reviews": [
            {
                "author": "Scott A.",
                "datePublished": "2021-12-30",
                "reviewRating": "3",
                "description": "I had had this resort on my list of places to go for a couple of years. Unfortunately the quality of service was not up to my expectations.  Now to be fair it's very challenging time to hire and properly train servers and staff. However some very simple things could have made the stay more enjoyable.  360 bar - This restaurant / bar offers a good atmosphere and a fun place to gather.  This is where the staffing was the biggest concern or issue. I got up to get a menu off the bar and someone cleared our table including our drinks that were just ordered. I'm a fairly patient person but this was unacceptable because I left the table for about 1 minute. I asked the person why did you clear our table we haven't ordered yet. His response was \"we close in 40 minutes.\"  Inside restaurant - best service but when our food was up in the window (which I learned to keep an eye on) I couldn't find a server to bring our food to the table. The cook started pouring on more sweet potato fries on to try to keep the plated ones warm!   Pool staff - utterly clueless Now I didn't think it was possible for a resort to run out of pool towels late in the season..... but they found a way. The drinks they make are ok, but I haven't found a better margarita than my own.   When I had a long conversation with a manager named Michael, I was more frustrated than when I started with him. In one ear and out the other ear (he didn't seem to care about our issues during the stay).  Golf courses are amazing, that's the part that brings people back. Excellent service inside the golf shops and golf courses are in excellent condition."
            },
            {
                "author": "Barbara P.",
                "datePublished": "2021-11-30",
                "reviewRating": "4",
                "description": "My daughter and I had a delightful stay at the hotel at Horseshoe Bay Resort starting on Labor Day afternoon 2021. Horseshoe Bay Resort is a 7,000-acre AAA Four Diamond resort about 45 minutes from Austin in the Texas Hill Country. We had such a great time and it was a perfect time to be there. It's a beautiful resort! With all the palm trees and beautiful vegetation, it seemed like I was in a tropical paradise instead of Texas.  We ate at several of their restaurants, which were all great: Yacht Club, J's Restaurant, Slick Rock Grill, and Whitewater 360 Sports Club.  We really enjoyed their lovely beach on the lake with an ample choice of nice lounge chairs and beach umbrellas. We also enjoyed the Yacht Club Pool near the Marina. They took reservations, so the number of people using the pool was always small. There were also other pools available.  At the Marina, they had wave-runners, canoes, and boats available for a fee.   There were also bicycles available with no fee.   We very much enjoyed so many amenities at Horseshoe Bay Resort.  They also had a great spa and FOUR beautiful 18 hole golf courses! In addition to the lovely hotel rooms, they had villas and homes that could be  rented.  With so many acres of fun, it was wonderful that they gave shuttle rides anywhere on the property with a simple phone call...golf carts, Suburbans, and vans were always available on the property.  The staff were all very helpful and so friendly!  We had such a great stay at Horseshoe Bay Resort!"
            },
            {
                "author": "Steve W.",
                "datePublished": "2021-11-19",
                "reviewRating": "5",
                "description": "Before deciding on this resort, we had already checked into two different hotels on this day only to check back out. The reason was because their mattresses were badly stained with urine and poor quality bedding. Before staying at any hotel, you should always pull back the sheets and mattress cover to see just what you're really getting into. The bed in our room at this resort had a mattress that was like new and the bedding was perfectly clean.  Upon checking in, Jimmy was extremely helpful and gave us a fantastic rate. Now for the pros: The room was well furnished with a large flat screen, a mini fridge and a good size closet. The bathroom was equally well crafted with a nice shower and had good hot water pressure.  The curtains that cover the balcony door were excellent at keeping out direct sunlight. There is a nice restaurant called J's in the lobby of which you can find separate reviews on yelp. There is also a nice small coffee shop downstairs with some fresh baked goods. It is quite obvious they have poured some serious money into this place especially as you walk the grounds. Everywhere you look there are fountains, rivers and waterfalls along with meticulously cared for gardens. There are also numerous tennis and pickle ball courts, so bring your gear. There's even one of the most beautiful putting courses I've ever seen. There is a very nice outdoor pool and a fairly sizable hot tub, so make sure to bring your bathing suit.  If I could change anything about our stay, I would add a ceiling fan to the room and a microwave. We were going to use the hot tub, but after testing the waters we found that it just was not hot enough for our liking. That aside, this was definitely one of the nicest places we've ever stayed at and we will definitely be back"
            },
            {
                "author": "Kelly M.",
                "datePublished": "2021-07-22",
                "reviewRating": "2",
                "description": "I really struggled on this review. I'm going to start with the positive: - we received a free room upgrade because it was our honeymoon - the massages at the spa were wonderful, but the pool wasn't open - The staff working is very helpful and attentive   The negatives: - our first meal here was dinner at Jay's and I got food poisoning, which ruined our entire honeymoon - A lot of the drink machines are broke - I sent management an email regarding the food poisoning and have been completely ignored, but the banquet manger helped us while we were there - food is pricey.. very pricey  - I wish there was an adults only pool or area. If there was one, I couldn't find it. I made reservations at the Yacht Club because I thought it was adults only. We got there 5 minutes after our 3:30pm reservation and it was packed. I don't think the reservation times are enforced  - we waited 20 min for someone to come up and help us with our luggage. We finally decided not to wait anymore. They actually brought our car around without us asking, so we were late to our Spa appointment.  In all. It was mediocre. Some positives and negatives. But getting food poisoning and being completely ignored from management left a sour taste in our mouth. We probably won't be back."
            },
            {
                "author": "Ryan R.",
                "datePublished": "2022-02-21",
                "reviewRating": "1",
                "description": "If your going to stay at this property and plan to use their amenities I would call ahead and make sure they are available. I stool the family there for a quick getaway and to use the amazing looking pools featured all over their website and booking site but upon arrival was told that all pools are under major renovation. Restaurants had extremely limited menus and the hotel staff was not very welcoming and friendly. A hotel that classifies them self as a resort with no amenities is not really a resort."
            },
            {
                "author": "Susan C.",
                "datePublished": "2021-11-17",
                "reviewRating": "1",
                "description": "Service is seriously lacking! I don't care that's it off season.  1st we ask about a restaurant and they recommend a pizza restaurant within the resort and they don't mention that it's closed the next two days. Everything about dinner in J's was slow the last straw was we ordered apple pie 25 minutes later still no apple pie no hint from the waitress as to why we don't have it she never came out to even say it was going to be late. She did come running when I was walking out of the restaurant before signing my check!   Terrible terrible overall experience."
            },
            {
                "author": "S. T.",
                "datePublished": "2022-01-03",
                "reviewRating": "3",
                "description": "We visited this place about a year ago and had a far better experience than we did recently. So I'm here writing an update. Rung in 2022 at HB, hoping for another fantastic time. We enjoyed the complimentary wine and cookies upon arrival in 2021. At that time, enjoyed all meals at J's Restaurant-breakfast, lunch, and dinner. No refreshments were given this time and was disappointed by J's meal options. The lunch and dinner menus were very similar. Salads, bar foods and sandwiches are fine for lunch, but not as a repeat for dinner (a slight variation was made). 2021 dinners were hearty and comfort-type foods. We loved the dinner last year at The Yacht Club, so much so, bragged about it, and made sure we made reservations again. For us, (good) food is LIFE, and was what brought us back again. Was never told in advance about the $120 5-course menu. This should have been advertised for consumers to make an informed decision to dine there or make arrangements elsewhere. The courses were tiny, boring with no flavor. We were starving about an hour later. Gratuity was automatically added to any sized party. We felt robbed! New Years buffet breakfast at J's was buffet style, not a wise choice with Covid/Omicron running rampant. The white young man at the omelet station's gloves were torn and needed changing. Protective face masks weren't enforced- didn't see disinfecting between guests, dividers, etc. There were limited activities available.  Not sure why they would offer fitness classes early morning New Years Day as most people slept in...particularly since your facility had 2 parties for guests (one complimentary and the other $50 per person) that ended at 1 a.m. Not a good choice. Overall, not a good experience. Would not recommend."
            },
            {
                "author": "Tiffany J.",
                "datePublished": "2021-07-29",
                "reviewRating": "3",
                "description": "My friend had a girl's weekend at Horsehoe Bay to celebrate her 40th birthday. She had booked the rooms a few months in advance which was good because the room rates increased significantly after she booked. Getting to the resort was a little confusing because there's a huge sign off of 71 (I think) that looks like the main entrance, but it isn't. When I arrived, I was greeted by staff. They let me leave my car at the drop off area so I could unload. One of the greeters helped me with my bags. Parking is free (though I imagine it is covered in the resort fee). They have the option to valet (I believe it is $25 a night). I got lucky and found a spot in the parking lot directly across the street from the main tower (the walk was less than 5 minutes).  We were advised to book amenities and activities at least a month out. I was able to get a spa reservation for 9 am on a Saturday. I was interested in doing a winery tour but it took two weeks for someone to get back to me so I decided to skip it. I was almost late to my spa appointment because I was waiting for the shuttle that never came so I ended up walking. I had the 50 minute Himalayan Salt Stone massage and it was really nice. They give you a locker, a robe, and sandals to wear around the spa. The waiting area was a bit awkward because everyone is sitting in their robes. I also hung out in the sauna for a few minutes but could not figure out how to turn on the lights. One of the women in my group had a massage scheduled, but the masseuse had an emergency and had to cancel. Another woman in the group got a mani/pedi and was pleased with it. Some of the ladies did the stand up paddle boarding at the marina and had a good time.   We reserved a cabana at the Yacht Club which was nice because we had it all day. Our group had 12 people and it was big enough. My only complaint with the cabana is that they are kind of distant from the pool and lake. Our attendant was nice. We ordered food and the Caesar salad was so small that my friend had to ask for a second one. The margherita pizza was very good. The hot tub looks like a kiddie pool and there were many kids swimming in it which was very strange.  I went to J's three times. On the first night we had drinks and the service was incredibly slow. The crowd was also loud and obnoxious so we sat outside near the pool. I tried a beer from Save the World brewery and it was good. The next evening, we had dinner and we were disappointed that it was buffet instead of full service. The food was good and they had many of the menu items available, but it was just unexpected. The last morning, we had the breakfast buffet and it was good but over priced.   They serve Starbucks coffee in the market. I had a white chocolate mocha and it was good, but I got double charged. I didn't realize it until I was checking out, but they took the charge off of my invoice. Unfortunately many of us had issues with our invoices such as charges that weren't ours, to mixed up charges amongst ladies in the same room. I had to fill out a form with the accounting department to have a charge moved from my friend's card to my card. It is fixed now but it took a few days.   The rooms were nice. I loved the double sinks and the oversized shower. The water pressure was amazing. Our TV remote didn't work well but we weren't in the room much so it was okay. Housekeeping is currently only every three days but we were fine using the same towels since it was just for the weekend. The bed was comfortable and I slept well. I found the room to be very nice. Horsehoe Bay is a nice property, but it is over priced in my opinion. It felt more like a really nice hotel rather than a resort."
            },
            {
                "author": "Mike B.",
                "datePublished": "2021-07-14",
                "reviewRating": "1",
                "description": "We became members and paid a lot of money to find it's not what they told us it would be. So disappointed.   They've over sold memberships to the point there is no parking anywhere, everything we want to do extra cost us more money, and on a Friday-Sunday, go look at the yacht club pool. I thought the fire Marshall was going to come. Way too many drunk people and people in general.  There is a huge wait to get into one of 3 very pricey restaurants. They don't have enough workers bc the town is just too small. They don't have enough room for boat storage, in fact they are sold out.  They said they're putting in a lazy river, not going to happen. (Apparently they've been saying this for years) Their workout gym is less than subpar. Not enough equipment, half of machines are broken and don't work, not enough mirrors, it's very dirty.  I've called to complain and I was told all they care about is heads and beds.   HSB is in the business of selling you real estate and that's it. They're building more condos which leads to more people, more wait times, no parking, no boat storage, etc etc."
            },
            {
                "author": "Jeremy S.",
                "datePublished": "2021-08-05",
                "reviewRating": "1",
                "description": "Decided to give it another try in July. The waters condos still look the same. Mold..hire a company to pressure wash the sidewalks, courtyard, and stairwells. Use some money and replace the grills that Still don't work. It's still not a luxury resort. If you are expecting Ritz class this isn't it. The resort has so much potential but it lacks in food quality and the Yacht club is packed. I witnessed non resident folks going in but we had to get an appointment! Unbelievable. I personally don't know why Members allow hotel guests and random folks to trash out their Yacht club the pool water was gross! Do yourself a favor, spend your cash at a nice Ritz Carlton Resort!"
            },
            {
                "author": "R J.",
                "datePublished": "2021-10-01",
                "reviewRating": "2",
                "description": "Nothing on the property is open past 8/9pm except for the over priced in house restaurant. Also plumbing issues of a toilet running all night from an obvious home owner perspective that was \"patched\" instead of fixed. The two stars represent the staff and the cleanliness of the hotel. The staff was kind and friendly. The room and the property was clean."
            },
            {
                "author": "Cedric R.",
                "datePublished": "2021-01-21",
                "reviewRating": "5",
                "description": "This was our first time visiting this amazing resort the only regret I have is that we needed at least two nights because one night was not long enough to explore the entire resort.  We still had a amazing time and will return soon."
            },
            {
                "author": "Art D.",
                "datePublished": "2020-06-02",
                "reviewRating": "5",
                "description": "This place is a hidden gem! I was there over several days Friday to Monday for golf. The courses are excellent and challenging. They are in immaculate condition with scenery that is breathtaking. The service and the people were fantastic. The home owners in the neighborhoods are very nice. The Villa I resided in was nice, not a full kitchen just wet bar and fridge. There was not daily cleaning so be prepared for that. Overall great place, great stay and I will visit again."
            },
            {
                "author": "Tony P.",
                "datePublished": "2021-06-23",
                "reviewRating": "5",
                "description": "My husband and I were at the resort this past weekend for a weekend getaway when we ran into Dawn (manager at the Whitewater 360 Bar) in the elevator.   At first encounter, she offered us cold drinks while we waited for our suite. Dawn took care of us the entire weekend as though we were her personal guests. She made sure we didn't lack food or drinks or ANYTHING for that mater. She is by far one of the most amazing human beings my husband and I have EVER encountered not to mention a great employee and manager.  Dawn is an asset to the resort and a hidden gem to your organization.....Tess"
            },
            {
                "author": "Misty D.",
                "datePublished": "2021-11-24",
                "reviewRating": "5",
                "description": "We are here for Thanksgiving week. We got to our villa in the Palm Villas and found out the shower didn't work after a long day of traveling. I went to the lobby really upset only to find a girl named Grace working the front desk. She was very sympathetic and promptly suggested we move to another unit. It's just my husband and I but she felt so bad that she upgraded us to a much larger villa with better views, balconies and full kitchen. Needless to say, she took a bad situation and made it all good for me. Grace is a valuable employee and should be recognized by the Horseshoe Bay management. She handled the situation perfectly."
            },
            {
                "author": "Monie H.",
                "datePublished": "2019-11-12",
                "reviewRating": "4",
                "description": "This was my husband's and my first time to Horseshoe Bay Resort, but it certainly won't be our last.  We went specifically to check out the Wine, Dine, and Jazz Festival.  Festivities are on a Friday and Saturday, but we checked in on Thursday so we could fully enjoy the resort and the surrounding areas.  This festival was well worth the trip.  The food, wine and service were 5 stars.  The chef demos and the direct interactions with celebrity guest chefs were a lot of fun - especially if you are a foodie like we are.    Service at the hotel was perfect.  Staff was friendly and helpful.  The resort is lovely.  If you drive only 25 miles or so you end up at gorgeous sprawling state parks, wineries, caves (to explore), etc.  We spent one full day exploring the area and the rest of our time was spent enjoying the festival and resort.  Other attendees were friendly and chatty.  We had a great time talking with other guests.  This was a nice time of year to be at the resort if you want a \"get away\" that takes you away from kids for a bit.  I have a feeling that this resort is (understandably) teaming with kids during the summer, but when school starts it's nice and quiet.    Temperatures dipped down one day, but the sun was out, so we still made use of the hot tub.  There is also one pool that is heated.  We had a lake view room.   The room was nice, clean, quiet, and had a comfy bed.  We were able to keep the temperature controlled well in the room.  Our view was nice.    There was a frig in our room, but no microwave. There is also a small Keurig coffee pot with complimentary pods in the room.  Next visit, we'll probably rent a villa with a full kitchen or kitchenette.  I did miss the ability to heat food.  The closet was large and spacious as was the shower.    We'll definitely return."
            },
            {
                "author": "Jessica S.",
                "datePublished": "2021-02-09",
                "reviewRating": "1",
                "description": "Our wedding weekend was insane. My maid of honor, AJ's sister and brother in law all tested positive for covid a couple days before our wedding. We all had to rush and get a covid test to insure we were negative because we had dinner with his sister and brother in law a week prior. We were negative and I told our venue, @hsbresort, that we were going to have 15 guests instead of 19 on the Thursday before our wedding day on Saturday. They said they didn't have a protocol and that this was okay. I thought we were in the clear. We thought about postponing because some of our favorite people wouldn't be in attendance, but we didn't know what the world would bring later on and we just wanted to be married. So Friday, Rehearsal Day, around 3 pm our event coordinator at the resort called us and said hey can we meet real quick and I thought perfect, I wanted to touch base on the details of this weekend! So once we arrived, they let me and my parents fully check in to the hotel and then they led us back to a little conference room. They proceeded to tell us that we couldn't have our \"banquet\" there. I was stunned and confused because we only had 17 people attending an outdoor ceremony and then 15 people staying for a very spacious dinner indoors, while proceeding to have an 80 person wedding that night. They said \"we can still have you stay here and we can bring your dinner to your rooms, y'all can golf because that's outdoors.\" I said okay so can I still have our ceremony outdoors here, for pictures I thought that would be nice. They consulted with their team and then proceeded to kick us out of the hotel. We had friends that checked in on Thursday night, and they kicked them out of their room. Other out of town guests that we hadn't seen were about to check in and they wouldn't let them stay there either.   They gave us a full refund, but Horseshoe Bay Resort hasn't contacted us after they completely kicked us out of our wedding venue and hotel, 2 hours before our Rehearsal."
            },
            {
                "author": "Laura C.",
                "datePublished": "2021-10-10",
                "reviewRating": "1",
                "description": "It's really loud in our room. The operator was was rude when I inquired about the noise."
            },
            {
                "author": "Kay J.",
                "datePublished": "2018-11-05",
                "reviewRating": "5",
                "description": "My husband and I spent this past weekend at Horseshoe Bay Resort for his birthday.  The grounds were beautiful and well manicured.  Upon check in, Jimmy answered our questions, showed us details of the map and gave us a coupon for two complimentary adult beverages (to celebrate).  He was professional, informative and cheery.  Our room was extremely cozy, immaculate and featured updated tasteful decor.  The bed and pillows were a dream! I need to find the brand of pillows for sure! We also had a great view of the pool and greenery. The room was nice and quiet/soundproof.  Shampoos and soaps were lovely too.  We took advantage of a beautiful walk all around the hotel grounds and drove down to the Yacht Club to sit by the water. The place was very empty (off season) so I managed to take some nice photos. The hotel has a full spa, a mini golf course, numerous tennis courts, bike rentals, a kids club, activities on the main lawn (they had a fire pit with s'mores at night), golf and much much more. The food was good as well (especially the wings which came highly recommended).  There was an extremely talented performer (guitar/vocal) at the bar on Saturday night. We listened for quite awhile as we enjoyed a few cocktails. He was so gifted with music!   Overall, our stay was stellar!  We cannot wait to return soon!!"
            },
            {
                "author": "Steve W.",
                "datePublished": "2021-03-08",
                "reviewRating": "1",
                "description": "This place is off the chart expensive for a standard hotel room. For an anniversary amenity they gave us a 6 dollar bottle of champagne. Nothing special 1 king bed room was 450.00. I feel completely ripped off."
            }
        ]
    },
    {
        "name": "AJE Transportation",
        "id": 411,
        "open_for_business": 1,
        "tags": [
            "Tours"
        ],
        "website": "http://ajetransportationcharters.com",
        "longitude": -98.156574,
        "latitude": 30.47605,
        "address": "",
        "postal_code": "78669",
        "city": "Spicewood",
        "state": "TX",
        "telephone": "(512) 296-7871",
        "price": "",
        "hours": {
            "Mon": "6:00 AM - 10:00 PM",
            "Tue": "6:00 AM - 10:00 PM",
            "Wed": "6:00 AM - 10:00 PM",
            "Thu": "6:00 AM - 10:00 PM",
            "Fri": "6:00 AM - 10:00 PM",
            "Sat": "6:00 AM - 10:00 PM",
            "Sun": "6:00 AM - 10:00 PM"
        },
        "accommodations": [],
        "unaccommodations": [],
        "rating_value": "5",
        "review_count": "21",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/A8U2O0bezaFBT7GiPh_1ew/l.jpg",
        "reviews": [
            {
                "author": "Alex P.",
                "datePublished": "2021-10-25",
                "reviewRating": "5",
                "description": "Could not have been better. Mauricio was super easy to reach, arrived on time both times, and was super flexible. He saved our trip."
            },
            {
                "author": "Jeremy S.",
                "datePublished": "2021-10-25",
                "reviewRating": "5",
                "description": "Mauricio was incredible. Gave us a ride to and from lake Travis. Then a ride to COTA next day with no notice. Highly recommend for anyone around Austin."
            },
            {
                "author": "Brian K.",
                "datePublished": "2021-10-25",
                "reviewRating": "5",
                "description": "Mauricio was a great driver. He came through for us at the last minute and saved our trip to the formula one race"
            },
            {
                "author": "Pat C.",
                "datePublished": "2021-08-24",
                "reviewRating": "5",
                "description": "We had a great experience traveling from Austin to Lake Travis and back with Mauricio. He arrived exactly when he said he was going to and helped us load up the van with all our stuff. We ended up staying out on the lake for an extra hour, and he was flexible with us changing our pickup time. Also, when someone forgot a cell phone in the car he was willing to meet us to return it. Very pleasant, convenient, and safe experience!"
            },
            {
                "author": "Christina S.",
                "datePublished": "2021-04-26",
                "reviewRating": "5",
                "description": "I can't say enough good things about AJE transportation and Mauricio! We used their service to drop us off and pick us up from Lake Travis. Not only was his communication amazing, he went above and beyond to make it an enjoyable experience. He even let us borrow coolers to take on the lake! The next time I do a trip to Austin, I will 1000% use AJE again."
            },
            {
                "author": "S R.",
                "datePublished": "2021-07-17",
                "reviewRating": "5",
                "description": "AJE transportation was great for our bachelorette party!! Did an amazing job, brought us 2 coolers for our boat ride, and was so communicative. Would absolutely recommend!"
            },
            {
                "author": "Sarah H.",
                "datePublished": "2020-06-15",
                "reviewRating": "5",
                "description": "If you're looking for a reliable transportation service these are your people. Mauricio communicated with me quickly and clearly picking up 15 of us from the hill country of austin and drop us off at lake Travis. They also offer extra coolers if needed. But what I loved most what getting sent a video slide show of our trip! Excellent service! Thank you! Will definitely be using them again!"
            },
            {
                "author": "Jena E.",
                "datePublished": "2019-08-01",
                "reviewRating": "5",
                "description": "I hired Alba for my husbands 36th Birthday - we rented a yacht out on Lake Travis and needed transportation for the group to and from the marina. Alba was a delight to work with through the process- very responsive, friendly and professional. He made sure I understood what the timeline was and what to expect. He will also make a stop for you on the way if you need to pick up additional refreshments.  We actually stayed out past our projected return time and Alba was incredibly gracious and patient with us- I really appreciated that because it can be stressful planning large group outings and he really made it stress-free for me. I would recommend AJE Transportation to anyone looking for easy group transportation in Austin- he was stellar!"
            },
            {
                "author": "Jan M.",
                "datePublished": "2019-03-09",
                "reviewRating": "5",
                "description": "AJE Transportation and Mr. Ettie are the BEST!!!  He came to our rescue by going out of his way to provide last minute, transportation service for a bachelorette, winery tour last weekend.  He was on time, accommodating and a pleasure to deal with. Can't go wrong with him!  I would not hesitate to use him again.  5 STARS for sure!"
            },
            {
                "author": "Paul S.",
                "datePublished": "2018-08-02",
                "reviewRating": "5",
                "description": "Call AJE first!   Alba went above and beyond to help me figure out a ride for my friend's bachelor party.   He gave me recommendations for the weekend and was very easy to deal with.   You have to move fast though, I waited to book my trip with him until it was too late, but he still helped me and found me a ride with one of his competitors! You really don't see service like that anymore. I'm very impressed by Alba's commitment to customer service. Would absolutely recommend!"
            },
            {
                "author": "Laura T.",
                "datePublished": "2018-04-10",
                "reviewRating": "5",
                "description": "Alba was super friendly and accommodating!! We had planned our day for my friends bachelorette party and he was even going to add an extra stop for us! Our plans went south due to the weather and we unfortunately had to cancel our boat outing. He came quickly to our rescue, suggesting numerous additional options for the day. He drove us around to a vineyard and distillery without any additional fees. He was always checking in on us to make sure we were happy and having fun! I'd highly recommend him for his quick and efficient communication, flexibility, and attention to detail when it came to our needs. I'll 100% be booking his services again if I find myself with a large party in Austin again!"
            },
            {
                "author": "Andrea M.",
                "datePublished": "2018-04-08",
                "reviewRating": "5",
                "description": "Alba chartered my girlfriends on a bachelorette party today. He was awesome and quick on his feet to find us solutions when the weather went sour today and changed our boat plans. He checked in so many times if we needed to stop for snacks or other suggestions for places to visit!"
            },
            {
                "author": "Caroline B.",
                "datePublished": "2017-04-26",
                "reviewRating": "5",
                "description": "Alba was incredibly helpful leading up to our bachelorette trip to Austin. He was super reasonable with pricing and sent along restaurant and sight-seeing options before our trip.   The day of, he was right on time and beyond courteous in helping us get all of our stuff to the van. He even stopped on the way for us to grab food and alcohol.   Since the weather was iffy, Alba made sure to let us know that he was standing by and flexible with timing so he could bring us back to town early if we wanted.   The van was clean and comfy. I'd absolutely recommend him to anyone going to Austin and hope to use his services again soon. :)"
            },
            {
                "author": "Beth P.",
                "datePublished": "2018-05-20",
                "reviewRating": "5",
                "description": "We just returned from a day long wine tour with Alba who owns AJE Transportation.  I would highly recommend his services.  He was flexible, attentive, knows the Spicewood area well and was able to give recommendations on wineries, distilleries, and restaurants.  He gave us a sample itinerary for the day and was easily able to modify this based on what we wanted to do.  He was courteous and kind and I will definitely book again with him.  Highly recommend!!!"
            },
            {
                "author": "Stephanie D.",
                "datePublished": "2018-04-09",
                "reviewRating": "5",
                "description": "Alba was really great and saved the day! We had a bachelorette party and because of the weather we had to change our plans -- not only was he super flexible and nice, but he had lots of great suggestions and helped us salvage the day with a lot of fun activities. He was really friendly, on time, and continuously checked in to make sure we were all comfortable and had what we needed. Not to mention was great about us listening to our own music and helping with literally anything! I would definitely recommend him for any group trips."
            },
            {
                "author": "Taylor W.",
                "datePublished": "2018-08-29",
                "reviewRating": "5",
                "description": "AJE is the only way to travel when visiting Austin, TX! Alba is not only the most helpful with planning, he is also extremely punctual and accommodating, especially with large parties. 10/10 would use Alba and AJE again! Thank you for the memories and great conversation Alba!!!"
            },
            {
                "author": "Julian E.",
                "datePublished": "2016-10-24",
                "reviewRating": "5",
                "description": "Alba did a phenomenal job of providing transportation for myself and 10 friends to Lake Travis!  He was prompt, courteous, and very helpful finding a place to rent a boat and get supplies for our day on the lake.  I highly recommend Alba for transportation anywhere in Austin, especially if you are from out of town and value the insights of a local expert! A++ keep up the good work sir!"
            },
            {
                "author": "Adam W.",
                "datePublished": "2017-05-09",
                "reviewRating": "5",
                "description": "We can't say enough good things about Alba and his services. He transported me and eight friends to Lake Travis for a weekend boat trip. He was incredibly kind, helpful, thorough and prompt. He showed up fifteen minutes early at our place and helped us load into the car. Alba then brought us to a grocery store on the way so we could get supplies for the boat. He packed two coolers which we were able to bring on the boat - another big plus. And he was prompt and helpful in bringing us back home afterward.  As a bonus, he's incredibly knowledgeable about the surrounding area and was able to offer up tons of great suggestions. Last but not least, he's a really nice guy! 10/10, would definitely recommend Alba to anyone."
            },
            {
                "author": "Tanya G.",
                "datePublished": "2018-04-10",
                "reviewRating": "5",
                "description": "Alba was great - see reviews below. Super accommodating and knowledgeable about the local area."
            },
            {
                "author": "Amanda N.",
                "datePublished": "2016-05-10",
                "reviewRating": "5",
                "description": "Alba was a great driver. Very knowledgeable about the fun stuff to do around Austin. He took us to Dripping Springs and Spicewood for my Bachelorette party and we had a blast. Several girls said it was the best bachelorette party they had been to!! You can eat and drink alcohol on the van. I shopped around, and his 14 passenger van was the most reasonably priced. We went to Treaty Oak, Spicewood Vineyards and Poodie's!! Definitely recommend this company."
            }
        ]
    },
    {
        "name": "Round Mountain Distilling",
        "id": 164,
        "open_for_business": 1,
        "tags": [
            "Distilleries"
        ],
        "website": "",
        "longitude": -98.326728,
        "latitude": 30.425728,
        "address": "1313 Ranch Rd 962 E",
        "postal_code": "78663",
        "city": "Round Mountain",
        "state": "TX",
        "telephone": "",
        "price": "",
        "hours": {
            "Mon": "Closed",
            "Tue": "12:00 PM - 5:00 PM",
            "Wed": "12:00 PM - 5:00 PM",
            "Thu": "12:00 PM - 5:00 PM",
            "Fri": "12:00 PM - 6:00 PM",
            "Sat": "11:00 AM - 6:00 PM",
            "Sun": "Closed"
        },
        "accommodations": [],
        "unaccommodations": [],
        "rating_value": "5",
        "review_count": "4",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/HIXdA-M8TpU2R89HsO8dPg/l.jpg",
        "reviews": [
            {
                "author": "Sheldon B.",
                "datePublished": "2021-11-27",
                "reviewRating": "5",
                "description": "Owner and his wife were very entertaining and you can tell they really enjoy what they're doing.  Got a quick tour of the property and the distilling process Saturday morning.  Great product and fantastic mixed drinks, I'll definitely be back!"
            },
            {
                "author": "Rebecca K.",
                "datePublished": "2022-03-26",
                "reviewRating": "5",
                "description": "We had such a fun experience! The owners were endearing and gave a great tour of their operation. The painkiller is delicious!"
            },
            {
                "author": "Stephanie W.",
                "datePublished": "2021-03-30",
                "reviewRating": "5",
                "description": "This rum is the real deal!! It's incredibly smooth on it's own but also makes some fantastic tasting cocktails. The owners are extremely friendly...you can tell they have put their hearts and souls into their distillery and it shows! Also, if you ask, they will usually be able to give you a tour of the place which is a really neat experience in itself!   If you are not typically a rum drinker, this place may very well change your mind (definitely changed mine) :)  Highly Recommend!!!"
            },
            {
                "author": "Joseph R.",
                "datePublished": "2021-11-22",
                "reviewRating": "5",
                "description": "Round Mountain Distilling was a great surprise. I didn't expect to be able to speak to the distiller and on top get a private tour of the facilitates for me and my friends. It's a small operation but they make some great rum and know how to make great drinks. This was an awesome place to sit and have a few drinks with friends. Mike (the owner / distiller) was a great host and his brother-in-law (part-owner) was just as welcoming."
            }
        ]
    },
    {
        "name": "Texas Tipsy Tours",
        "id": 102,
        "open_for_business": 1,
        "tags": [
            "Wine Tours",
            "Beer Tours",
            "Party Bus Rentals"
        ],
        "website": "https://www.texastipsytours.com",
        "longitude": -98.871984,
        "latitude": 30.275201,
        "address": "",
        "postal_code": "78624",
        "city": "Fredericksburg",
        "state": "TX",
        "telephone": "(512) 593-1858",
        "price": "",
        "hours": {
            "Mon": "9:00 AM - 5:00 PM",
            "Tue": "9:00 AM - 5:00 PM",
            "Wed": "9:00 AM - 5:00 PM",
            "Thu": "9:00 AM - 5:00 PM",
            "Fri": "9:00 AM - 5:00 PM",
            "Sat": "9:00 AM - 5:00 PM",
            "Sun": "9:00 AM - 5:00 PM"
        },
        "accommodations": [
            "Accepts Credit Cards",
            "Women-owned",
            "Open to All"
        ],
        "unaccommodations": [
            "Masks required",
            "Staff wears masks",
            "Accepts Cryptocurrency",
            "No Wi-Fi"
        ],
        "rating_value": "5",
        "review_count": "17",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/Oq-tSqeo5lmN3qBYP3PKEw/l.jpg",
        "reviews": [
            {
                "author": "Mandy G.",
                "datePublished": "2021-11-17",
                "reviewRating": "5",
                "description": "If you're looking to visit some wineries in the outskirts of Austin, I recommend it with Arlen!   Arlen was sweet, knowledgable, and funny. He picked us up from our Airbnb and drove us 45 mins out and back, while we blasted some rachet songs to sing haha. He would check in on us during the winery to see if we needed anything or have any questions, and he would offer to help us take multiple pictures. He also got one of the wineries to allow us to explore their cellars!   On our last day in Austin, he drove by our airbnb to pick up someone else and honked at us as we waited for our uber. We were all so happy to see him again, as we all enjoyed our experience with him.   I recommend Texas Tipsy Tours with Arlen ;)"
            },
            {
                "author": "Brittany Z.",
                "datePublished": "2021-11-04",
                "reviewRating": "5",
                "description": "I have so many wonderful things to say about this company. I set-up an appointment online to schedule a private driver to Fredericksburg. Ashley called right on time. She was friendly and very informative.  She helped make the experience exactly what I was looking for. I wanted less sweet wines and a winery with food options. Arlen was our diver and was so knowledgeable and friendly. He picked us up right at the hotel in Austin. I felt the price for the experience is definitely worth it. If you were considering this experience, I highly recommend this company. They care and that is important."
            },
            {
                "author": "Alli G.",
                "datePublished": "2022-02-08",
                "reviewRating": "5",
                "description": "Texas Tipsy Tours is simply the best of the best! Organized, thoughtful, fun, professional, and accommodating! They do all the heavy lifting with the friendliest spirit and let you and your group have the time of your life!  We had the BEST time on our tour and absolutely adore Arlen, our driver! He was the kindest, most considerate, thoughtful, responsible driver ever! He was so fun but also let us have our time to just be girls and we didn't have to open a single door, make a decision, or carry a single bag (if we didn't want to) the whole time we were with Arlen!  Also, the management team was incredible. Wei booked last minute and they were so accommodating and listened to our unique needs/wants for the tour! And we're so detailed in instructions. I have had bad experiences with wine/bus tours with other companies and I was SO impressed with the whole experience at Texas tipsy!"
            },
            {
                "author": "Rolanda H.",
                "datePublished": "2021-05-09",
                "reviewRating": "5",
                "description": "If your looking to visit wineries or distilleries in the  outskirts of Austin like Dripping Springs and the surrounding area I highly recommend Texas Tipsy Tours. They are organized and timely. If you're an out of towner like myself and decide to book accommodations in Austin they will pick you up from there and bring you back.   All of my future bookings I will definitely request Wade. He was very professional and personable, he made sure we were taken care of at each location on our tour. He also was more than happy to take our pictures along the way."
            },
            {
                "author": "Ashley G.",
                "datePublished": "2021-08-23",
                "reviewRating": "5",
                "description": "We were on a girls trip and were lucky to have Arlen as our driver. He was exceptional, friendly and knowledgeable! He gave us great recommendations for places we were unsure about."
            },
            {
                "author": "Karla J.",
                "datePublished": "2022-01-24",
                "reviewRating": "5",
                "description": "Debbie was an amazing host.  We did Winery, Brewery, Distillery on our recent trip to TX.  Such a fun experience.  Would do again in a heart-beat!"
            },
            {
                "author": "Stephanie T.",
                "datePublished": "2021-03-11",
                "reviewRating": "5",
                "description": "Y'all BOOK WITH THEM!!!!! I literally do not have one negative thing to say about this company. From the minute I called to book to the minute I said goodbye to our driver the day of the tour they were fantastic.   So when I called there actually weren't any times available. They worked with me to make sure they had a tour time and sprinter available for our group of 6. I had a million questions; they were patient and kind.   Our group was 6 but one of my friends asked if we could add an additional person. Reached out to TTT and they said sure no problem. Literally 3 HOURS LATER I got a call that another girl tested positive with covid and wouldn't be able to come with us obviously- they were so nice and made the switch back to 6. Very grateful for their exceptional customer service.   Day of our driver Bryant was early which was great! Got on the bus and let us have free range of the radio, answered any wine questions we had or any questions about Fredericksburg. He was a fantastic host. Always texted 15 minutes till our time at the winery was up and took as many pictures as we wanted. He was so sweet! He also made sure we were never thirsty or hungry. Which for a group of girls is very important- smart man! Haha   I've heard things about other companies having hidden fees and people getting charges after leaving Fredericksburg and we had none of that. Texas Tipsy Tours was very transparent with all of their pricing and they had no hidden fees.   Thank you TTT for making our trip perfect. You won't regret booking with them."
            },
            {
                "author": "Mia L.",
                "datePublished": "2021-05-15",
                "reviewRating": "5",
                "description": "Sent a request in and received a response on a weekend afternoon in less than 5 minutes. Incredible customer service, they only fit up to 14 on their vehicles so we were unable to use them, but their owner takes quotes seriously!!"
            },
            {
                "author": "Kelly F.",
                "datePublished": "2019-10-28",
                "reviewRating": "5",
                "description": "My experience with Texas Tipsy tours was nothing short of perfect!!! From pickup to drop-off, Courtney (the owner) made our experience amazing! When I initially started inquiring about a tour a few months ago, many of the companies only offered private tours for a minimum of 4 people. However, Texas Tipsy Tours offers small group private tours (i.e. 2-3 people). This was perfect for me. She also made planning our trip so easy, and she promptly answered all of the questions I had.   On the day of the tour, she picked us up from our hotel in Austin in an Infiniti SUV (it was very clean too)! She even made a pit stop for me at a CVS on the way to our first winery. Throughout the 6 hour tour, she made sure we stayed on schedule. She even let us change a stop last minute because we wanted to check out a brewery!  One thing that was amazing was the comfort she provided! She allowed us to pick the music, provided phone chargers, and let us control the AC! She even opened our doors for us AND dropped us off/picked us up right in front of each place we went!  Overall, I highly recommend Texas Tipsy Tours, and I will definitely be back!"
            },
            {
                "author": "Audrey C.",
                "datePublished": "2019-05-07",
                "reviewRating": "5",
                "description": "Wow!  What an amazing day our group of ladies had with Texas Tipsy Tours.  We chose the half day option and were picked up right at our vacation rental (Farmhouse on Elder Hill) We wanted to just stay nearby so we visited Driftwood Estate Winery and Fall Creek.  We were planning to also see Vista Brewing (all in Driftwood), but we chatted and laughed so much that we ran out of time and Eric, driver/owner was flexible with our change of plans and let us just extend our time enjoying the fabulous view at Driftwood Estate.  The tour service was absolutely awesome and professional.  Everything done with excellence.  Thank you Courtney and Eric!"
            },
            {
                "author": "Ally H.",
                "datePublished": "2019-04-01",
                "reviewRating": "5",
                "description": "Awesome experience for bachelorette. Seamless communication with manager Courtney. Helped us make a great itinerary-2 wineries and 1 distillery. Group loved every minute. Driver Keaton was so friendly and professional and best of all company was affordable. Can't recommend enough"
            },
            {
                "author": "Ashton M.",
                "datePublished": "2020-03-20",
                "reviewRating": "5",
                "description": "I booked a private wine tasting tour with Tipsy Tours for a bachelorette party and it was seamless right from the start! They took care of everything and even placed our lunch order for us in advance so it was ready when we arrived. It was honestly one of the best tour experiences I have ever had and already booked another tour with them for later this year!"
            },
            {
                "author": "Chelsea C.",
                "datePublished": "2019-04-07",
                "reviewRating": "5",
                "description": "AWESOME! I worked with Courtney at TTT to plan my Husband's 30th birthday brewery tour. It was as easy as getting on the phone, explaining what I wanted, and Courtney took care of literally everything else. We picked the breweries we wanted and even included a food stop. She coordinated the bus pick up, drop offs, schedule, and even reserved tables for us at each stop. I love that we had our own bus (very nice one, by the way!), and had the flexibility to create our own tour based on beers and food my husband liked. It was the perfect Saturday in Austin! Payment was very easy as well - they sent me an invoice to my email and I was able to pay directly online for everything. Highly recommend, and thank you Texas Tipsy Tours!"
            },
            {
                "author": "Erin J.",
                "datePublished": "2020-05-05",
                "reviewRating": "5",
                "description": "We booked Texas Tipsy Tours twice in one weekend. I have taken quite a few van tours around the hill country and Texas Tipsy Tours sets themselves apart by not just being drivers but they truly host you the entire day. I will ALWAYS use this company going forward. We did a private charter from Driftwood to Austin, TX and back and Keaton our driver was a delight. He made sure we were picked up on time and each of our stops were easy and flexible. We did a mixed tour around Driftwood and Dripping springs the next day and our guide Eric executed the BEST DAY for us. He even picked up on what we were liking and recommended a change to our final stop to Vista Brewing and we were SO glad he did. At each stop he made sure we had plenty of water, snacks and chairs to enjoy the gorgeous venues. This is totally above and beyond what we would have expected from a driver. Courtney was so easy to work with and she helped make recommendations for our group ultimately making our weekend get away FLAWLESS. I promise if you don't use this company, you're wrong."
            },
            {
                "author": "Kylie H.",
                "datePublished": "2019-04-02",
                "reviewRating": "5",
                "description": "Texas Tipsy Tours was absolutely wonderful. They curated a wine tasting for my best friend's bachelorette, and were so helpful and knowledgeable. Courtney and Eric are just the sweetest people! Would highly recommend if you're looking for a relaxed tasting without the hubbub of big party buses, AND if you're looking for a more personalized experience with people who can really throw a party. Fredericksburg can be confusing because of the many, many options, so Courtney's expertise in the wineries proved incredibly helpful. Highly recommend!!"
            },
            {
                "author": "Christy C.",
                "datePublished": "2019-02-02",
                "reviewRating": "5",
                "description": "We had an excellent experience with this tour company.  They were easy to work with and to plan our day.  We selected the premium wine tour and stopped at 3 wineries and picked up lunch at Hye Market.  The entire experience was well thought out and planned thoroughly.  Courtney is one of the owners and helped me figure out which wineries to taste.  Keaton was our driver and he was great!  I would definitely recommend this tour company."
            },
            {
                "author": "Nancy R.",
                "datePublished": "2018-10-26",
                "reviewRating": "5",
                "description": "Our driver, Keaton, was amazing! He was so polite and kept us on schedule. The places we visited were amazing and so welcoming. Highly recommend!"
            }
        ]
    },
    {
        "name": "Taste of the Hills",
        "id": 64,
        "open_for_business": 1,
        "tags": [
            "Wine Tours"
        ],
        "website": "http://www.tasteofthehillstours.com",
        "longitude": -98.2174,
        "latitude": 30.042592,
        "address": "251 Circle Dr",
        "postal_code": "78676",
        "city": "Wimberley",
        "state": "TX",
        "telephone": "(512) 667-0518",
        "price": "",
        "hours": {
            "Mon": "9:00 AM - 5:00 PM",
            "Tue": "9:00 AM - 5:00 PM",
            "Wed": "9:00 AM - 5:00 PM",
            "Thu": "9:00 AM - 5:00 PM",
            "Fri": "9:00 AM - 5:00 PM",
            "Sat": "9:00 AM - 5:00 PM",
            "Sun": "9:00 AM - 5:00 PM"
        },
        "accommodations": [],
        "unaccommodations": [],
        "rating_value": "5",
        "review_count": "21",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/mgM39G4OD08zk6LQKpfiPg/l.jpg",
        "reviews": [
            {
                "author": "D H.",
                "datePublished": "2020-02-23",
                "reviewRating": "5",
                "description": "We loved our wine tour with Taste of the Hills. We visited three wineries with two other couples on the tour. Each stop was unique and Jodie was especially knowledgeable and friendly. She is completely worth trying the tour!   Bonus: we got engaged after the tour!"
            },
            {
                "author": "Vanessa T.",
                "datePublished": "2021-06-01",
                "reviewRating": "5",
                "description": "Jodie was the best!  I found Taste of the Hills on yelp.  I messaged Jodie in April to see what her pricing and availability was for Memorial Day weekend and she responded quickly. Paid deposit through venmo and paid the other half day of our tasting. We did one winery, one distillery and one brewery. She gave us a small history of each of the places we went too. Her cheese board setup was amazing! Very sweet and easy going. I highly recommend."
            },
            {
                "author": "Chandler W.",
                "datePublished": "2021-06-14",
                "reviewRating": "5",
                "description": "Jodie made my day all I could have dreamed of. Her bus is super nice, well air conditioned and plenty of space, her knowledge of each winery was very cool to hear and she made sure we were always comfortable! On a warm summer day we were kept cool, fed, and full of wine! Must book with Jodie for a trip around the hill country. Delicious wine and charcuterie board! Thank you Jodie!"
            },
            {
                "author": "Cheryl J.",
                "datePublished": "2020-01-20",
                "reviewRating": "5",
                "description": "OMG, Jodie is FaNtAsTiC! My bff and I were on our annual girl's trip and wanted to book a wine tour before we left the Hill Country of Texas. We were staying in the adorable town of Wimberley so I researched tours in the area.  Jodie's Taste of the Hills Tour got great reviews and went to wineries close to the Wimberley area. The day of the tour ended up being chilly and rainy. As soon as Jodie pulled up with her spectacular shuttle-like van she was out like a flash with pretty umbrellas for us! We went to 3 different wineries which we thoroughly enjoyed! After the first one, we returned to Jodie's vehicle and she had a gorgeous tray for us of cheese,  sausage,  crackers,  grapes,  olives, dips.....simply divine!!! The tour was also just the 2 of us and we loved that Jodie still did ALL of this for a tour that I believe takes up to 12 people! The next time we plan a trip to the Hill Country we are going to do one of Jodie's Beer tours!! We had such great conversations with Jodie too! Thank you sooooo much for the GREAT time! Sooooo much fun!"
            },
            {
                "author": "Kyle D.",
                "datePublished": "2016-03-19",
                "reviewRating": "5",
                "description": "Amazing tour!!! My wife and I came into Wimberley during Spring Break to relax from teaching and this was the perfect trip to do so! Jodie made us all feel like we were old friends, even though we had never met anyone else on the bus.  She was very detailed with the stories of each winery, and explained all the different varietals, answering our every question along the way. The bus was very comfortable and clean, and she stored each bottle we purchased until the trip was over, but we could have had the bottles on the bus had we chosen to.  The wineries all seemed to know her, so they were expecting us and were incredibly friendly. We were not rushed anywhere, and still managed to make it back into town to enjoy shopping on the square.  My wife and I were pretty hungry by the time we had lunch, since we didn't have breakfast, but the tapas style lunch was perfect for the glass of wine we purchased to have with it. The lunch was delicious and filling.  Overall this was an amazing experience and I will be recommending this tour to everyone I know."
            },
            {
                "author": "Samantha K.",
                "datePublished": "2019-07-23",
                "reviewRating": "5",
                "description": "The owner, Jodie, went above and beyond to make sure my birthday with 12 of my friends and family was a moment to remember and it was just that. She recommended the best of Driftwood and ended up going to Driftwood Estate Winery and Vista Brewery. We spent around 5 hours commuting, tasting, and even an impromptu cellar tour. Thanks again, Jodie! I highly recommend Taste of the Hills to everyone."
            },
            {
                "author": "Jeffrey R.",
                "datePublished": "2019-07-05",
                "reviewRating": "5",
                "description": "Jodie is an exceptional chauffeur.  We had a blast for a friend's birthday! She knew all the great stops and her ride is smooth, comfy, and had a great sound system. We had so much fun!"
            },
            {
                "author": "Sona E.",
                "datePublished": "2017-08-08",
                "reviewRating": "5",
                "description": "This wine tour with Jodie is a must.  We got Serenity Inn on a Wednesday so we were lucky to be on the wine tour with only one other couple.  Jodie is such a pleasant and inviting soul. She asked about each person's preferences as to be able to personalize the tour and pick which wineries she decided to take us too.  She is very knowledgeable of the town and the wineries.  The lunch she provides is just amazing. By the time we were done I felt like I had made an incredible new friend. I can't wait to go back and do more tours."
            },
            {
                "author": "Amber N.",
                "datePublished": "2017-08-01",
                "reviewRating": "5",
                "description": "This was such an incredible experience. Jodie picked us up at the Serenity Farm House Inn. She was so friendly and knowledgeable and super sweet. She knew all the best places to go. The picnic lunch she provided was amazing. I wouldn't change a thing about today. I would love to bring some friends and do it all over again."
            },
            {
                "author": "Brooke K.",
                "datePublished": "2016-10-08",
                "reviewRating": "5",
                "description": "Myself,  my Aunt and my cousin took Jodie's winery tour yesterday and had an absolute blast! Jodie really personalized the tour based on our taste in wines. She has an extensive knowledge of wines, the wineries, the towns, etc. Our favorite part was lunch because of the views and the wonderful spread that was provided for us. I highly recommend this tour and in fact will probably we doing it again, soon, I hope."
            },
            {
                "author": "Amber D.",
                "datePublished": "2016-06-04",
                "reviewRating": "5",
                "description": "Perfect - the highlight of our trip!  Jodie was the best, most fun, knowledgeable and coordinator.  We went to Driftwood, Duchman and Fall Creek Vineyards.  We were fortunate enough to have great people touring with us, and it made the tour all the more fun.  She prepared the best picnic lunch I've ever had.  Sugar Shack cake balls, meats, cheeses, crackers, hummus, a goat cheese something served on crackers (that I LOVED, and I hate goat cheese), spinach feta rolls, and I'm sure I'm forgetting something.  She was fully prepared for everything.  Boxes for the wine we bought, umbrellas in case in rained (it didn't), plenty of water...this wine tour couldn't have been more perfect if she tried.  Thanks, Jodie!"
            },
            {
                "author": "Charles J.",
                "datePublished": "2018-02-18",
                "reviewRating": "5",
                "description": "Jodie was amazing!  Very knowledgeable and informative.  Has some great stories and makes it very fun.  And the wineries she took us to were fantastic!  I've been to some bad wineries and the Wimberley area has a lot of options and can be daunting to do yourself.  Plus, nice to have a driver.  . Highly recommended!"
            },
            {
                "author": "Anita Y.",
                "datePublished": "2016-11-12",
                "reviewRating": "5",
                "description": "Jodie was amazing! She asked what our preferences in wine were and brought us to wineries that best fit our palate. She had a delicious charcuterie board waiting for us. Super friendly and very knowledgeable on various places in Wimberley. I highly recommend Jodie!!!"
            },
            {
                "author": "Gwen L.",
                "datePublished": "2017-08-18",
                "reviewRating": "5",
                "description": "This was a Fantastic tour. The winery's were lovely and Jodie was the perfect host. Would do it again and recommend to anyone visiting Wimberly."
            },
            {
                "author": "Amer S.",
                "datePublished": "2018-06-23",
                "reviewRating": "5",
                "description": "Jodie was an amazing host and she really made the evening perfect for my wife's 40th birthday! She took us to amazing tasting locations, she knew everyone and we received first class service. She even helped with dinner reservations! It really was an amazing evening largely due to Jodie and the exceptional service she provides! If you are looking for a fantastic wine tour, get in touch with Jodie and she will ensure that happens."
            },
            {
                "author": "Vicky W.",
                "datePublished": "2015-11-30",
                "reviewRating": "5",
                "description": "Ahhhh! So very relaxing! Jodie Meyer knew all the tourists' names and made sure we got to know each other. She provided an excellent variety of foods including a hot portion and gluten-free (just in time `cause I was lit after the 1st vineyard). The three vineyards for that day were selected based on the wine preferences of the tourists that day (A+ perk). We never felt pushed or obligated to buy wines, but we all did because they were very good (!), and Jodie kept our purchases organized and stored for us. She also gave a good background on each vineyard and on the Wimberley area in general. We learned a lot about Wimberley and wine and were able to get tipsy knowing Jodie was an excellent driver of her comfy bus. And have you been to Wimberley? That hilly countryside is beautiful!"
            },
            {
                "author": "Linz N.",
                "datePublished": "2017-04-17",
                "reviewRating": "5",
                "description": "We recently went on a fabulous wine tour with Jodie on 4/15 and had a great time!  Our tour was originally scheduled for 10:30a, but got pushed back to 1:15p due to shuttle trouble (we had the option to receive our money back, but actually liked the later time).  We stopped at three wineries, including Driftwood Estate and Duchman Family Winery.  The views at all of the wineries varied, but each were unique to their locations.  Jodie provided an amazing picnic-style lunch, including a charcuterie (meat and cheese) board, chicken salad, nuts, walnut and feta salad, grapes, chocolate cake balls, bottled water, etc. At the second stop, Jodie was kind enough to call in people's orders to Salt Lick BBQ and had it all ready to take home by the third stop.  We can't wait to return again!"
            },
            {
                "author": "Debbie V.",
                "datePublished": "2015-11-25",
                "reviewRating": "5",
                "description": "Fantastic wine tour with a knowledgable , fun and personable guide. Jodi made our first wine tour experience a memorable one. Nice travel accommodations   We went to 3 local wineries chosen by our wine preferences. She provided a great tapas lunch and even accommodated the gluten free guests.  I would highly recommend   I will be coming back and doing it again!"
            },
            {
                "author": "Haeley B.",
                "datePublished": "2016-06-16",
                "reviewRating": "5",
                "description": "Jodie was awesome! We booked her for a bachelorette weekend wine tour and had an amazing day! Each winery was set up for tastings when we arrived. The tapas lunch was delicious and came with a gorgeous hill country view. Jodie went out of her way picking dinner up for us and storing all our purchases throughout the tour. She catered the tour to the pallet of the girls. I would definitely use her again!!"
            },
            {
                "author": "Stephanie H.",
                "datePublished": "2016-04-18",
                "reviewRating": "5",
                "description": "My mother and I had the most amazing time with Jodi. She was a perfect tour guide and took us to three great wineries. She gave us a lot of background information on the wineries as well as the town of Wimberley. She had a delicious assortment of snacks for us to munch on while we rode to and from each winery. She helped package our wine purchases and brought us umbrellas as it started to rain. She even went the extra mile, literally, and drove us back to our hotel since it was raining as we had walked to our meeting spot earlier in the day. We had another couple on the tour with us which was really nice since we had people to mingle with. It was a very personal experience and I felt as though we were all just great friends spending an afternoon together. Who needs Napa, everything is better in Texas!!! We will definitely be repeat customers."
            }
        ]
    },
    {
        "name": "Texan Wine and Spirit Tours",
        "id": 648,
        "open_for_business": 1,
        "tags": [
            "Wine Tours",
            "Art Tours"
        ],
        "website": "",
        "longitude": -98.547133,
        "latitude": 30.249339,
        "address": "201 Ranch Rd 1320",
        "postal_code": "78636",
        "city": "Johnson City",
        "state": "TX",
        "telephone": "(830) 456-7682",
        "price": "",
        "hours": {
            "Mon": "9:00 AM - 10:00 PM",
            "Tue": "9:00 AM - 10:00 PM",
            "Wed": "9:00 AM - 10:00 PM",
            "Thu": "9:00 AM - 10:00 PM",
            "Fri": "9:00 AM - 10:00 PM",
            "Sat": "9:00 AM - 10:00 PM",
            "Sun": "9:00 AM - 10:00 PM"
        },
        "accommodations": [],
        "unaccommodations": [
            "No Wi-Fi"
        ],
        "rating_value": "4.5",
        "review_count": "7",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/PRxv3Zywg98XM7m652rvEw/l.jpg",
        "reviews": [
            {
                "author": "Jessica C.",
                "datePublished": "2019-02-12",
                "reviewRating": "5",
                "description": "So first....let me say that our group totally dropped the ball on planning.  We reached out to Carla 3-4 weeks before but did not confirm until the week of the wine tour.   By the grace of the \"wine\" Gods, Carla could fit us in her schedule!  She is completely open to letting you choose your places or you can follow her lead!   She picked us up at our accommodations which were several miles outside of Fredricksburg.  We did introductions and she laid out the things that were already scheduled for the day.  On our way to the first winery, we decided to \"reroute\" the tour to hit some lesser known spots.  TBH, we were excited for Carla's recommendations.    Our first stop was Six Shooter because of their variety of dry wines, sweet wines and meads.  You have to try the Jalapeno shooter!!!  SO GOOD!   Second, we made our tour time at Real Ale and did a beer tasting. Third, she realized the majority of our groups like Whiskey, so we stopped at Andalusia Whiskey in Blanco!  This place met the needs of our entire group (even the non-whiskey drinker) and was by far the most unique stop of their day!  If you go here, try the Cherry Cola cocktail!   We stopped for lunch at Pecan Street Brewing in Johnson City, where we drank lots of water and had really great food.   Our last stop of the tour was Zero815 Winery which had a cool mix of wines and friendly staff.   At the end of the day, Carla made sure that we made it back to our accommodations safe and sound.  We had the very best time and she knows some of the coolest places that you might miss without her expertise.  She was extremely professional and very down to earth.  She was always around to help with recommendations or just to snap photos of the group!     We highly recommend doing a tour with Carla and Texas Wine and Spirit Tours!   You won't be disappointed!   We'll be booking with her again the next time we are in the area!"
            },
            {
                "author": "Alejandra R.",
                "datePublished": "2020-10-26",
                "reviewRating": "1",
                "description": "I scheduled 2 group tours with Texan wine tours with more than 6 weeks in advance. The first tour was CANCELLED THE VERY SAME DAY we were supposed to go to the wineries. I traveled with a group of friends from Houston just to go visit the wineries  They also cancelled the second tour that was scheduled 2 weeks later. Our  weekend plan got ruined thanks to their lack of professionalism."
            },
            {
                "author": "Vanessa T.",
                "datePublished": "2018-04-27",
                "reviewRating": "5",
                "description": "I forgot to review this! But we did our tour with Carla in October and she was fantastic! Highly recommend.  Sending some people your way!"
            },
            {
                "author": "Haley H.",
                "datePublished": "2017-03-18",
                "reviewRating": "5",
                "description": "I cannot say enough good things about Carla and her touring company. Some girl friends and I came to Fredericksburg for a long weekend and did two back-to-back tours with her. The first tour on Friday was with another group and they had already decided to do wine so we were able to join in with them and had a blast touring the local wineries. She also took us to a local watering hole afterwards when we decided we all wanted to stay out for a bit longer. She was amazingly accommodating and super fun!! On Saturday we wanted to tour some distilleries and breweries and she helped us decide which ones were more along the atmosphere we were looking for. Carla is amazing and I can't recommend her enough!!"
            },
            {
                "author": "Stacey G.",
                "datePublished": "2015-11-12",
                "reviewRating": "5",
                "description": "I planned a bachelorette party for my best friend a few weeks ago. Leslee was amazing in setting up the perfect day for our group! She was always prompt in returning my emails and adjusting our itinerary to meet our needs. The weather wasn't the best the weekend of the tour, but Leslee made sure that we still had a fantastic time! I highly recommend D'vine Tours for a wonderful Hill Country experience!"
            },
            {
                "author": "Erin Y.",
                "datePublished": "2015-11-14",
                "reviewRating": "5",
                "description": "We had a blast! Leslee, the tour guide, is great. She knows the town and the people. The van is the nicest I've been in."
            },
            {
                "author": "Megan B.",
                "datePublished": "2015-11-25",
                "reviewRating": "5",
                "description": "My best friend and sister planned a weekend bachelorette party for me complete with a wine and art tour. The weather was pretty bad that morning, so we started a little late, but the van that they have is really, really nice, clean, and spacious. She even has a little stool in case you need help getting into the van, and she helps everyone get in and get out. We went to three places around the Johnson City area. The first one was a quick tasting, the second one we learned A LOT about wine and got a lesson in how to properly drink wine, and at the third winery we got the most interesting history lesson about President Johnson and Lady Bird Johnson from the winemaker himself. Leslee personally knows the places and owners and was just the best tour guide. One of the places on the tour where we were supposed to also eat dinner at cancelled due to the weather, but Leslee was quick to find a different place for us to go to. She took us to a cute cafe in downtown Johnson City where we ate a ridiculously good dinner. We even went to Leslee and her husband's bar at the end of the day for one last drink and got a chance to meet her sweet daughter as well. I thoroughly enjoyed the tour with Leslee and highly recommend D'Vine Tours!"
            }
        ]
    },
    {
        "name": "ThunderDome Party Bus",
        "id": 466,
        "open_for_business": 1,
        "tags": [
            "Party Bus Rentals",
            "Tubing",
            "Wine Tours"
        ],
        "website": "http://thunderdomepartybus.com",
        "longitude": 0.0,
        "latitude": 0.0,
        "address": "",
        "postal_code": "78701",
        "city": "Austin",
        "state": "TX",
        "telephone": "(512) 876-0066",
        "price": "",
        "hours": {
            "Mon": "Open 24 hours",
            "Tue": "Open 24 hours",
            "Wed": "Open 24 hours",
            "Thu": "Open 24 hours",
            "Fri": "Open 24 hours",
            "Sat": "Open 24 hours",
            "Sun": "Open 24 hours"
        },
        "accommodations": [
            "Accepts Credit Cards",
            "Accepts Android Pay",
            "Accepts Apple Pay"
        ],
        "unaccommodations": [
            "Accepts Cryptocurrency",
            "No Bike Parking",
            "No Wi-Fi",
            "Not Wheelchair Accessible"
        ],
        "rating_value": "5",
        "review_count": "12",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/a8e73O8BiV44p7Ouu2Hd_A/l.jpg",
        "reviews": [
            {
                "author": "Kristoffer K.",
                "datePublished": "2021-06-23",
                "reviewRating": "5",
                "description": "From pick up, to drop off the experience was phenomenal! Spacious, clean, and comfortable. An unplanned stop to provide a bathroom break before arriving at our destination was provided upon our request and was greatly appreciated. We ended up losing one of our group and our Driver allowed us to wait and look for them. Additionally, a phone was lost in the furniture and again our Driver provided concern, patience, and assistance in order to retrieve the seemingly stuck device. I have now ridden with this service three times and every time has been beyond excellent."
            },
            {
                "author": "Julia F.",
                "datePublished": "2021-05-31",
                "reviewRating": "5",
                "description": "We used ThunderDome over this past Memorial Day Weekend and had a fantastic experience. Daniel was incredible to work with. He was quick to provide a quote and answer any questions leading up to our trip, and was early to pick us up. 38 of us fit comfortably in the 40 person bus along with all of our belongings. The bus was clean, speakers were great, and Daniel truly went above and beyond for our group. We'll definitely be using ThunderDome for all of our future trips!"
            },
            {
                "author": "Traci S.",
                "datePublished": "2019-06-05",
                "reviewRating": "5",
                "description": "Daniel was awesome!  Right from the start he was quick to respond with a quote, details, etc.  Easy to work with and has the little extras like coolers, ice, waters, etc. that went above and beyond.  He was prompt, professional, a safe driver, accommodating and just an overall solid guy.  Would highly recommend for a group large or small!"
            },
            {
                "author": "Kristie L.",
                "datePublished": "2019-12-16",
                "reviewRating": "5",
                "description": "AMAZINGGGGG SERVICE! We looked into several party buses around the Austin area and compared quotes. Daniel beat everyone's price AND provided ice and cups when that didn't even cross our minds! THANK YOU THUNDERDOME SO MUCH FROM CAPITOL CHEVY! Definitely using your services in the future! The whole process was smooth, and overall satisfying!"
            },
            {
                "author": "Caitlyn L.",
                "datePublished": "2019-01-14",
                "reviewRating": "5",
                "description": "ThunderDome Party Bus was great - Daniel was knowledgeable, friendly and super easy to work with. Couldn't recommend him/ThunderDome enough!"
            },
            {
                "author": "Monika G.",
                "datePublished": "2019-11-05",
                "reviewRating": "5",
                "description": "I have used Daniel and ThunderDome Party Bus two years in a row and they are awesome! They're communication is reliable and fast. The morning of, he always calls to let you know he is on time and ask if there are any last minute questions. I've recommended his bus to all of my friends. Everyone has always enjoyed their experience!"
            },
            {
                "author": "Brielle A.",
                "datePublished": "2019-07-13",
                "reviewRating": "5",
                "description": "Probably the best quote I got in Austin, especially since the cost included everything we needed! They were even able to make two drop off locations for our party which was really awesome! My friends loved the inside of the bus and we had a great night out, will definitely use again in the future!"
            },
            {
                "author": "Christa E.",
                "datePublished": "2017-12-19",
                "reviewRating": "5",
                "description": "My group of 16 had an amazing time on the Thunderdome Party Bus! Daniel was super accommodating, easy to work with, and a genuinely nice guy. I highly recommend this company for your next group night out. Tip: Go ahead and book an extra hour to whatever you think you'll need - you won't want to get off at the end of the night, it's that much fun!"
            },
            {
                "author": "Sarah S.",
                "datePublished": "2018-06-21",
                "reviewRating": "5",
                "description": "ThunderDome was awesome! Tony arrived on time and supplied exactly what we were told. He even helped us set up the Bluetooth system for us to play our music. The bus was clean, cool, and ready to party! We took it to a river float for my bachelorette party and it was perfect. Tony even stopped on the way home for a bathroom break. I will definitely book with ThunderDome the next time I need a party bus."
            },
            {
                "author": "Maggie S.",
                "datePublished": "2018-01-30",
                "reviewRating": "5",
                "description": "We wanted to book a party bus to do a distillery tour. I did not have a lot of information on the distilleries and Daniel was incredibly helpful when figuring out where we should go. We had 19 people on the bus and we had SO much fun. The bus was super clean, Daniel was great and we had the best time. We originally had the bus for 5 hours but Daniel was nice enough to let us add an additional hour to our trip for just a small charge. I would recommend ThunderDome Party Bus to anyone.   We definitely want to plan another trip in the summertime to go floating.  Thanks Daniel!!!"
            },
            {
                "author": "Angelie E.",
                "datePublished": "2017-07-09",
                "reviewRating": "5",
                "description": "I booked thunderdome party bus to take a big group of us to float the river. The bus was on time, and even made accommodations to pick up a second group at a different stop. The bus itself was spacious and clean, and everyone had an awesome time! Once we were done floating, the bus conveniently picked us up at the exit of the river. I would highly recommend Thunderdome for big group parties."
            },
            {
                "author": "Martin G.",
                "datePublished": "2017-09-20",
                "reviewRating": "5",
                "description": "This review is long overdue.  I booked the Thunderdome Party Bus for a bachelor party back in May 2017.  The bus was perfect!! Seated our group of 15 comfortably.  The stereo system was bumping, and Daniel, our amazing driver, had no issue with us turning it up to 11.  Our group was most guys in their 30's and Daniel gave us good recommendations on spots to check out that were age appropriate.  In between spots, Daniel drove me to a gas station to help me restock on beer. He even came in and helped me carry and load beers into the coolers.  Great communicate from Daniel from beginning to end, and he someone found the perfect spot to pick us up on busy Rainey St at the end of the night.   Great value and great experience.  Highly recommend."
            }
        ]
    },
    {
        "name": "Discover Texas Wine Tours",
        "id": 242,
        "open_for_business": 1,
        "tags": [
            "Wine Tours"
        ],
        "website": "http://discovertexaswine.com",
        "longitude": -97.743205,
        "latitude": 30.266919,
        "address": "",
        "postal_code": "78737",
        "city": "Austin",
        "state": "TX",
        "telephone": "(512) 656-8299",
        "price": "",
        "hours": {
            "Mon": "9:00 AM - 9:00 PM",
            "Tue": "9:00 AM - 9:00 PM",
            "Wed": "9:00 AM - 9:00 PM",
            "Thu": "9:00 AM - 9:00 PM",
            "Fri": "9:00 AM - 9:00 PM",
            "Sat": "9:00 AM - 9:00 PM",
            "Sun": "9:00 AM - 9:00 PM"
        },
        "accommodations": [],
        "unaccommodations": [],
        "rating_value": "4.5",
        "review_count": "38",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/fHX2cLMlM82eH2Vp6Y5_CQ/l.jpg",
        "reviews": [
            {
                "author": "Terri P.",
                "datePublished": "2020-03-19",
                "reviewRating": "5",
                "description": "Clint was a total professional and a wonderful driver.  At our first stop he ordered a different vehicle so everyone felt more comfortable.  What a surprise when he told us!  Didn't see that coming.  Three great tastings with good friends.  Discovered some very nice 2015 Texas wines.  The grapes have matured immensely since 2008 and glad to finally enjoy some good Texas wines.   Can't recommend this company any lower than *****!  Thank you Discovery Wine Tours for a memorable afternoon."
            },
            {
                "author": "Carlin L.",
                "datePublished": "2021-04-13",
                "reviewRating": "5",
                "description": "Used Discover Texas Wine Tours for a 30th birthday. John, our driver, was wonderful. He called me a couple of days before to introduce himself and to confirm the pickup details. He also called me the day of and was on time. He made sure we were settled at each location and made it a great experience. Felt very safe - John wore a mask the whole time. Also, Kathie helped plan the itinerary. She's familiar with the wineries and distilleries in the area, and was very friendly. Couldn't recommend them more!"
            },
            {
                "author": "Lori M.",
                "datePublished": "2019-10-15",
                "reviewRating": "5",
                "description": "A.wonderdul time, from reservation phone call to driving away from the limo.once the 6.5 hour tour ended.  John was our driver...we knew from the get-go we were in good hands.  Discover Wine chose the wineries for us and all were unique, fun and obviously tasty (as was the restaurant they selected).  We'll be back!"
            },
            {
                "author": "Lynlee S.",
                "datePublished": "2020-12-21",
                "reviewRating": "5",
                "description": "Our driver John was amazing!!! Very sweet and professional. Gave excellent service and ensured my group of 2 had a great time at each location we choose. Booking with the owner Kathy was easy and she ensured the whole private tour experience was exactly what we wanted. Could not have had a better time!!! John the drive wore a mask the whole time and gave us a detailed tour of town while he drove! Excellent and safe driver. Perfect perfect perfect! Thank you!! If you want an intimate experience with lots of sights and great food and drink, chose this company to take you!!!!!"
            },
            {
                "author": "Lindsey H.",
                "datePublished": "2015-06-04",
                "reviewRating": "3",
                "description": "I was so impressed with this tour the first time we booked that I had to book it for another party! Well, this time it wasn't as impressive. I don't know if the business has just gotten bigger than the owners can handle but communication was subpar. It took several calls and emails to get answers sometimes.   At our first tour, Kathie took tons of photos and would pose us at the wineries. This tour, we had to prompt her. It was a cloudy day so not the best for outdoor pics but I was disappointed we took most of them ourselves or had to ask her to take the pictures.   Our tour was April 11, it is now almost 2 mths later I haven't received the few pictures we took. I emailed twice and have finally heard back that the SD is apparently not working. I'm not sure why I had to email to find this out, seems like this info should have been divulged as soon as the problem presented itself.   I hate to downgrade the star review but my second time with this company just wasn't as epic as the initial tour I took with them. The wineries all seem to love this company though."
            },
            {
                "author": "Jessica C.",
                "datePublished": "2020-01-27",
                "reviewRating": "1",
                "description": "I would recommend you take your money elsewhere. The owner Cathy is the rudest person to deal with  and doesn't know manners or customer service. She is unprofessional and just straight out rude. Highly suggest on another place to go to."
            },
            {
                "author": "Barbara H.",
                "datePublished": "2018-09-10",
                "reviewRating": "5",
                "description": "We had a small group of three, but did it right with a Discover Texas Wine Tour limousine. DTWT was very accommodating, scheduled the wineries we wanted to see, ordered the lunches, and then confirmed our selections a couple of days prior to our tour. At the last minute after visiting with a couple in our third stop, we changed our fourth stop to a different winery. Jason (our driver) was happy to accomodate us. My only regret is that we didn't choose a few wineries a little further out of town, so we could spend more time in the limo listening to our Willie Nelson songs. Jason was awesome, and I highly recommend this tour."
            },
            {
                "author": "Vicki C.",
                "datePublished": "2016-03-14",
                "reviewRating": "3",
                "description": "We started researching half-day wine tours for my BFF's bachelorette party several months in advance and chose this company because of its good reviews and cancellation policy (full refund up to 7 days in advance).   First, the bad news. The booking process is way more arduous than it should be. My initial discussion about the tour plans happened over the phone, so I asked for a written, e-mail confirmation of what we had discussed - specifically how the deposit and refund policies work. It took me more than three weeks to get that first e-mail confirmation of our booking and deposit payment. I then went back and forth, back and forth, back and forth with the company, hammering out the details, like setting a pickup location and our choices for the winery stops. Many times, three weeks would pass and I'd have to make multiple attempts before I would get a response to my e-mails. Sometimes, the responses would be incomplete and we'd repeat the process of trying to get information confirmed. Seriously a pain for an experience that costs $129 per person.   Now, the good news. The online payment portal for each attendee was a breeze to use and eliminated the need to handle money all through one person. As for the actual tour itself, we couldn't have asked for a better experience. Our driver, Bobby, was on time and wonderful on the day of the tour. He was funny and polite and had good knowledge of the area. Also, very importantly, he was a good and safe driver! The Mercedes bus we took was very clean and spacious, and they provided water, cups and napkins. They also allowed us to bring our own food onto the bus. The three wineries we visited, Driftwood Estate, Duchman and Fall Creek, were all accommodating and fun. The views were lovely and we never felt rushed and made it back on time. It was raining when we got back to our car, and Bobby was so nice and helped us get our stuff back into our car in the pouring rain.   All in all, despite a wonderful wine tour, I'm not sure I would recommend this company, only because I spent way too much time hounding them throughout the booking process. While the wine was excellent, I NEEDED to drink after dealing with their horrible communication. Discover Texas Wines should strongly consider re-evaluating their communication practices and hire more people to keep up with the demand for their service. It's the only way they will stay competitive in the long-run!"
            },
            {
                "author": "Tara K.",
                "datePublished": "2019-10-14",
                "reviewRating": "5",
                "description": "We had an excellent experience with Discover Texas Wine. Kathie was wonderful to coordinate with, and took care of all our tour requests. Howard was a great driver and had fun music. Lunches were very tasty. Would definitely recommend for any bachelorette party."
            },
            {
                "author": "Abby S.",
                "datePublished": "2019-04-06",
                "reviewRating": "5",
                "description": "We had the BEST time today on a wine tour for a bachelorette!! \"Magic Mike\" was the best driver and so much fun. Very reasonable price for the amount of time we spent, and an awesome car. Thank you!!!"
            },
            {
                "author": "Katie B.",
                "datePublished": "2015-07-01",
                "reviewRating": "5",
                "description": "We booked a wine tour to Dripping Springs for my bachelorette party. It was so great! Our driver, Roy, is what made it all so wonderful! I would highly recommend him!! He took lots of photos for us and kept us cool with cups of water.  We went to Driftwood Estate (beautiful views and grounds), Duchman family winery (beautiful Tuscan architecture), and Driftwood (had the best wines!). We did a half day and it was the perfect amount of time.   Couldn't have been any better! Thanks Roy!!!"
            },
            {
                "author": "Cyn H.",
                "datePublished": "2018-02-17",
                "reviewRating": "5",
                "description": "Had a great time on my stretch limo wine tour.  Hawk's Shadow was the favorite of the wineries we visited.  Bobby was our driver. Polite and helpful and knew to not be too chatty. Made our wine tour effortless and fun. An event to remember!"
            },
            {
                "author": "Carly J.",
                "datePublished": "2019-01-23",
                "reviewRating": "5",
                "description": "Wonderful private winery tour with Amanda.  So much fun!  Amanda was awesome and knowledgeable.  We had a great time!"
            },
            {
                "author": "Calley N.",
                "datePublished": "2016-07-31",
                "reviewRating": "4",
                "description": "We used this company for  a bachelorette weekend the company was extremely hard to work with. Communication with the company was extremely difficult. However, Mike (magic mike) completely turned a ruined weekend around. He was so nice and fun he sang to us and played guitar. I have never met a more generous and kind person. It might take you sending 3 emails to get responses from the company but definitely use Mike for your tour!"
            },
            {
                "author": "Kate E.",
                "datePublished": "2015-09-27",
                "reviewRating": "5",
                "description": "First off our driver, Roy, was the absolute best! He picked us up on time, was incredibly friendly, and funny even though we were a bachelorette party and knowing the possibility of it getting crazy with 7 girls. Seriously, request Roy. He made the trip a blast. There was cold water for us in the bus. Oh did I mention it's a Mercedes bus? Super nice! An AUX cable was available to play our own music too. The selection of wineries was amazing, perfect mixture between red and whites/dry and sweet, so every one of us could have something tasty. The drive was beautiful and not too far out of Austin. Overall, I am very impressed with this tour and the wonderful employees. Would definitely go again."
            },
            {
                "author": "Jessica J.",
                "datePublished": "2014-03-10",
                "reviewRating": "5",
                "description": "I booked a Discover Texas Wine Tour last weekend for a Bachelorette Party. It was amazing! We had such a great time despite the somewhat unpleasant weather. Noel was so great and answered any questions we had before the tour. He was so accommodating and recommended some great wineries to us! I would definitely book with them again and recommend them to friends!!"
            },
            {
                "author": "Becca R.",
                "datePublished": "2015-08-18",
                "reviewRating": "4",
                "description": "Held an event with Discover Texas Wine Tour for my business and wanted to thank them again for a wonderful day. We booked this as part of a fundraiser/auction and it was such a success. The bus was wonderful, the driver was great and everything was timed perfectly. Highly recommend Discover Texas Wine Tours!"
            },
            {
                "author": "Dominique S.",
                "datePublished": "2017-03-20",
                "reviewRating": "1",
                "description": "Absolutely do not recommend using this company. I made the reservation back in January, gave my card for deposit and was told I'd be emailed a link for everyone to pay. Over the next two months I called and emailed asking about the link so my friends could pay their part and I was repeatedly told they were having issues. Okay fine, no big deal- I also emailed again saying we can just pay the day of if the link wasnt working and never received a response. The day before our tour, as I was driving from Dallas to Fredericksburg I get a call from Some guy at the company and he seemed very annoyed with me saying no one had paid yet. Um.. I'm sorry I didn't realize you finally sent it after months of my asking. (He had sent it the day before calling me to tell me no one had paid) The vehicle I requested was not the one that showed up. The driver Julia was late bc she did not write the address down correctly. We also had 3 girls cancel last minute, so we were down to 5 instead of 8. Considering there minimum is 5 I wasn't expecting that to be a problem but Julia felt the need to bring it up multiple Times as if it caused some inconvenience for her. Rude people, horrible communication."
            },
            {
                "author": "Kyle D.",
                "datePublished": "2016-08-28",
                "reviewRating": "5",
                "description": "We had a great time on our full day tour! None of our group had been to the Texas wine trail, and our Driver Roy was absolutely spot on picking our 4 stops. Roy was a true gentleman and really took good care of our group all day long, making this a truly great experience. Noel was very helpful in booking us, even with a last minute addition to our party. I will be using these guys again in the future, and would recommend anyone who is looking for a first time trip to do the same."
            },
            {
                "author": "Holly T.",
                "datePublished": "2013-03-26",
                "reviewRating": "5",
                "description": "What a fantastic time! Organizing a full day wine tour for 50 people in the Texas Hill Country may not sound like an easy task, but Noel at Discover Texas Wine Tours made it smooth and most importantly, unforgettable. His main goal is to make sure everyone is comfortable and has a good time! Most companies were not able to host a group this size, but Noel made it happen. He made sure our bus was the best he could find, worked to have a lunch catered for us at one of the stops, set up private tastings with many of the wineries to accommodate a group our size, even stopped to let one of the guys who didn't drink wine buy some beer. I can't say enough good things about Noel and how hard he worked for our group. I highly recommend him and look forward to another tour with him soon!!"
            }
        ]
    },
    {
        "name": "Austin Nites Party Bus",
        "id": 349,
        "open_for_business": 1,
        "tags": [
            "Party Bus Rentals",
            "Wine Tours",
            "Boating"
        ],
        "website": "http://www.austinnitespartybus.com",
        "longitude": 0.0,
        "latitude": 0.0,
        "address": "",
        "postal_code": "78750",
        "city": "Austin",
        "state": "TX",
        "telephone": "(512) 709-4391",
        "price": "",
        "hours": {
            "Mon": "Open 24 hours",
            "Tue": "Open 24 hours",
            "Wed": "Open 24 hours",
            "Thu": "Open 24 hours",
            "Fri": "Open 24 hours",
            "Sat": "Open 24 hours",
            "Sun": "Open 24 hours"
        },
        "accommodations": [
            "Accepts Credit Cards",
            "Bike Parking",
            "Free Wi-Fi"
        ],
        "unaccommodations": [
            "Accepts Cryptocurrency",
            "Not Wheelchair Accessible"
        ],
        "rating_value": "3.5",
        "review_count": "15",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/edhaGSMfrQZNCYOMHCG6Tw/l.jpg",
        "reviews": [
            {
                "author": "Orlando L.",
                "datePublished": "2017-03-15",
                "reviewRating": "5",
                "description": "Had a really great time, would definitely recommend. They did a great job with the event and everything went very smoothly and the price was way better than most other services."
            },
            {
                "author": "Mackenzie W.",
                "datePublished": "2019-11-20",
                "reviewRating": "1",
                "description": "I rented a party bus through this company a couple weeks ago. In the beginning, Robert was extremely accommodating and friendly. And our driver, Terrell, was great. We got dropped off at COTA for a show and had a great time!  But where it turned south was at the end of the night. I texted our driver 30 minutes before we needed to be picked up (like he requested) and he said no problem. Then we left the concert and were walking to the pickup spot where I gave him a call. He said he got in an accident but would only be 20 minutes and I said that's fine. 20 minutes roll by and I gave him a call again, no answer, but texted and said it would be another 20 minutes. We ended up waiting in the cold for almost an hour and well after most people had left COTA. Multiple people in our party ended up just taking ubers because they didn't want to wait. The whole point of a bus is so you don't have to wait.  The next day, I texted Robert saying we would like a refund for the extra hour we paid for waiting that we wouldn't have used if we had been picked up on time. He said he would call to discuss but never did. I've now sent him multiple emails - mind you, being incredibly nice about it. All I asked for was an hour refunded back - not the whole thing, not even half. But still no response.  The customer service level of this company is terrible should anything go wrong. So hire them at your own risk."
            },
            {
                "author": "Neesh S.",
                "datePublished": "2017-02-17",
                "reviewRating": "5",
                "description": "Apologies for this review being so incredibly late but Austin Nites was the best! We had rented a party bus on pretty short notice to take a Bachelor Party to and from Lake Travis and Robert and team were amazing.   It was also Prom weekend so the schedule was packed for them but they still took care of us and worked with our schedule.   Our boat ended up staying out on the water longer than scheduled which through our plans all over the place and Robert was there waiting on time. Given his packed schedule, the driver did have to leave without us but Robert made sure to get me in contact with another service and they sent a bus over right away.   All in all, it was an incredible experience!"
            },
            {
                "author": "Snl H.",
                "datePublished": "2019-07-28",
                "reviewRating": "2",
                "description": "For $700+ for four hours we would have expected a better looking bus. Multiple dents around outside of bus. The AC barely working. Missing panels inside of bus missing or duct tape together.  Another party bus parked next to the one we had and it was so obvious how terrible looking our bus looked.   Can't believe owners would let this bus represent their company. Hope they use our $700 toward getting it fixed.   Driver was pleasant."
            },
            {
                "author": "Michael H.",
                "datePublished": "2017-11-29",
                "reviewRating": "5",
                "description": "Fist off I'm hyper paranoid about drinking and driving so I usually use Uber, Lyft etc to get around town when I wanna go out and when I'm probably going to have a few drinks! But how is that supposed to work when you have a huge group? I called austin nites party rentals for a few reasons 1. I love puns and 2. I'm am austinite and 3. My group was over ten people and we wanted to go out and have nothing to worry about. Great party bus, great personable driver, great experience definitely reccomend these guys!! DONT DRINK AND DRIVE!! Call someone you can trust call Austin Nites!!"
            },
            {
                "author": "Charli R.",
                "datePublished": "2018-08-10",
                "reviewRating": "1",
                "description": "I'm incredibly frustrated with this business.  We had spoken a couple times in the months before I decided to book and I initially felt great about potentially booking with these friendly people.  When it came time to book I called them and was told, once again, that our requested date was open and we talked out an agreement.  The owner tells me we're good to go, and that all he needed me to do now was to send him my information so that he could get a contract sent that same day.  I'd explained to him that I was booking this bus ride to and from a party boat, and that I would be booking with them that day as well.   SO, I get off the phone and send my info.  I call my party boat folks to let them know I've just confirmed my bus, and I'm ready for a boat.  I book with them based on my discussion with these guys and put down $400 to hold our reservation.  It's been two weeks since I last spoke with this company and they have ignored my calls, texts, voicemails trying to figure out why the contract hasn't come through.  Our event is next month, and at this point I've been researching new solutions, and unfortunately the new solution means I can't use the same boat company, and therefore I've lost my $400 deposit.  I did not have this money to lose, but after being ghosted by this company I guess I have to take the loss and move on.  They seem like nice people, and it takes A LOT to get on here and write a negative review, but this has caused me a lot of stress and I want to prevent this from happening to anyone else.  I hope at some point I find out a reasonable explanation and can revise this review, but not counting on it.  We'll see I guess."
            },
            {
                "author": "Horacio R.",
                "datePublished": "2015-07-08",
                "reviewRating": "5",
                "description": "BOOK WITH THIS COMPANY!  Robert did a solid job taking me and a bunch of my friends to Lake Travis and back on July 4th. His price was WAY lower than other companies I called, being the ONLY one that actually sticked to his regular prices during this busy day. He arrived early and was 100% responsive to my emails and phone calls. He arrive early to pick us up and was extremely friendly and professional. He helped us carry our coolers and accommodate everything on the bus.  The bus itself is amazing. Seats are stacked in two rows facing each other, which is great for dancing and socializing, since you are actually facing half of the crowd. The sound system is also very good. I almost feel that the bus trip was even more fun that the boat.   In summary, Austin Nites Ent. is the best on price/quality, Robert and his wife are responsive, professional and friendly, and the whole experience I had with them is positive. Would highly recommend anyone to use it, and will definitely consider using them again if I ever need to.  Thank you guys!!!!!"
            },
            {
                "author": "Lisa K.",
                "datePublished": "2017-11-01",
                "reviewRating": "5",
                "description": "What a great experience!  Driver was super awesome, the speakers were great and the bus was clean!!!!  We will definitely use them again!"
            },
            {
                "author": "Jerrod G.",
                "datePublished": "2018-09-04",
                "reviewRating": "1",
                "description": "They call you and say the bus is available and ask for a deposit over the phone.  But when we asked for a contract they go dark and won't respond. Their reviews are all their friends so not sure if this is a legitimate small business or not. There is another review on Facebook similar to our situation and she confirmed to us they went dark on her too."
            },
            {
                "author": "Laura M.",
                "datePublished": "2017-07-24",
                "reviewRating": "5",
                "description": "Great experience with Austin Nites! Robert and Melissa were super helpful, accommodating, on-time (actually, early) and friendly! Would definitely use again."
            },
            {
                "author": "A H.",
                "datePublished": "2018-01-17",
                "reviewRating": "5",
                "description": "I have used Austin Nites for the last 5 years and Robert the owner does not disappoint. They are punctual, courteous and very reasonably priced. We have had many fun events on the Big Blue Bus (UT games, holiday and birthday parties) and Robert always comes away with new clients. I highly recommend Austin Nites for any event that requires transporting a group. The bus ride will be the best part of your event!"
            },
            {
                "author": "David A.",
                "datePublished": "2014-02-26",
                "reviewRating": "5",
                "description": "I was down in austin with 19 other guys and we needed transportation for the entire night.  Robert was a great communicator before we got to austin and before he picked us up.  He was 15 minutes early, and had the bus stocked with ice, etc.  The bus was really nice, and perfect for a night out on the town.  Would definitely use this service again!"
            },
            {
                "author": "Emily W.",
                "datePublished": "2016-04-22",
                "reviewRating": "5",
                "description": "For my daughters birthday/last school dance we booked service with Austin Nites Party Bus.  From booking the ride up until the end of the night everything went as planned.  Our driver, Jared, was professional and so great to the girls and I during the time he drove us around.  The owners, Robert and Melissa, promptly returned my calls/texts with any questions I had before the night of the booking. The fee for the evening was wonderfully priced compared to other companies I had called around and gotten quotes from.  I highly recommend Austin Nites Party Bus based on my experience with them."
            },
            {
                "author": "Sybil E.",
                "datePublished": "2015-04-20",
                "reviewRating": "5",
                "description": "We rented a party bus from Robert for my brother's 30th birthday. They were one of the only companies I found that didn't increase their rates because of prom season. I called about 10 other companies looking for fun and safe travels with almost all of them being ridiculously overpriced to take advantage of the prom goers. Robert was very accommodating, professional, and had awesome rates. He called two days before the scheduled time of arrival to check in and verify everything was still good to go. He asked if there were any changes in the amount of people and offered a bigger bus just in case. Our drivers, Patrick and Joe were awesome! Patrick called me early the day of to verify everything and let me know he'd be there at 8 and then called again when they were almost to our pickup location. They arrived right on time with an awesome bus just for us. He had coolers with ice, a flat screen tv, music system, AC and even a bathroom in the back. What more could you ask for? Part of the evening was spent at Graham's Central Station in Pville. We didn't realize prior that Graham's doesn't serve food anymore and had to order pizza to the bus. Patrick gladly retrieved our pizza and brought it to us when it arrived. We all had a blast, felt safe and were taken care of. Highly recommend Austin NItes and shout out to Patty PartyWagon, if you had a Yelp page, I'd write a review for you too."
            },
            {
                "author": "Ryan W.",
                "datePublished": "2014-07-02",
                "reviewRating": "1",
                "description": "WARNING: We had a tight deadline to get to Lake Travis and the bus driver was 30 minutes late.  We had to take another bus or risk missing our charter.  He verbally offered to refund my money for his tardiness and then kept my funds and would not return them.  Now I am fighting to get those funds back.  LOOK ELSEWHERE."
            }
        ]
    },
    {
        "name": "Cool Bus Atx",
        "id": 584,
        "open_for_business": 1,
        "tags": [
            "Bus Tours",
            "Party Bus Rentals",
            "Wine Tours"
        ],
        "website": "https://cool-bus-atx.business.site",
        "longitude": -95.488268,
        "latitude": 29.062037,
        "address": "",
        "postal_code": "77566",
        "city": "Lake Jackson",
        "state": "TX",
        "telephone": "(832) 740-2665",
        "price": "",
        "hours": {
            "Mon": "Open 24 hours",
            "Tue": "Open 24 hours",
            "Wed": "Open 24 hours",
            "Thu": "Open 24 hours",
            "Fri": "Open 24 hours",
            "Sat": "Open 24 hours",
            "Sun": "Open 24 hours"
        },
        "accommodations": [],
        "unaccommodations": [
            "Accepts Credit Cards",
            "Accepts Cryptocurrency",
            "No Wi-Fi"
        ],
        "rating_value": "5",
        "review_count": "3",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/3r7MqtbZ89XW-8U6ZcAEuw/l.jpg",
        "reviews": [
            {
                "author": "Vinny P.",
                "datePublished": "2017-09-24",
                "reviewRating": "5",
                "description": "Great service! We did a brewery and distillery tour with Cool Bus ATX yesterday. Sam is the owner/driver and one thing she provides is unbelievable customer service. She's extremely easy to work with, provides a fun atmosphere on the bus and is very reasonable priced. I would highly recommend this service to anyone who's looking to get a group of friends together and tour around Austin."
            },
            {
                "author": "Edwin T.",
                "datePublished": "2017-06-06",
                "reviewRating": "5",
                "description": "We had a 12 man bachelor party in Austin during Memorial Day weekend. The day we spent riding around in Cool Bus ATX was the absolute highlight of the weekend. Sam, the owner and driver, was unbelievable. Very accommodating, great driver, and super chill.   We planned to hit up the Salt Lick on the party bus and then venture around to some breweries afterwards. Sam made sure that the group got where we needed to be on time, had great suggestions for breweries, and made sure we were having as much fun as possible.  The bus is great. Fit everyone comfortably with enough room for a cooler in between all of us. Sam had her playlist turned up or she would hand over the AUX cord and we could play our tracks as loud as we wanted. The whole experience was incredibly laid back and worry free. I would absolutely recommend Cool bus ATX to anyone that wants to have a great time with a big group in Austin.   On a side note, if it is Sunday, make sure that you buy beer on Saturday because they don't sell it on Sunday before noon.   Thanks again, Sam!"
            },
            {
                "author": "Bailey S.",
                "datePublished": "2017-03-26",
                "reviewRating": "5",
                "description": "We just got back from an amazing weekend with Cool Bus ATX!! Sam, the owner, is very sweet and accommodating. The bus itself is awesome - lights, music (you can play your own music too!), plenty of seating, very well maintained and clean. Would recommend to everyone. Thanks again Cool Bus ATX!"
            }
        ]
    },
    {
        "name": "All About Central Texas",
        "id": 38,
        "open_for_business": 1,
        "tags": [
            "Food Tours",
            "Wine Tours"
        ],
        "website": "http://www.allaboutcentraltexas.com",
        "longitude": 0.0,
        "latitude": 0.0,
        "address": "",
        "postal_code": "78749",
        "city": "Austin",
        "state": "TX",
        "telephone": "(512) 784-2426",
        "price": "",
        "hours": {
            "Mon": "9:00 AM - 5:00 PM",
            "Tue": "9:00 AM - 5:00 PM",
            "Wed": "9:00 AM - 5:00 PM",
            "Thu": "9:00 AM - 5:00 PM",
            "Fri": "9:00 AM - 5:00 PM",
            "Sat": "9:00 AM - 5:00 PM",
            "Sun": "9:00 AM - 5:00 PM"
        },
        "accommodations": [],
        "unaccommodations": [],
        "rating_value": "5",
        "review_count": "2",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/SdmIV8ulMhUwNGJF4VVicA/l.jpg",
        "reviews": [
            {
                "author": "Shani S.",
                "datePublished": "2017-01-08",
                "reviewRating": "5",
                "description": "What a wonderful time!  As a bachelorette \"day party,\" we gathered together and hopped in the super roomy and comfortable All About Central Texas SUV and headed out on our journey.   Kim is extremely knowledgeable about each winery; the history, the best wines to try, the \"wine club\" or other bonus things each winery has.   We stopped in on 3 different wineries and Kim had made superb choices in each spot; from the wines to the view to the suggestions on what to try and how to make the most of our samples so everyone could try as many as possible (thanks for that tip, Kim!).   Be it an afternoon with a group of friends, or a romantic day for two, All About Central Texas is an outstanding choice.  Thanks for everything, Kim!"
            },
            {
                "author": "Donna D.",
                "datePublished": "2016-09-08",
                "reviewRating": "5",
                "description": "All about Central Texas was really great- Kim was so knowledgeable about the area and had great info on wine and Texas! I did the Fredericksburg tour and based on my wine preferences she had some great suggestions on which ones to stop in, there are so many! I even joined a wine club, the tastings were informative and she is just a lot of fun and I didn't have to worry about driving or directions and could enjoy the pours and some snacks.  I highly recommend All abt Central Texas tours, they are personable, you can really get to meet the others in these small groups- Thanks so much!"
            }
        ]
    },
    {
        "name": "Save The World Brewing",
        "id": 5,
        "open_for_business": 1,
        "tags": [
            "Breweries"
        ],
        "website": "http://www.savetheworldbrewing.com",
        "longitude": -98.265235,
        "latitude": 30.617741,
        "address": "1510 Resource Pkwy",
        "postal_code": "78654",
        "city": "Marble Falls",
        "state": "TX",
        "telephone": "(830) 637-7654",
        "price": "Moderate",
        "hours": {
            "Mon": "3:00 PM - 6:00 PM",
            "Tue": "3:00 PM - 6:00 PM",
            "Wed": "3:00 PM - 6:00 PM",
            "Thu": "3:00 PM - 7:00 PM",
            "Fri": "3:00 PM - 7:00 PM",
            "Sat": "12:00 PM - 6:00 PM",
            "Sun": "Closed"
        },
        "accommodations": [
            "Staff wears masks",
            "Many Vegetarian Options",
            "Accepts Credit Cards",
            "Accepts Apple Pay",
            "Moderate Noise",
            "Private Lot Parking",
            "Bike Parking",
            "Dogs Allowed",
            "Wheelchair Accessible",
            "Gender-neutral restrooms",
            "Women-owned",
            "Open to All"
        ],
        "unaccommodations": [
            "No Takeout",
            "Accepts Android Pay",
            "Offers Catering"
        ],
        "rating_value": "4.5",
        "review_count": "51",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/mNEJ4WUGrtgHdZDy0Mxycg/l.jpg",
        "reviews": [
            {
                "author": "heather g.",
                "datePublished": "2022-03-19",
                "reviewRating": "5",
                "description": "Save the world brewing is filled with the happiest and most passionate staff! The beers were all great, especially the coco lux!  Our only constructive feedback is that there was a huge crowd of people and lines to get beer were very long. Chatting with other customers in line, we wondered if the two other windows could be turned into ordering stations (where there is only one ordering window outside now).  LOVE the philanthropic edge!  Also love the family friendly environment with games and playscape."
            },
            {
                "author": "Les F.",
                "datePublished": "2022-01-30",
                "reviewRating": "5",
                "description": "This is SO MUCH MORE than a brewing company.  It is THE social gathering place of the Texas Hill Country. Yep.  Folks come to visit or become members from Austin, Spicewood, Bertram, Burnet, Lampasas, Horseshoe Bay, San Antonio, Johnson City, Blanco and Kingsland and . . . . . .  When vaca/day-cationers are nearby, they love to stop in here as they, like everyone else, are treated like valued-friends and family.  Dr. Qyuinh and Dr. David (two early-retired physicians) will remember you after one visit and so will many of the others they attract - staff AND guests.     Now, about their ales.  If you don't find one you love, you don't like ales.  Even my wife, who does NOT like beer, told that to Qyuinh and guess what?  Qyuinh told her she'd find one she likes.  Now she likes TWO; so she has choices!  My Favs are the Scotch Ale (Bonus Pastor) Bo (Belgian style double milk chocolate stout with Vietnamese cold brew coffee and hazelnuts).  Check out their menu at https://savetheworldbrewing.com/ .     As we are members, we get a free pour with every new release (every couple weeks). And with our membership we get our own autographed glass which they keep for us and provide sterile drinks when we're there.  Also with our membership we get a free kool T-shirt.  Yes!  We get another with each annual renewal.       Oh, and did I mention ALL their profits go to charity?  The tip jar goes to local charities, like Habitat projects, or The Crisis Center.  And their profits go to charities across the world, like to the victims of military coups in Africa or flood victims in New Orleans.  When the C-19 Pandemic hit NYC, they sent thousands of masks to hospitals there.  And on and on. . . . .       Enough already.  This is a wonderful venue with wonderful folks.  When you're in the area, check it out!"
            },
            {
                "author": "Mark F.",
                "datePublished": "2021-02-04",
                "reviewRating": "5",
                "description": "We have been intending to drive out to this brewery since we tasted one of their beers at a local tap house. so we made the drive and we're not disappointed in the selection of beers and at the location of the brewery which is outside of marble falls on its own property. The patio area was very large the service was great and the selection of beers was wonderful. we love visiting this place and was extra happy about the fact that it is a non-profit and gives back to the community. if you're wanting to have a nice little day trip out to marble falls to visit this place pick a nice sunny day bring the kids along cuz there's things for them to do out there too and let the adults have some good adult beverages."
            },
            {
                "author": "Kimberly S.",
                "datePublished": "2021-10-06",
                "reviewRating": "5",
                "description": "We loved the vibe here! Tips are donated to charity and believe me, they've supported lots of agencies with over $230,000 in donations. We arrived within an hour of closing and were treated wonderfully. The bartender helped us select a flight and upon closing our tab, she treated me to a taste of Coconut Lux which wasn't part of my flight. Save the World is a completely inclusive space and is considerate of pandemic related issues. The inside space is reserved for vaccinated guests and was an enjoyable place to enjoy our selections."
            },
            {
                "author": "Todd H.",
                "datePublished": "2021-12-19",
                "reviewRating": "5",
                "description": "Had to stop at the brewery as the name was great and we needed a cold pop.  Discovering that profits go to charity was inspiring.  Liked the place out on their own land and sat on the porch enjoyed a beer and some good conversation with a local.  We were visiting from Wisconsin and it was interesting learning about the brewery and the local sites while we were at STW.  Since I am more of an IPA guy and my wife a stout person their beer wasn't our overall cup of tea.  However, as mentioned above we did enjoy our time there and had to get a couple of shirts, hats etc. to support them and the cause. Definitely a recommended place to stop if you are in the southern hill county outside of Austin."
            },
            {
                "author": "Rick B.",
                "datePublished": "2021-10-09",
                "reviewRating": "5",
                "description": "Fun place with good beer and a great mission. Proceeds over cost are donated to charity. If it seems pricy you are just giving to a good cause."
            },
            {
                "author": "Courtney R.",
                "datePublished": "2021-09-26",
                "reviewRating": "5",
                "description": "Finally able to stop in after following on fb for awhile.  Wonderful brewery location, staff and customers!   I enjoyed my flight and my husband had the seasonal pumpkin and peach saison.  Truly enjoyed each one and look forward to returning"
            },
            {
                "author": "Nicholas B.",
                "datePublished": "2021-04-25",
                "reviewRating": "4",
                "description": "Such a fun brewery and set up for community gathering. There are food trucks and all kinds of activities and plenty to do. There's covered seating and seating that put you in the sun in a nice way. The copy selections are really tremendous. And we love that the brewery is a nonprofit supporting valuable causes."
            },
            {
                "author": "Jackie C.",
                "datePublished": "2021-01-16",
                "reviewRating": "5",
                "description": "First timers my fiancé and I decided to check them out,l. The brick oven pizza was deliciously amazing. Customer service was great. Surprisingly the peppermint stout was pretty good. My favorite was the lager."
            },
            {
                "author": "Ronda A.",
                "datePublished": "2021-05-18",
                "reviewRating": "5",
                "description": "What an amazing experience! The beers were fanominal and Liegh was amazing. She picked us a flight that fit us to a tee. The atmosphere was warm, inviting and extremely friend."
            },
            {
                "author": "Jen H.",
                "datePublished": "2020-12-09",
                "reviewRating": "5",
                "description": "We were doing a beer tour from Fredericksburg on the way home to Georgetown and this is one of our stops and absolutely loved it! Everybody we met was so friendly, they give you fresh popcorn with your beer, the beer is delicious, you get to keep your glass and a percentage of their sales goes to charity! What else can you ask for!? One of the best breweries I've ever been to hands down! I'm so happy we found it and we plan on visiting often and bringing our pups with us next time. Check it out, you won't be disappointed."
            },
            {
                "author": "Charly T.",
                "datePublished": "2021-01-24",
                "reviewRating": "5",
                "description": "Gwen and the ladies are great!  Great beer. The stout and the Belgian are great beers. Fun atmosphere."
            },
            {
                "author": "Calily B.",
                "datePublished": "2017-06-18",
                "reviewRating": "3",
                "description": "Ever since STW has been putting out beers, I can't say my boyfriend and I ever really buy any of their beers when we're out and about. None of their mainstays have ever really been standouts and in this cramped market, your beers have to be good and clean. That being said, we've been wanting to check out their taproom/brewery and it finally came to be when we spent a night out in Marble Falls.  Since the taproom is only open on the weekends, it was busy on a Saturday afternoon. It appears a lot of locals come here, which is GREAT! Families, couples, it's a great space for everyone. The taproom itself is air conditioned but if you want more seating, the warehouse space in the back is setup with extra picnic tables--just no a/c back there. There was a food truck out front in case you get hungry.  We went with a tasting paddle with a couple of their mainstays and the rest were their seasonals. The pricing is just right (about $1-$2/tasting).   Almost everything we tasted was phenolic (band-aid tasting-ish). The only thing that we could really drink was the wit, peach saison and our favorite was the Flanders red. The Flanders red was a great sour that fit to style and no off-flavors!   I want this place to do well because the owners are SO NICE (I mean, she's Vietnamese, so I obviously support my peeps) and I love what they're about -- but they need to fix their brewing process to get cleaner beer. All of our homebrew friends that have been here have had the same experience with the beers, so we're not alone.   If they can fix that, I might consider buying their beers when I'm at a bar, but otherwise, I just can't."
            },
            {
                "author": "Rich G.",
                "datePublished": "2017-11-25",
                "reviewRating": "5",
                "description": "When in Marble Falls check this place out. Our daughter is a member of their mug club.   The owners give back to the community- some of the profits help fund local projects.   Love having BBQ. (See attached photo). Small place - friendly owner Plus excellent BBQ.   Save The World is only open Friday and Saturday. But you can buy their beers at many local restaurants."
            },
            {
                "author": "Paul M.",
                "datePublished": "2020-07-03",
                "reviewRating": "5",
                "description": "Very nice people and great beer!   20$ for a 6 pack 2 Koozies, an opener and a bag of pretzels!   Express lunch!   BOOM!"
            },
            {
                "author": "Irma I.",
                "datePublished": "2018-03-11",
                "reviewRating": "1",
                "description": "This place was so highly talked about by one of my husband's coworker that is had been added to our list. They could not say enough about it - they even talked about making it a road trip. Marble Falls is a little over an hour and a half from San Antonio. So Saturday came and it was a perfect day for hubby and I to go check it out- we had no plans, it was sunny and early.   We got there a little after 1pm and well...I didn't get it. I mean the hype that was so over the top - I just expected something out of this world.   Yes there are a few picnic tables out front on a hill and the obligatory kids jungle gym (at a bar nowadays) -there was no one there but I thought- wow, if there really would be kids (little ones), I could see them tumbling down the hill and not in a fun way.   Once inside I realized this is not what we had in mind. It's lovely for sure. Old wine barrels as a few tables, a sectional and another sofa and a larger table right next to the bar. Because of all of this furniture, it makes it hard to get to the bar to order.   The staff was nice and knowledgeable - we ordered one of the flights and that included a stout, quad, dubbel, cherry, barley wine, and something else - fine beer but not fantastic. Staff let us know there was free pop corn out in the brewery side. - apparently they sometimes have a food truck but not today. They had more tables with some games with the door opened to the outside which made for a nice breeze. We did get some popcorn but it was so salty that I felt I was just eating salt.   We looked around for other places in the surrounding area and there was nothing appealing via my yelp app. We thought about going to Austin but is is over an hour drive.  I had envisioned Jester King-like place but it was far from this.   We left after our one flight - another 1 1/2 hour drive back home. I think that is part of the challenge- you know if you are somewhere off I-35 you can always drive 15 min and find somewhere else to try. Here? You are pretty limited."
            },
            {
                "author": "Christie A.",
                "datePublished": "2017-12-14",
                "reviewRating": "4",
                "description": "How can you not like an establishment that gives back?   From the moment you drive up, you can just tell it's going to be a wonderful day. The brewery sits atop of a hill in a serene scenic area, and as you enter you're warmly welcomed by locals, tourists, and experienced brewman to help you pick the most delightful beer.   I definitely recommend the Wit if you're looking for something light and crisp. The brewery then opens up to a second floor seating area filled with picnic benches, tall standing machines, and yummy popcorn machine popping away.   We spent the afternoon playing jenga, and took in the outside to have a few games of corn hole. If you're in Marble Falls, this is a definite must."
            },
            {
                "author": "Katherine S.",
                "datePublished": "2017-12-02",
                "reviewRating": "5",
                "description": "We dropped in for a flight and stayed for hours. The owners know and love good beer and it shows.  They were welcoming and informative hosts.   We were headed to Dallas with our dogs and were able to bring them in the brewing area so we were able to stay longer than we initially expected.   If we lived closer we would be regulars.  I don't know when I enjoyed a brewery more. The place was full when we left as well and they attract a happy, friendly crowd.  Also free popcorn so there is that.  Smart. Makes me want to wash it down with more beer."
            },
            {
                "author": "Diron K.",
                "datePublished": "2017-07-23",
                "reviewRating": "5",
                "description": "We met some friends here and were glad we did. This place seems to have a beer for everyone, which all breweries should in my opinion. The first beer is $6.50, but comes with the glass, so your next beer is just $3:50 for the refill. It also has an air conditioned section so you can enjoy your beer in these hot Texas summers. It amazes me at how many of these breweries aren't air conditioned. This is a very cool brewery that we will definitely visit again."
            },
            {
                "author": "Kristina C.",
                "datePublished": "2019-10-12",
                "reviewRating": "5",
                "description": "Went in on a Saturday around 1:30pm. A few other groups, but a nice calm vibe. The staff was really friendly, and very helpful. Lots of choices for different palates. Enjoyed it!"
            }
        ]
    },
    {
        "name": "Bear King Brewing Co.",
        "id": 288,
        "open_for_business": 1,
        "tags": [
            "Breweries",
            "Burgers"
        ],
        "website": "https://www.bearkingbrewing.com",
        "longitude": -98.274933,
        "latitude": 30.570273,
        "address": "207 Ave G",
        "postal_code": "78654",
        "city": "Marble Falls",
        "state": "TX",
        "telephone": "(830) 220-5083",
        "price": "$11-30",
        "hours": {
            "Mon": "Closed",
            "Tue": "Closed",
            "Wed": "11:00 AM - 10:00 PM",
            "Thu": "11:00 AM - 10:00 PM",
            "Fri": "11:00 AM - 10:00 PM",
            "Sat": "11:00 AM - 10:00 PM",
            "Sun": "11:00 AM - 8:00 PM"
        },
        "accommodations": [
            "Offers Takeout",
            "Many Vegetarian Options",
            "Accepts Credit Cards",
            "Accepts Apple Pay",
            "Outdoor Seating",
            "Moderate Noise",
            "Good For Kids",
            "Private Lot Parking",
            "Happy Hour Specials",
            "Dogs Allowed",
            "Wheelchair Accessible",
            "TV",
            "Covered outdoor seating"
        ],
        "unaccommodations": [
            "No Delivery",
            "Masks required",
            "Staff wears masks",
            "No Bike Parking"
        ],
        "rating_value": "4",
        "review_count": "170",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/2O5C9kjpdy3zcssxmKYgsA/l.jpg",
        "reviews": [
            {
                "author": "Kay R.",
                "datePublished": "2021-10-13",
                "reviewRating": "5",
                "description": "We stumbled across Bear King Brewing Co. as we were driving back to our lodgings. Here was a chance to stop for a cold one and a little taste of Texas with their Pimento Cheese appetizer. Both were great.  I had a Wandering Blonde Ale, which was excellent. Light and refreshing, but with real flavor -- something often missing in a blonde ale. The Hubs had a Hazy Ale, which was crisp and had an almost grapefruity tang on the tongue.  Being out-of-townersof the California persuation, we spotted pimento cheese on the menu and decided to give this southern staple a try. It was fantastic -- cheesy, garlicky, oniony, with a very slight spiciness to it. It's served with excellent ciabatta bread slices that have been grilled with olive oil, I think. The bread was great on its own, and the pimento cheese raised it to a whole new level of tastiness. I'd have happily ordered a second round of just the appetizer if dinner wasn't awaiting us elsewhere.   They have a good happy hour M-Th from 4-6 where the beers were $2 off. The pimento cheese app was $5.50, the happy hour beers were $4 each (16 oz), so we got out of there for just $13.  Great seating areas inside and out, too. Big fans in the large covered (non-smoking) patio made it a nice place to sit on an early evening. Pups are allowed on the patio if they're leashed at all times.  All in all, this place really does it right -- good beer, good food, and great ambience. Can't ask for more than that."
            },
            {
                "author": "Gus L.",
                "datePublished": "2022-03-25",
                "reviewRating": "4",
                "description": "Bear King has a great local brewpub here! Glad I stopped in on my recent visit to the area. The selection of beers and food is not extensive, but has a good variety and is well executed. The beers run from a nice blonde to a few tasty stouts and even a barley wine... as well as the ever popular hopy beers. The food follows suits with a decent selection of burgers, tacos and some great appetizers. The poutine and the fajita tacos were a great standout and I would head ab ck just for those. The only constructive criticism I would offer is on tasters, they have a great flight available but apparently their system doesn't allow you to get (and pay for) a single taster, you can get a free splash or a half pour...but I wanted just a taster of the barley wine :). Maybe next time. To tie it all off, the staff here was super friendly and helpful and did a great job of keeping the tables cleared, the drinks filled and the food flowing. Keep it up y'all!  Cheers!"
            },
            {
                "author": "W C.",
                "datePublished": "2022-03-14",
                "reviewRating": "4",
                "description": "This place was a pleasant surprise of a stop on our way back home to Austin from Inks Lake. We'd been to Blue Bonnet cafe before, and Bear King Brewing is right around the corner.  The space is open and clean, though a bit nondescript, and it seems like they could make it a bit more \"fun\" other than just a bunch of TV screens. We started with a flight a beers, most of whose names we've forgotten, but all of them were good. We particularly liked the hazy IPA and got another pint of that to share.  The food was better than expected. We got the Texas poutine as an app, and while we'd hardly call it poutine in any capacity, it was pretty good with the pulled meat and pico on top. For dinner, we split the turkey bigger and added the delight salad on the side, which was a decent portion. We enjoyed the burger, but there was a bit too much of whatever the spread was on it (pimento?) that was kind of overwhelming. The salad was basic, but got the \"greens\" job done.  What this place really has going for it is value: decent food at a decent price. It's a pleasant atmosphere with friendly and competent service. We'd be happy to go again if we were nearby, but it's not really a \"destination\" spot."
            },
            {
                "author": "Ashley C.",
                "datePublished": "2021-10-17",
                "reviewRating": "3",
                "description": "After checking out Sweet Berry we took to Yelp to find a place to lunch. Our first choice was closed and we felt like we'd be ok to give this place a try. Upon arrival around 230 PM there were tons of empty tables. We figured we had missed the lunch rush but apparently we were wrong. We immediately placed our order and having frequented many breweries across the state and country we knew there would be a bit of a wait. After about 20 minutes we got 1 appetizer and 1 meal (burger) for someone in our party. The food runner assured us the remaining appetizer and 3/4 of our meals (also burgers) would be out shortly. Time went by and at 20 minutes since the first food came out we stopped a food runner to check to see how much longer the remainder of our food would be. She said,\"Our kitchen is backed up and it'll be out soon.\" 10 more minutes goes by and we stopped another food runner to see if they could check for us. Again nothing. Finally a 3rd food runner see's that we've been sitting there awhile (mind you were watching people who ordered after us get their food) and comes to ask if we're still waiting on food. We said yes and while we weren't upset there was a wait we were upset 1/4 of our party got their food 40 minutes ago. She went and checked and 5 minutes later the remainder of our food came out. One item was requested without onion yet their were onions right on top. The food runner had offered to take it back and fix it but after waiting 1.5 hrs and 40 minutes after the first person in our party received their food we told her not to worry about it we'd just pick them off. I'm not sure what was going on in the kitchen but I'm not sure how the cooks/chefs can make 1 burger and yet  it the other 3 at once.   As far as the food it was mediocre at best. We had 4 different burgers and they were ok. We also had the Tx poutine and Buffalo wings. I'd save your money on those. The gravy on the poutine was the best part but fries were soggy due to super wet brisket and pico on top. Wings again were ok. I believe they're smoked but the skin was not crispy at all. Can't comment on the beers as we didn't order any. Maybe that's their money maker and the food is an after thought."
            },
            {
                "author": "Michaela P.",
                "datePublished": "2021-12-09",
                "reviewRating": "4",
                "description": "The in-laws have retired to Round Mountain and Bear King is now THE place to meet! Food is good. Beer is good. Service is good. Nice setting. Lots of games on TV. Dog friendly. And Dad picks up the tab...it's perfect!"
            },
            {
                "author": "Gail K.",
                "datePublished": "2022-03-06",
                "reviewRating": "3",
                "description": "The beer and service were great but the nachos were weird with pickled onions,  cold jalapeños,  and Parmigiano cheese..."
            },
            {
                "author": "Vincent W.",
                "datePublished": "2022-02-28",
                "reviewRating": "4",
                "description": "If you get hungry on the way to Fredericksburg from the Austin area, tbis is a great place to stop.  Excellent beer and great food."
            },
            {
                "author": "Christine C.",
                "datePublished": "2022-03-13",
                "reviewRating": "5",
                "description": "Good food and great beer.  Ordered swiggy ipa nice crisp taste to enjoy with a smashing burger!"
            },
            {
                "author": "Jacob T.",
                "datePublished": "2022-01-14",
                "reviewRating": "5",
                "description": "There's a decent variety of a beer here, about 8 to 12 types on tap at any given point. There's only been one that I haven't liked, and that was the Milky Way chocolate beer. The thing that really sets Bear King apart though is the quality of the food. You usually don't expect a lot from a bar, but I have enjoyed their queso and their tacos. I personally did not enjoy the poutine, but several of my friends did.  Not a bad place to go for dinner and a drink."
            },
            {
                "author": "Michelle G.",
                "datePublished": "2022-03-27",
                "reviewRating": "5",
                "description": "Stopped in again today... GREAT food as always- had the turkey burger and chips and queso, beer is great- had a hazy IPA. This place is a consistently great brewery that is light and bright. It seemed like the employees were a little more cheerful today than last visit despite it being busy. We will continue to come to this great brewery that Marble Falls is lucky to have!!"
            },
            {
                "author": "Bonnie R.",
                "datePublished": "2021-12-11",
                "reviewRating": "3",
                "description": "Had dinner here on our way to Burnet.  The beer was good and we liked be patio area.  My husband liked his burger and fries, however my southwest style El Oso salad was marginal.  It was mostly lettuce and some chicken but not much else as the menu described it.  The dressing wasn't a dressing but more like a dipping sauce.  It didn't pour out of the container at all.  Our friends had the child's chicken tenders and the shrimp tacos.  The chicken tenders looked good."
            },
            {
                "author": "Cora W.",
                "datePublished": "2022-02-27",
                "reviewRating": "4",
                "description": "I had the Greenhouse burger (no bun) and truffle fries. The truffle fries are amazing - crisp with just the right amount of truffle and parmesean - plus a beautiful presentation.  My husband had the Texas poutine. The gravy on that is phenomenal. He, also, had a chocolate marshmallow stout while I had Austin Eastciders. He loved the stout."
            },
            {
                "author": "Tammy V.",
                "datePublished": "2021-11-09",
                "reviewRating": "5",
                "description": "Enjoyed their patio, burgers, and beer selection on a warm and breezy fall afternoon!"
            },
            {
                "author": "Diron K.",
                "datePublished": "2021-11-02",
                "reviewRating": "4",
                "description": "We had been playing golf and stopped at the Bluebonnet Cafe for a late lunch and saw this place from it's parking lot. Looked cool, so we checked it out. Great vibe and great beer. Wished we had skipped the late lunch at the Bluebonnet and had eaten here. Everyone around us had great looking meals. The reason for the 4 stars and not 5, was that we did not have any food. Maybe next time. BTW, the Hefeweizen was great."
            },
            {
                "author": "Mark M.",
                "datePublished": "2022-01-23",
                "reviewRating": "5",
                "description": "Delicious burger friendly staff great beer what more can you ask for !!  Try the brisket burger u will not be disappointed!"
            },
            {
                "author": "Sarah N.",
                "datePublished": "2021-10-23",
                "reviewRating": "5",
                "description": "We are visiting the area. What an amazing place. Service was excellent, beer was awesome. You have to get the nachos. We loved it so much"
            },
            {
                "author": "Calily B.",
                "datePublished": "2021-03-07",
                "reviewRating": "4",
                "description": "Great brewpub in the middle of downtown Marble Falls. They have a great patio and indoor space. We've been here a couple of times now and and they consistently have good beers. My boyf really likes their black IPA.   Their COVID-19 protocols are a little annoying though - it just takes so much time to order through the site. Not sure why places do this, I think it's fine if you want to take the order at the front and not have waiter service, but ordering through a site on your phone is my least favorite thing a biz can do while I'm at the restaurant.   Anywho - the food is good. Well seasoned burger and good tacos.   If you're in the area, give them a visit if you're looking for good beer!"
            },
            {
                "author": "Joan M.",
                "datePublished": "2022-02-05",
                "reviewRating": "5",
                "description": "The Parmesan at killer! Do not share  I love their darker beers. Also pet friendly!  Well. We always make sure to take our friends and family there when the visit."
            },
            {
                "author": "Ryan P.",
                "datePublished": "2022-01-01",
                "reviewRating": "2",
                "description": "We are visiting on vacation and I'll just say I was not impressed with the quality of food. They have multiple positive reviews, but def didn't hit the spot for us."
            },
            {
                "author": "Stephanie G.",
                "datePublished": "2020-12-18",
                "reviewRating": "5",
                "description": "SOLID 5 STARS.   The food was fresh, hot, and lots of flavor. We had the nachos with brisket, could definitely feed two people, delicious! And the Legendary burger, only critique would be the pickle was not as crunchy as I prefer, but still a juicy flavorful burger, fries were great too!   We had a the hefe and the pecan porter, they were both fantastic!   They followed all COVID-19 restrictions to a T! And we felt very safe and comfortable dining in (it was my husband's first time dining in at a restaurant since March, so that's saying something).   Will pray to the beer and food Gods to please send us a Bear King Brewery to Jonestown, TX!   Also- special thank you to Kevin for helping us out in a pickle about printing a form. A+ SERVICE!"
            }
        ]
    },
    {
        "name": "Double Horn Brewing",
        "id": 588,
        "open_for_business": 1,
        "tags": [
            "Brewpubs"
        ],
        "website": "http://www.doublehornbrewing.com",
        "longitude": -98.276814,
        "latitude": 30.571135,
        "address": "208 Ave H",
        "postal_code": "78654",
        "city": "Marble Falls",
        "state": "TX",
        "telephone": "(830) 693-5165",
        "price": "Moderate",
        "hours": {
            "Mon": "4:00 PM - 9:00 PM",
            "Tue": "4:00 PM - 9:00 PM",
            "Wed": "11:00 AM - 9:00 PM",
            "Thu": "11:00 AM - 9:00 PM",
            "Fri": "11:00 AM - 9:00 PM",
            "Sat": "11:00 AM - 9:00 PM",
            "Sun": "11:00 AM - 8:00 PM"
        },
        "accommodations": [
            "Offers Takeout",
            "Many Vegetarian Options",
            "Accepts Credit Cards",
            "Moderate Noise",
            "Offers Catering",
            "Good For Kids",
            "Private Lot Parking",
            "Bike Parking",
            "Happy Hour Specials",
            "Dogs Allowed",
            "Wheelchair Accessible",
            "Open to All",
            "Covered outdoor seating"
        ],
        "unaccommodations": [
            "No Delivery",
            "Masks required",
            "Staff wears masks",
            "Accepts Android Pay",
            "Accepts Apple Pay",
            "Accepts Cryptocurrency",
            "No Drive-Thru",
            "Heated outdoor seating"
        ],
        "rating_value": "3.5",
        "review_count": "364",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/_gpp3PJ-U30doOuo4GkJIQ/l.jpg",
        "reviews": [
            {
                "author": "M. H.",
                "datePublished": "2022-01-19",
                "reviewRating": "4",
                "description": "great service though they were severely short staffed.  food was ok- great chicken tenders but chips were a bit greasy."
            },
            {
                "author": "Desirae O.",
                "datePublished": "2022-02-14",
                "reviewRating": "5",
                "description": "Nice little place after a long day of riding. Staff is always welcoming and attentive. We are a fan of the pizza. It's so good we don't want to explore anything else on the menu. Beer is pretty decent. Definitely a go to place when we are in town."
            },
            {
                "author": "Carly V.",
                "datePublished": "2022-04-02",
                "reviewRating": "5",
                "description": "My favorite brewery in Marble Falls. Great beer. Friendly staff. Trivia nights are the best."
            },
            {
                "author": "Stacia H.",
                "datePublished": "2022-02-19",
                "reviewRating": "2",
                "description": "This place is sub par at best.  Queso came with cheese skin on top...Gross!  Wings were awful, I think they must have been reheated about 3 times. I asked for them super crispy but that's not what I got. I got old wings! I ordered a dozen ate 3 of the most decent looking ones, still paid for it all. Didn't want to even bother with getting into it with the server.   Save yourself the trip and money. Make the wings and queso at home and buy a better beer!"
            },
            {
                "author": "Steve W.",
                "datePublished": "2021-11-17",
                "reviewRating": "5",
                "description": "To be honest it's not usually very easy to get five stars out of me unless you're doing something really right.  It seemed to us that the best time to be at Marble Falls is during the off-season where the rates are great and the restraunts are not crowded. This restaurant came well recommended to us from some locals that we talked to.  As someone who works in the beer and wine business, I'm always looking for a great brewpub to explore. This place definitely did not disappoint as all the beers styles were right on point when I got a sample flight. My wife had a salad and I opted for the fish and chips. I think I found the best item on the menu because it was a huge piece of perfectly cooked haddock. I will actually say it was one of the best fish and chip baskets I've had in my life. My wife loved her salad and all in all it was a great meal at what I'd call a very great price. We will definitely be back."
            },
            {
                "author": "Fedor E.",
                "datePublished": "2022-01-27",
                "reviewRating": "3",
                "description": "Cool atmosphere, friendly and helpful staff.  Beer was fine. Not bad, not impressive. Had the pale ale and the blond. I tasted some of the stouts my wife ordered .  The food was notably below average for a brew pub. I had some pulled pork nachos that I couldn't really eat. Weird combo of ingredients but even the pork itself was seasoned strangely , similar to chorizo .   Pizza was pizza. Tasted alright but was misshapen, and their sausage serving was so sparse I wasn't even sure it was on the pizza at first.   Mac and cheese we ordered for the kids had spicy seasoning on it, and they still didn't like it even after we removed it. I've never seen them not eat Mac and cheese before .  So I'm summation, cool place to meet with friends for beer, but not ideal place to have dinner. (My family goes to a lot of breweries and good food is pretty much the norm ).   Beer was cheap but food was overpriced . My tab was $70 after tip , which is not the usual ballpark for what we spend at a restaurant or brewery ."
            },
            {
                "author": "Diron K.",
                "datePublished": "2021-06-21",
                "reviewRating": "3",
                "description": "We stopped in here after a morning of golf. Thought we would have a beer and some food. There really weren't any beers to our liking, all they had were IPA's, pale ales and a watermelon beer. Not our style, but many seem to like this trend. I wanted something light and refreshing like a pilsner or a Hefeweizen.  Our food was okay, the fried pickles were excellent, my fish and chips were good and my wife said her BLT was okay."
            },
            {
                "author": "Victor R.",
                "datePublished": "2022-01-29",
                "reviewRating": "5",
                "description": "The staff are always friendly and welcoming, the brew, food and atmosphere are awesome!"
            },
            {
                "author": "John B.",
                "datePublished": "2021-12-27",
                "reviewRating": "5",
                "description": "Stopped in for lunch while driving through, been since pre-pandemic since we were here. Quick, friendly service, and they seem to have stepped up their beer as well. More choices than I remembered, and the the two IPAs I tried were very good. The burgers and sides were well done and tasty, and more than ample."
            },
            {
                "author": "Jacob T.",
                "datePublished": "2020-07-16",
                "reviewRating": "5",
                "description": "This place is now under new ownership / management and the quality of food has increased tremendously.  The staff is very friendly, and the prices are reasonable.  The burgers are especially tasty, and they now offer the Beyond Burger for any vegetarians in your group.  The beer is excellent - I especially enjoy the IPAs they have on tap.  During the pandemic they are also doing curbside orders, which is very convenient."
            },
            {
                "author": "Mark F.",
                "datePublished": "2021-02-04",
                "reviewRating": "4",
                "description": "we stopped in late afternoon for some brews and some food. We weren't disappointed in our selection of bruise and had several favorites. The food menu was quite extensive and we settled on the spicy sausage pizza with mushrooms. Lots of food and you won't be disappointed. My favorite beer was one of the IPAs I believe it was called lake water. Regardless, lots of good choices and they even had three guest beers which we took advantage of one. My only complaint was that social distancing was not enforced here enough such that we felt uncomfortable and left a little in it earlier than what we would normally have."
            },
            {
                "author": "Charles A.",
                "datePublished": "2020-12-23",
                "reviewRating": "2",
                "description": "Same prices, smaller portions. Like, WAY smaller portions. It's no optical illusion -- their chicken tacos have about as much chicken as my thumb is massive. I had two others that were even smaller.   Had to order a second order of sweet potato fries because they reduced their portion size there as well to only a handful. I don't usually bitch and whine about this kind of stuff, but this is kind of ridiculous.  The staff is nice but no one was wearing a mask which is against the law at this point too."
            },
            {
                "author": "Laura C.",
                "datePublished": "2021-12-05",
                "reviewRating": "2",
                "description": "We stopped by for dinner and it was okay. The pizza was super salty and the beer battered fish was really heavy on the batter. The staff were friendly and attentive. The atmosphere was loud and really echo-y. Probably won't be back."
            },
            {
                "author": "Rich G.",
                "datePublished": "2020-02-29",
                "reviewRating": "5",
                "description": "It is still a 5. Love Double Horn always great service and good food. Here for lunch on Saturday.   Started with fried dill pickle appetizer. I had the individual pizza with sausage and pepperoni excellent. Others had a taco.   Understand the original owners are back. Making some updates - reworked the kitchen.   Excellent beers - service and food."
            },
            {
                "author": "Dave H.",
                "datePublished": "2020-08-18",
                "reviewRating": "4",
                "description": "This establishment was one we hadn't been to before and we thought, let's see what they got.  We entered the restaurant and we greeted by cheerful servers and seated (socially distant of course). We did not know what kind of beer to get and our server recommended the \"beer flight\" which is few oz of 4 beers.  We tried the blond to the dark to see which ones we might want to order in a larger glass.  We also tried their super pretzel and pepperoni pizza.  All of the food was very good as was the beer.  We choose to go with a Blond Growler to bring home.  Definitely a good experience.  Easy in and out in Marble Falls off the 281."
            },
            {
                "author": "Sandi N.",
                "datePublished": "2019-11-25",
                "reviewRating": "3",
                "description": "This brewery has some tasty beers (we tried their Blond and IPA) and the food was \"ok\". I had the Bison burger which was very tasty and my husband had the schnitzel (which he said was too dry).  A table near us ordered a large pizza and it was delivered with the pieces cut into SQUARES.  Noooooooo  The atmosphere of the main dining room is a bit echoey and lacking any real character.  The bar area is fairly small with a few tables and bar with barstools.   Waitress was friendly and service was good.  Women's bathroom clean but I was told that the men's bathroom was not."
            },
            {
                "author": "Kevin J.",
                "datePublished": "2020-12-13",
                "reviewRating": "1",
                "description": "In town visiting so we could see the Christmas lights at Lake Park.  We're starving so decided on some place local and close before walking thru Christmas wonderland.  Four of us were seated quickly, unfortunately that was the only thing quick all evening.  Three of us ordered beers.  Seems like they needed to go over the river and thru the wood to bring back the beers.  It was quite the wait.  At least they were cold.  Ordered our food.  Three of us had burgers and the fourth had the fries appetizer, covered in cheese.  Family of three sat down at the table next to us about 20 minutes after we had arrived.  They ordered, ate, and were leaving at the time we got our food.  Over an hour wait, for something that is fairly simple to make.  Waiter came by once to get another beer order.  Finished both beers slowly, and still had not received our food.  Finally delivered our burgers,  ready to dig in.  Presentation was nice, looked good.  But took a bite and realized looks can be deceiving.  Patty was drier than the Sahara desert.  All of the flavor and juice had been cooked out.  Maybe this is why it took so long to get our food, they were too busy overcooking it.  The fried okra was not any better.  Almost had a doughy texture to it.  Not crisp and definitely no flavor.  Also two of the beers on the menu were out."
            },
            {
                "author": "Michelle C.",
                "datePublished": "2022-03-03",
                "reviewRating": "1",
                "description": "It was my first time being here with my family since moving to this town and we came in on trivia night which was cool I suppose (not my thing) so the other people in my party played while I did my own thing.. ya know whatever. Well for one the musics was incredibly loud the people at my table couldn't hear each other in order to discuss their answers so they are having to yell.. what's the point in the trivia if everyone is screaming their answers? So I spelled out a word in my Facebook search bar and was aggressivly told by Trenton who also was having to talk loudly \"to get off my phone\"  1. I wasn't playing which I told him 3 times and he kept saying how he would disqualify us.. first of all who is \"we\" because I was not involved in trivia which if you would've listened I told you 3 times , and  Who is he to tell a grown adult to get off their phone... sir until you pay my bill please mind your business... basically the level of aggression over me showing my mother how to spell a word on my phone was ridiculous I don't care if you care about the spelling but clearly she did... I understood when you said no phones in the beginning (there we LOTS of people using theirs because my whole table was taking about it) but I was not playing and I didn't enjoy hearing people get irritated and screaming their answers and ideas at one another either.... Trivia nights not THAT serious dude... take a chill pill and maybe lay off the beer while working so you don't seem so hateful. Other than that everything else was okay but due to the experience and how uncomfortable I felt after having that interaction I probably won't be back and won't recommend."
            },
            {
                "author": "amber p.",
                "datePublished": "2021-12-01",
                "reviewRating": "1",
                "description": "The employee who seats incoming guests was wearing a very politically divisive shirt which contained vulgar language. No matter who you support, I would call that unprofessional, and that you only want to get half the public's business"
            },
            {
                "author": "Ashley R.",
                "datePublished": "2020-10-10",
                "reviewRating": "5",
                "description": "The brewery environment is covid-friendly, clean and the staff is welcoming and extremely kind! The beer selection is second to none (especially the holiday pumpkin ale) a wide selection of food! We enjoyed the Currywurst an Oktoberfest 2020. It's a must-visit brewery experiencing!!"
            }
        ]
    },
    {
        "name": "River City Grille",
        "id": 278,
        "open_for_business": 1,
        "tags": [
            "American (Traditional)",
            "Wine Bars"
        ],
        "website": "http://www.rivercitygrilletx.com/",
        "longitude": -98.276825,
        "latitude": 30.568617,
        "address": "700 1st St",
        "postal_code": "78654",
        "city": "Marble Falls",
        "state": "TX",
        "telephone": "(830) 798-9909",
        "price": "$11-30",
        "hours": {
            "Mon": "11:00 AM - 8:00 PM",
            "Tue": "11:00 AM - 8:00 PM",
            "Wed": "11:00 AM - 8:00 PM",
            "Thu": "11:00 AM - 8:00 PM",
            "Fri": "11:00 AM - 9:00 PM",
            "Sat": "11:00 AM - 9:00 PM",
            "Sun": "11:00 AM - 8:00 PM"
        },
        "accommodations": [
            "Takes Reservations",
            "Offers Delivery",
            "Offers Takeout",
            "Masks required",
            "Staff wears masks",
            "Many Vegetarian Options",
            "Accepts Credit Cards",
            "Outdoor Seating",
            "Casual",
            "Moderate Noise",
            "Casual Dress",
            "Offers Catering",
            "Good for Groups",
            "Good For Kids",
            "Good for Lunch, Dinner",
            "Private Lot Parking",
            "Bike Parking",
            "Free Wi-Fi",
            "Best nights on Friday, Saturday, Sunday",
            "Full Bar",
            "TV"
        ],
        "unaccommodations": [
            "Accepts Apple Pay"
        ],
        "rating_value": "3.5",
        "review_count": "418",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/zrjMk0LqtGLMRd9J-6yz4w/l.jpg",
        "reviews": [
            {
                "author": "Stephanie P.",
                "datePublished": "2022-03-12",
                "reviewRating": "5",
                "description": "We are visiting from out of town and stopped by here for dinner on a Friday night with our 3 kids. The food was great, and came out fast and hot. The service was also great! Everyone had a smile and was happy to help with anything we needed. The view is amazing as well! Definitely 5 stars."
            },
            {
                "author": "Elisa M.",
                "datePublished": "2022-01-30",
                "reviewRating": "5",
                "description": "We were in town visiting a friend and she made lots of suggestions but we ended up here and I personally am thankful this is where we ended up at.   Let me start off by saying that the staff is some of the friendliest folks I've met. We had a waitress who helped out our waitress and she did it with a smile.   We ordered the chips, queso and salsa to start off with. At first glance the salsa looked like it was marinara sauce but it was actually good. The queso was a little thin but still good.   We ordered a steak salad and a cheeseburger and both meals were good. The cherry limeade was delicious and seriously I can't think of a bad thing to say about this place.   It's located on the water so you can sit outside and take in the views or sit inside and sit by the window and still have a beautiful view.   Give 'em a try!"
            },
            {
                "author": "Kris V.",
                "datePublished": "2021-10-02",
                "reviewRating": "4",
                "description": "Good food, beautiful view. The outdoor seating overlooks the river. The dining room is all windows so you can sit in the ac and still have a view.  I'd imagine before covid the dining room held a few more tables.  The Paul's chicken is a large breast breaded in chips, topped with lots of hatch Chile and shredded cheese. I liked it better after asking for a side of white gravy.  The green beans are honest, not cooked to death, still green. The baked potato was typical, though not seasoned on the outside like I'm used to.  All in all, it's plenty.  The chicken fried steak was two pieces, actually seasoned in the breading, tender enough, and disappeared quickly. Gravy is good too.  The scratch cheesecake was good. I got plain, without toppings, which they offer a few. It's baked, not too dense, thick enough crust.  The bread pudding was a cereal bowl full of yummy. Pecans and raisins all smothered in a bourbon sauce, not an icing. Very good.  Prices are a smidge high, but expected for the area.  Staff was pleasant, quick to respond.  I'll come back next time we are in the area."
            },
            {
                "author": "John A.",
                "datePublished": "2022-03-20",
                "reviewRating": "5",
                "description": "Family trip to Marble Falls, TX. We have been to River City Grille multiple times and for good reason. Good food and great service. The wait is always a bit long but it's because people want to eat here. The outside river view is a plus! We will be back."
            },
            {
                "author": "Marlo C.",
                "datePublished": "2022-03-25",
                "reviewRating": "5",
                "description": "Enjoyed a delicious meal on the deck(overlooking Lake Marble Falls). The fish taco's were absolutely scrumptious! Salads were fresh and yummy. Service was top notch(Shane was our server). We shared a generous portion of bread pudding for dessert.  Will definitely be back!"
            },
            {
                "author": "Alex Z.",
                "datePublished": "2021-07-31",
                "reviewRating": "4",
                "description": "Nice lake view restaurant in marble fall, the price is very good for the portion of food. Most of the food is about $10 unless you go for steak. There's outdoor seating as well as indoor seating with large window with beautiful lake view.  The service is very fast and attentive. I ordered calamari which are top with cheese powder which seems strange, it's also like a calamari fingers instead of rings. With cheese is not my favorite part. The fish taco came in three large pieces of taco with the two pieces of filet in each taco, huge portion. The green chili burger is juicy and has a good kick to it but the buns are soggy which needs some improvement."
            },
            {
                "author": "Ried S.",
                "datePublished": "2021-07-31",
                "reviewRating": "4",
                "description": "I want to start by saying that the service here is probably the beat I've experienced since the pandemic began. In a world where so many restaurants are understaffed and waiters overwhelmed, the team here could not have been more attentive from the moment we sat down. There was no waiting for anything - they were incredibly intuitive and knew just when to check in with us and offer refills or bring extra napkins. 5 stars for the service.   The food was pretty good which is why I'm giving 4 stars. I had a delicious green chili burger, but the calamari fell flat for me. I don't know why they sprinkled parmesan cheese on it. My recommendation would be to offer this on the side.   Overall, solid option in Marble Falls with beautiful views over the lake. Sit outside when the weather is tolerable."
            },
            {
                "author": "Heather T.",
                "datePublished": "2021-07-14",
                "reviewRating": "4",
                "description": "We stopped in here while on vacation to eat by the water and were not disappointed.   The food was great. I got the famous pork chop and green beans and it was delicious.   The atmosphere is great. We sat inside and still had great lakeside views. The parking was easy and even at prime time, we easily got a table.   The staff was friendly but the service was disorganized and slow. That is the only reason we aren't giving it 5 stars."
            },
            {
                "author": "Gracie G.",
                "datePublished": "2022-03-27",
                "reviewRating": "1",
                "description": "If I could give it 0 stars, I would. Called 2 min before getting there to make sure the wait time was acceptable for a group of nine and the manager lied and said we took 10 minutes to get there and the tables that they could have used for us, were given to other parties and that they couldn't hold the tables for us. Trashy place, smelled disgusting, save your money and go elsewhere with better service!"
            },
            {
                "author": "Michael O.",
                "datePublished": "2022-02-01",
                "reviewRating": "4",
                "description": "I eat here anytime I'm in town for work. Beautiful views of the Colorado river on the deck. Me or my guest have had almost everything on the menu and everything thing is worth trying. If you are looking for a local place, give this place a try. The pork chops are amazing."
            },
            {
                "author": "Rob H.",
                "datePublished": "2021-10-09",
                "reviewRating": "4",
                "description": "The wife decided to stop in today after I had grabbed some mounts from the taxidermist in town. We got there just as they opened and glad we did. We got a table on the balcony. Weather was perfect, staff was friendly, food was good and view is awesome. I had the fish tacos which I loved and she had the pulled pork tacos that she liked a lot. Portions were perfect as was flavor. My only gripe would be paying for salsa and chips. This is Texas! It should almost be a given to have chips and salsa at the table! We will most definitely be making a return trip."
            },
            {
                "author": "Kevin S.",
                "datePublished": "2022-01-03",
                "reviewRating": "3",
                "description": "We were heading back to our hotel late and wanted something quick to eat. We decided to share the Fried Shrimp House Favorite with sweet potato fries and cole slaw. The shrimp were OK but cooked just a little too long for our liking. The sweet potato fries were just barely cooked and were just limp and tasteless. The cole slaw was actually pretty good. I doubt we'll return, which is a shame given the nice view they have."
            },
            {
                "author": "Vince A.",
                "datePublished": "2021-07-18",
                "reviewRating": "4",
                "description": "I have always enjoyed having lunch here. The food is good, and the management and staff are incredibly service minded. The pork-chops, are bone in with a unique brown sugar and cumin glaze, cooked to perfection. Also as an appetizer try the loaded fried potatoes ."
            },
            {
                "author": "Joan M.",
                "datePublished": "2022-02-05",
                "reviewRating": "3",
                "description": "Not one of my faves, service and food have always been mediocre. Great if you want to dine with a view of the river."
            },
            {
                "author": "Heather W.",
                "datePublished": "2022-02-07",
                "reviewRating": "2",
                "description": "Awesome to be able to order and pay online so we were able to grab lunch without a long stop on our road trip.  Really nice customer service and clean bathrooms.  Food was disappointing. I would skip this restaurant next time unless in a hurry."
            },
            {
                "author": "Blaine B.",
                "datePublished": "2022-02-27",
                "reviewRating": "1",
                "description": "I have been to this restaurant 4 or 5 times over the last 3 years. The food has always been mediocre but edible until my visit the other day that was with my wife. My sweet tea tasted like catfish and so did the green beans. I was very disappointed. My wife had a steak sandwich which she couldn't eat either. If your a fan of catfish then this is the place for you. I am not and don't want want my sweet tea to taste like it was brewed in the lake nor the food that I ordered. We both did not feel well after our meal, maybe it was just in our minds because the meal was such a disappointment or maybe it was because everything was cooked in the same grease as the catfish?"
            },
            {
                "author": "Drew D.",
                "datePublished": "2021-11-15",
                "reviewRating": "4",
                "description": "This was one of the first places I ate upon moving to Texas.   Usually imma chicken fried steak kinda dude (which theirs is actually incredible) but recently I've been on a sandwich kick.  The fried catfish sandwich actually bangs. The flavor was on point and the bread was super soft.  If I was just a tad bit fatter I could finish this monster and the fries, but unfortunately even my sweat shorts waistband had enough.  L"
            },
            {
                "author": "Ron K.",
                "datePublished": "2020-09-14",
                "reviewRating": "4",
                "description": "This is a nice place to grab a bite when driving through. We sat out on the patio and enjoyed the view of the river. The food was good but what stood out was the green chili and cheese potatoes, they were fantastic! The waitress was very nice , the food good and the view great. With a little more effort they could make this place epic. Either way, I recommend stopping here when your passing through , you won't be disappointed."
            },
            {
                "author": "Garry H.",
                "datePublished": "2021-08-29",
                "reviewRating": "5",
                "description": "Considering the location of this restaurant, I was expecting some stupid crazy high prices. More on that later. I told the hostess this was our first time here and wanted to celebrate our anniversary on the patio. She immediately took us to the worst table on the patio. Thanks. The waitress had no problem putting us at one of the best tables on the patio. Your awesome! All staff were wearing masks. We ordered the Texas grilled Reuben and the Buffalo Chicken sandwich. Both were wonderful. Very seldom does Glenda finish a sandwich! Fries were good and the coleslaw was wonderful. I'm a huge fan of  Long John Silver's coleslaw, sweet and creamy. Very few places make it like that. River City Grille's was a perfect copy! Glenda stopped me from licking the bowl. Now, if your eating wonderful food on a wonderful patio at a wonderful restaurant facing a wonderful lake, your going to pay through the nose. Nope. Normal prices. That's why 5 stars. We will definitely be back."
            },
            {
                "author": "Paul M.",
                "datePublished": "2022-03-06",
                "reviewRating": "3",
                "description": "Food was good.  Service originally was excellent.  However, I ate in the bar and the bartender took my credit card and ran off before I could tell him I wanted dessert.  I thought most restaurants automatically ask if you want that.  He had to run it again and kinda acted like it was my fault.   lol"
            }
        ]
    },
    {
        "name": "Brass Hall",
        "id": 230,
        "open_for_business": 1,
        "tags": [
            "Music Venues",
            "Bars"
        ],
        "website": "http://www.brasshall.com",
        "longitude": -98.278097,
        "latitude": 30.572576,
        "address": "909 3rd St",
        "postal_code": "78654",
        "city": "Marble Falls",
        "state": "TX",
        "telephone": "(830) 201-4380",
        "price": "Moderate",
        "hours": {
            "Mon": "4:00 PM - 2:00 AM ()",
            "Tue": "4:00 PM - 2:00 AM ()",
            "Wed": "4:00 PM - 2:00 AM ()",
            "Thu": "4:00 PM - 2:00 AM ()",
            "Fri": "4:00 PM - 2:00 AM ()",
            "Sat": "4:00 PM - 2:00 AM ()",
            "Sun": "4:00 PM - 2:00 AM ()"
        },
        "accommodations": [
            "Takes Reservations",
            "Accepts Credit Cards",
            "Outdoor Seating",
            "Casual",
            "Moderate Noise",
            "Good for Groups",
            "Good For Dancing",
            "Pool Table",
            "Bike Parking",
            "Free Wi-Fi",
            "DJ, Background Music, Juke Box, Live Music, Karaoke",
            "Best nights on Thursday, Friday, Saturday",
            "Full Bar",
            "Smoking Outside Only",
            "Wheelchair Accessible",
            "TV"
        ],
        "unaccommodations": [
            "Accepts Android Pay",
            "Accepts Apple Pay",
            "Not Good For Kids"
        ],
        "rating_value": "3",
        "review_count": "15",
        "image": "https://s3-media0.fl.yelpcdn.com/bphoto/0zmNR7WzzD-6lBksXdyH1A/l.jpg",
        "reviews": [
            {
                "author": "Joseph V.",
                "datePublished": "2021-10-02",
                "reviewRating": "5",
                "description": "This place is awesome!  The staff is great, always a fun mix of event types, good pricing on drinks, and we always have a blast here. I highly recommend trying this place out.  We've seen Randy Rogers, AJ Castillo, Z-Ro, Paul Wall, and I heard Jon B was coming in Feb 2022!!!"
            },
            {
                "author": "Sandi N.",
                "datePublished": "2019-11-23",
                "reviewRating": "1",
                "description": "Worst night in a very long time, thanks to Brass Hall!  We had been unimpressed on a prior visit but decided to give them another shot when we heard that a band we like was playing there (Back in Black - a tribute to ACDC).  We bought tickets weeks ago and paid extra for \"reserved seating\".  Brass Halls FB and ticket page said show at 7.  Because we were making the long drive from Austin, we FB messaged to confirm time.  We were told \"maybe 8\".  We showed up at 7:30 and our paid for and reserved seats were two barstools behind a giant mirrored pillar, with NO view to the stage.  We were told that was all that was available.  Brass Hall is a total dingy dive bar with pool tables, noisy game room, watered down drinks and a stage in the corner.  Because we had already had a few beers with dinner at a brewery, we decided to pace ourselves with drinking and wait until the band came on.  8:00 went by, then 8:30.  People around us, who'd been waiting for a band to come on at 7, were on rounds 4 and 5 of drinks and becoming louder and more obnoxious. 9:00 goes by and Back in Black is finally starting to enter the building one at a time to set up their equipment.  It's 9:20, Back in Black are still not in their stage clothes, no sound check has been done and they seem in no hurry.  9:30, we've had enough and leave.  We wasted a long drive and $50 of tickets all because a venue that BOOKED a band could not even accurately say when they would play.  Very poor management and booking.  And shame on Back in Black for not caring about what time was posted or about fans like us who drove a long distance to see them.  One final \"cherry\" on the steaming lump of goo that is Brass Hall....    The bathrooms.  There are no stall doors in either the men's or women's bathrooms.  What you have instead are... (wait for it), TA-DA -- velvet curtains!  Not only are they totally lacking in privacy but what an absolute hygenic wasteland.  Blue light anyone?"
            },
            {
                "author": "Shawn M.",
                "datePublished": "2021-10-03",
                "reviewRating": "2",
                "description": "Hoped to have a Saturday night drink tonight.  $20.00 cover (per person) for a tribute band.   That's a little steep, even for a tribute band.   Don't know if that's a band decision or a bar decision, but the math will never work out.  Less patrons, less bar tab, less money."
            },
            {
                "author": "Penii G.",
                "datePublished": "2021-10-02",
                "reviewRating": "5",
                "description": "Never disappointed when I come out. Though not frequent it's enough for me to know this place is genuine! They put every effort into making it a pleasant atmosphere no matter the occasion or show!! And now more of an excuse to come out. Every 1st Saturday of the month by friend DJ Smurf will be there! Brass Hall is a place you will come back to if you go at least once!!!"
            },
            {
                "author": "Pete F.",
                "datePublished": "2018-02-02",
                "reviewRating": "4",
                "description": "This is not a 4 Star because of the quality of the establishment, but, for the atmosphere of the venue and the people we stopped in to have a drink and to check it out. We were relative strangers to the place, but, we were welcomed by the bar staff and everyone was very open and friendly. The drinks were not expensive. The wife and I had 2 drinks each and the tab was $12.  They have an arcade, good sized dance floor and pool tables.  There is a DJ stand supposedly for weekend entertainment.  They do have weekend entertainment.   The place gives you a warm Texas feeling. The people in this small town so far have been neat and friendly. Very nice place to visit."
            },
            {
                "author": "Christine B.",
                "datePublished": "2019-04-20",
                "reviewRating": "1",
                "description": "Drinks are very weak.  Bartenders are more interested in talk to each other than helping customers.  The straw that broke the camels back was when I ordered my husband a double crown and my drink.  The bartender poured my husband's drink and went to get mine, the other bartender picked up a bunch of dirty glass which included my husband's drink.  When the other bartender saw it he wanted the drink back so he could serve it no way my friend! Not coming here again."
            },
            {
                "author": "Jennifer O.",
                "datePublished": "2018-09-30",
                "reviewRating": "1",
                "description": "This place was a waste of money for cover charge. DJ sucked ass - he needs to adjust his speakers, they crack when the music plays... he plays music so old-  today's 20's patrons their parents were  having sex to that music ... not up to date with music that draws a crowd.  More people were on the balcony smoking than being inside dancing... get a better talent if you plan to draw in the crowd.   Out of date music - too old school - not worth a shit--- his mixing sucks!! Hire someone with more experienced- if I wanted to see one lady show her twat I would would have gone to a strip club.  80's country - Keith Whitley Don't close your eyes(1988)  is his closing song... what a waste of time...  there are better DJ's in Marble Falls... guess you get what you pay for.  Check out his video of the club and you will see the only person dancing who said she's a friend of the DJ's and needed to come support her friend. Dated Friday Night / Saturday Morning - 9/29/18-9/30/18. Sad thing when your family doesn't even want you to DJ for their family reunion because you suck that much - let's go Brass Hall step up your game if you want real people to spend money at your establishment. The floor was danced on 10# of the time that alone says something."
            },
            {
                "author": "Jared M.",
                "datePublished": "2016-08-17",
                "reviewRating": "5",
                "description": "Friendly staff, good booze, great music, cheap drinks, solid pool table. What's not to like? The live music they are bringing to the Marble Falls scene is also very impressive. The bartender Joe is knowledgeable and friendly. If you are a local, you probably already know -- Brass Hall is where it's at."
            },
            {
                "author": "Barbara P.",
                "datePublished": "2017-07-04",
                "reviewRating": "1",
                "description": "Worse entertainment ever the night before the 4th of July.  Also service was horrible!   Sat at bar with 2 waiters having conversations with customers while we sat and waited and waited and waited.  Never acknowledged us until I had to get their attention to order a beer.   Not impressed at all!"
            },
            {
                "author": "Kaitlyn T.",
                "datePublished": "2017-09-19",
                "reviewRating": "5",
                "description": "Best bar in Marble Falls, they're really raising the standards out there. Drinks are strong and cheap, the staff is very friendly and attentive. Great live music. I will definitely be back."
            },
            {
                "author": "Carl J.",
                "datePublished": "2017-09-24",
                "reviewRating": "5",
                "description": "Great place to hang, great place to play. Sound man Ben was really great, staff was incredible."
            },
            {
                "author": "Angela A.",
                "datePublished": "2017-06-13",
                "reviewRating": "2",
                "description": "Talent was amazing, equipment was good, sound left a lot to be desired. This was my second time here on a Monday night. Might be my last."
            },
            {
                "author": "R H.",
                "datePublished": "2018-03-18",
                "reviewRating": "1",
                "description": "Beware this s!th0le. Seriously horrible service. Never thought I'd be in a real life version of Paddy's Pub."
            },
            {
                "author": "Joshua C.",
                "datePublished": "2015-12-01",
                "reviewRating": "5",
                "description": "The bartenders were great, and the folks at the bar were super friendly. We were out from Austin, and the drive was beautiful. Can't wait to go back again!"
            },
            {
                "author": "C C.",
                "datePublished": "2015-11-10",
                "reviewRating": "5",
                "description": "Love the re-vamped Brass Hall! Great place to watch a show or meet up with friends for a hand-crafted drink. The prices are fair, the staff seemed really great, and knew their stuff about booze. Can't wait to be back for some live music and dancing on their beautiful dance floor. Glad I found this spot!"
            }
        ]
    }
]